# PromptIntegerOptionsEventArgs Class

## Overview

#### Description
This class provides data for the PromptingForInteger event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptIntegerOptionsEventArgs
```

```text
public sealed class PromptIntegerOptionsEventArgs : EventArgs;
```

### Properties

- Options

## Properties Details

### Options

#### Description
Gets the input parameters of the prompt.
```text
public PromptIntegerOptions Options;
```

#### Conditions
Read-only