# AssocPlaneSurfaceActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocPlaneSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocPlaneSurfaceActionBody
```

```text
public class AssocPlaneSurfaceActionBody : AssocPathBasedSurfaceActionBody;
```

### Constructors

- AssocPlaneSurfaceActionBody

### Methods

- CreateInstance

## Constructors Details

### AssocPlaneSurfaceActionBody

#### Description
This wraps the ObjectARX AcDbAssocPlaneSurfaceActionBody::AcDbAssocPlaneSurfaceActionBody() method.
```text
public AssocPlaneSurfaceActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARX AcDbAssocPlaneSurfaceActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    ObjectId resultingSurfaceId,
    PathRef inputPath,
    [MarshalAs(UnmanagedType.U1)] bool enable
);
```