# PromptDoubleResultEventArgs Class

## Overview

#### Description
This class provides data for the PromptedForDouble> event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptDoubleResultEventArgs
```

```text
public sealed class PromptDoubleResultEventArgs : EventArgs;
```

### Properties

- Result

## Properties Details

### Result

#### Description
Gets the result of the selection.
```text
public PromptDoubleResult Result;
```

#### Conditions
Read-only