# Autodesk.AutoCAD.DatabaseServices.DetailViewIdentifierPlacement Enumeration

## Overview

#### Description
The type of detail view identifier placement.
```text
public enum DetailViewIdentifierPlacement {
  OutsideBoundary,
  OutsideBoundaryWithLeader,
  OnBoundary,
  OnBoundaryWithLeader
}
```

#### Members
| Members | Description |
| --- | --- |
| OutsideBoundary | AcDbDetailViewStyle::kOutsideBoundary. The return value is enum. |
| OutsideBoundaryWithLeader | AcDbDetailViewStyle::kOutsideBoundaryWithLeader. The return value is enum. |
| OnBoundary | AcDbDetailViewStyle::kOnBoundary. The return value is enum. |
| OnBoundaryWithLeader | AcDbDetailViewStyle::kOnBoundaryWithLeaderenum |