# LivePreviewPropertySetting Class

## Overview

#### Description
This is class Autodesk.AutoCAD.EditorInput.LivePreviewPropertySetting.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.LivePreviewActionBase
    Autodesk.AutoCAD.EditorInput.LivePreviewPropertySetting
```

```text
public sealed class LivePreviewPropertySetting : LivePreviewActionBase;
```

### Constructors

- LivePreviewPropertySetting

### Methods

- Execute

## Constructors Details

### LivePreviewPropertySetting

#### Description
This is LivePreviewPropertySetting, a member of class LivePreviewPropertySetting.
```text
public LivePreviewPropertySetting(
    PropertyDescriptor prop,
    object component,
    object value
);
```

### Execute

#### Description
This is Execute, a member of class LivePreviewPropertySetting.
```text
public sealed override void Execute();
```