# SubDMesh Class

## Overview

#### Description
This .NET class wraps the ObjectARX AcDbSubDMesh Class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.Entity
        Autodesk.AutoCAD.DatabaseServices.SubDMesh
```

```text
public class SubDMesh : Entity;
```

### Methods

- Cap
- Collapse
- ComputeSurfaceArea
- ComputeVolume
- ConvertToSolid
- [ConvertToSurface([MarshalAs(UnmanagedType.U1)] bool, [MarshalAs(UnmanagedType.U1)] bool)](#converttosurface([marshalas(unmanagedtype.u1)]-bool,-[marshalas(unmanagedtype.u1)]-bool))
- [ConvertToSurface([MarshalAs(UnmanagedType.U1)] bool, SubentityId)](#converttosurface([marshalas(unmanagedtype.u1)]-bool,-subentityid))
- [ExtrudeConnectedFaces(FullSubentityPath[], double, Vector3d, double)](#extrudeconnectedfaces(fullsubentitypath[],-double,-vector3d,-double))
- [ExtrudeConnectedFaces(FullSubentityPath[], Point3dCollection, double)](#extrudeconnectedfaces(fullsubentitypath[],-point3dcollection,-double))
- [ExtrudeFaces(FullSubentityPath[], double, Vector3d, double)](#extrudefaces(fullsubentitypath[],-double,-vector3d,-double))
- [ExtrudeFaces(FullSubentityPath[], Point3dCollection, double)](#extrudefaces(fullsubentitypath[],-point3dcollection,-double))
- GetAdjacentSubentPath
- [GetCrease(FullSubentityPath[])](#getcrease(fullsubentitypath[]))
- GetCrease(SubentityId)
- GetFacePlane
- GetNumberOfSubDividedFacesAt
- GetObjectMesh
- GetSubDividedVertexAt(int)
- GetSubDividedVertexAt(SubentityId)
- GetSubentColor
- GetSubentMaterial
- GetSubentMaterialMapper
- GetSubentPath
- GetVertexAt(int)
- GetVertexAt(SubentityId)
- MergeFaces
- Setbox
- SetCone
- SetCrease(double)
- [SetCrease(FullSubentityPath[], double)](#setcrease(fullsubentitypath[],-double))
- SetCylinder
- SetDragStatus
- SetPyramid
- SetSphere
- SetSubDMesh
- SetSubentColor
- SetSubentMaterial
- SetSubentMaterialMapper
- SetTorus
- SetVertexAt(int, Point3d)
- SetVertexAt(SubentityId, Point3d)
- SetWedge
- Spin
- SplitFace
- SubdDivideDown
- SubdDivideUp
- SubdRefine()
- [SubdRefine(FullSubentityPath[])](#subdrefine(fullsubentitypath[]))

### Properties

- FaceArray
- NormalArray
- NumberOfFaces
- NumberOfSubDividedFaces
- NumberOfSubDividedVertices
- NumberOfVertices
- SmoothLevel
- SubDividedFaceArray
- SubDividedNormalArray
- SubDividedVertices
- VertexColorArray
- VertexNormalArray
- VertexTextureArray
- Vertices
- Watertight

## Methods Details

### Cap

#### Description
This wraps the ObjectARX AcDbSubDMesh::cap() method
```text
public void Cap(
    FullSubentityPath\[\] edges
);
```

### Collapse

#### Description
This wraps the ObjectARX AcDbSubDMesh::collapse() method
```text
public void Collapse(
    SubentityId subentityId
);
```

### ComputeSurfaceArea

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::computeSurfaceArea.
```text
public double ComputeSurfaceArea();
```

### ComputeVolume

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::computeVolume.
```text
public double ComputeVolume();
```

### ConvertToSolid

#### Description
This .NET method wraps the ObjectARX AcDbSubDMesh::convertToSolid.
```text
public Solid3d ConvertToSolid(
    [MarshalAs(UnmanagedType.U1)] bool convertAsSmooth,
    [MarshalAs(UnmanagedType.U1)] bool optimize
);
```

### ConvertToSurface([MarshalAs(UnmanagedType.U1)] bool, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::convertToSurface Method.
```text
public Autodesk.AutoCAD.DatabaseServices.Surface ConvertToSurface(
    [MarshalAs(UnmanagedType.U1)] bool convertAsSmooth,
    [MarshalAs(UnmanagedType.U1)] bool optimize
);
```

### ConvertToSurface([MarshalAs(UnmanagedType.U1)] bool, SubentityId)

#### Description
This .NET method wraps the ObjectARX method
AcDbSubDMesh::convertToSurface(bool bConvertAsSmooth, const AcDbSubentId& id, AcDbSurface*& pSurface).
```text
public Autodesk.AutoCAD.DatabaseServices.Surface ConvertToSurface(
    [MarshalAs(UnmanagedType.U1)] bool convertAsSmooth,
    SubentityId subentId
);
```

### ExtrudeConnectedFaces(FullSubentityPath[], double, Vector3d, double)

#### Description
This wraps the ObjectARX AcDbSubDMesh::extrudeConnectedFaces(const AcDbFullSubentPathArray&amp; subentPaths, double length, const AcGeVector3d&amp; dir, double taper) method
```text
public void ExtrudeConnectedFaces(
    FullSubentityPath\[\] paths,
    double length,
    Vector3d dir,
    double taper
);
```

### ExtrudeConnectedFaces(FullSubentityPath[], Point3dCollection, double)

#### Description
This wraps the ObjectARX AcDbSubDMesh::extrudeConnectedFaces() method
```text
public void ExtrudeConnectedFaces(
    FullSubentityPath\[\] paths,
    Point3dCollection alongPath,
    double taper
);
```

### ExtrudeFaces(FullSubentityPath[], double, Vector3d, double)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::extrudeFaces(const AcDbFullSubentPathArray& subentPaths, double length, const AcGeVector3d& dir, double taper).
```text
public void ExtrudeFaces(
    FullSubentityPath\[\] paths,
    double length,
    Vector3d dir,
    double taper
);
```

### ExtrudeFaces(FullSubentityPath[], Point3dCollection, double)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::extrudeFaces(const AcDbFullSubentPathArray& subentPaths, const AcGePoint3dArray& alongPath).
```text
public void ExtrudeFaces(
    FullSubentityPath\[\] paths,
    Point3dCollection alongPath,
    double taper
);
```

### GetAdjacentSubentPath

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getAdjacentSubentPath.
```text
public FullSubentityPath\[\] GetAdjacentSubentPath(
    FullSubentityPath path,
    SubentityType type
);
```

### GetCrease(FullSubentityPath[])

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getCrease.
```text
public DoubleCollection GetCrease(
    FullSubentityPath\[\] subentPaths
);
```

### GetCrease(SubentityId)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getCrease.
```text
public double GetCrease(
    SubentityId id
);
```

### GetFacePlane

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getFacePlane.
```text
public Plane GetFacePlane(
    SubentityId subentId
);
```

### GetNumberOfSubDividedFacesAt

#### Description
This .NET method wraps the ObjectARX AcDbSubDMesh::numOfSubDividedFacesAt Method.
```text
public int GetNumberOfSubDividedFacesAt(
    FullSubentityPath\[\] paths
);
```

### GetObjectMesh

#### Description
Tessellates existing solid or surface object to mesh data using the given faceter settings. The mesh data includes the vertex array, face list array and face data.
```text
public static MeshDataCollection GetObjectMesh(
    DBObject dbObj,
    MeshFaceterData faceterData
);
```

#### Parameters
| Parameters | Description |
| --- | --- |
| DBObject dbObj | Input object to get the mesh. |
| MeshFaceterData faceterData | Input faceter setting information. |

#### Returns
MeshDataCollection containing vertex array, face list array and face data.
#### See Also
MeshDataCollection Structure, MeshFaceterData Structure

### GetSubDividedVertexAt(int)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubDividedVertexAt(Adesk::Int32, AcGePoint3d&).
```text
public Point3d GetSubDividedVertexAt(
    int index
);
```

### GetSubDividedVertexAt(SubentityId)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubDividedVertexAt (AcDbSubentId&, AcGePoint3d&).
```text
public Point3d GetSubDividedVertexAt(
    SubentityId subentId
);
```

### GetSubentColor

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubentColor.
```text
public Autodesk.AutoCAD.Colors.Color GetSubentColor(
    SubentityId subentId
);
```

### GetSubentMaterial

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubentMaterial.
```text
public ObjectId GetSubentMaterial(
    SubentityId subentId
);
```

### GetSubentMaterialMapper

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubentMaterialMapper.
```text
public Mapper GetSubentMaterialMapper(
    SubentityId subentId
);
```

### GetSubentPath

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getSubentPath.
```text
public FullSubentityPath\[\] GetSubentPath(
    int index,
    SubentityType type
);
```

### GetVertexAt(int)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getVertexAt.
```text
public Point3d GetVertexAt(
    int index
);
```

### GetVertexAt(SubentityId)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::getVertexAt.
```text
public Point3d GetVertexAt(
    SubentityId subentId
);
```

### MergeFaces

#### Description
This wraps the ObjectARX AcDbSubDMesh::mergeFaces() method
```text
public void MergeFaces(
    FullSubentityPath\[\] faces
);
```

### Setbox

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setBox.
```text
public void Setbox(
    double xlen,
    double ylen,
    double zlen,
    int divx,
    int divy,
    int divz,
    int smoothLevel
);
```

### SetCone

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setCone.
```text
public void SetCone(
    double majorRadius,
    double minorRadius,
    double height,
    int divAxis,
    int divHeight,
    int divCap,
    double radiusRatio,
    int smoothLevel
);
```

### SetCrease(double)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setCrease(double).
```text
public void SetCrease(
    double creaseVal
);
```

### SetCrease(FullSubentityPath[], double)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setCrease(AcDbFullSubentPathArray&, double).
```text
public void SetCrease(
    FullSubentityPath\[\] subentPaths,
    double creaseVal
);
```

### SetCylinder

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setCylinder.
```text
public void SetCylinder(
    double majorRadius,
    double minorRadius,
    double height,
    int divAxis,
    int divHeight,
    int divCap,
    int smoothLevel
);
```

### SetDragStatus

#### Description
This function is called when a drag operation involving this entity is starting, ending, or aborting. The status argument provides information about what is happening with the drag operation.
```text
public override void SetDragStatus(
    DragStatus status
);
```

#### Parameters
| Parameters | Description |
| --- | --- |
| DragStatus status | Value describing the status of the drag operation; one of the values from the DragStat enumeration |

### SetPyramid

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setPyramid.
```text
public void SetPyramid(
    double radius,
    double height,
    int divLength,
    int divHeight,
    int divCap,
    int nSides,
    double radiusRatio,
    int smoothLevel
);
```

### SetSphere

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setSphere.
```text
public void SetSphere(
    double radius,
    int divAxis,
    int divHeight,
    int smoothLevel
);
```

### SetSubDMesh

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setSubDMesh.
```text
public void SetSubDMesh(
    Point3dCollection vertexArray,
    Int32Collection indexArray,
    int smoothLevel
);
```

### SetSubentColor

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setSubentColor.
```text
public void SetSubentColor(
    SubentityId subentId,
    Autodesk.AutoCAD.Colors.Color color
);
```

### SetSubentMaterial

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setSubentMaterial.
```text
public void SetSubentMaterial(
    SubentityId subentId,
    ObjectId matId
);
```

### SetSubentMaterialMapper

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setSubentMaterialMapper.
```text
public void SetSubentMaterialMapper(
    SubentityId subentId,
    Mapper mapper
);
```

### SetTorus

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setTorus.
```text
public void SetTorus(
    double majorRadius,
    int divSection,
    int divSweepPath,
    double sectionRadiusRatio,
    double sectionRotate,
    int smoothLevel
);
```

### SetVertexAt(int, Point3d)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setVertexAt.
```text
public void SetVertexAt(
    int index,
    Point3d position
);
```

### SetVertexAt(SubentityId, Point3d)

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setVertexAt.
```text
public void SetVertexAt(
    SubentityId subentId,
    Point3d position
);
```

### SetWedge

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::setWedge.
```text
public void SetWedge(
    double xLen,
    double yLen,
    double zLen,
    int divLength,
    int divWidth,
    int divHeight,
    int divSlope,
    int divCap,
    int smoothLevel
);
```

### Spin

#### Description
This wraps the ObjectARX AcDbSubDMesh::spin() method
```text
public void Spin(
    SubentityId subentFaceId
);
```

### SplitFace

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::splitFace.
```text
public void SplitFace(
    SubentityId subentFaceId,
    SubentityId subent0,
    Point3d point0,
    SubentityId subent1,
    Point3d point1
);
```

### SubdDivideDown

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::subdDivideDown.
```text
public void SubdDivideDown();
```

### SubdDivideUp

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::subdDivideUp.
```text
public void SubdDivideUp();
```

### SubdRefine()

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::subdRefine.
```text
public void SubdRefine();
```

### SubdRefine(FullSubentityPath[])

#### Description
This .NET method wraps the ObjectARX method AcDbSubDMesh::subdRefine.
```text
public void SubdRefine(
    FullSubentityPath\[\] paths
);
```

### FaceArray

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::getFaceArray.
```text
public Int32Collection FaceArray;
```

### NormalArray

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::getNormalArray.
```text
public Vector3dCollection NormalArray;
```

### NumberOfFaces

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::numOfFaces.
```text
public int NumberOfFaces;
```

### NumberOfSubDividedFaces

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::numOfSubDividedFaces.
```text
public int NumberOfSubDividedFaces;
```

### NumberOfSubDividedVertices

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::numOfSubDividedVertices.
```text
public int NumberOfSubDividedVertices;
```

### NumberOfVertices

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::numOfVertices.
```text
public int NumberOfVertices;
```

### SmoothLevel

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::subdLevel.
```text
public int SmoothLevel;
```

### SubDividedFaceArray

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::getSubDividedFaceArray.
```text
public Int32Collection SubDividedFaceArray;
```

### SubDividedNormalArray

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::getSubDividedNormalArray.
```text
public Vector3dCollection SubDividedNormalArray;
```

### SubDividedVertices

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::getSubDividedVertices.
```text
public Point3dCollection SubDividedVertices;
```

### VertexColorArray

#### Description
This wraps the ObjectARX AcDbSubDMesh::getVertexColorArray() and AcDbSubDMesh::setVertexColorArray() methods.
```text
public EntityColor VertexColorArray;
```

### VertexNormalArray

#### Description
This wraps the ObjectARX AcDbSubDMesh::getVertexNormalArray and AcDbSubDMesh::setVertexNormalArray() methods.
```text
public Vector3dCollection VertexNormalArray;
```

### VertexTextureArray

#### Description
This wraps the ObjectARX AcDbSubDMesh::getVertexTextureArray() and AcDbSubDMesh::setVertexTextureArray() methods.
```text
public Point3dCollection VertexTextureArray;
```

### Vertices

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::getVertices.
```text
public Point3dCollection Vertices;
```

### Watertight

#### Description
This .NET property wraps the ObjectARX method AcDbSubDMesh::isWatertight.
```text
public bool Watertight;
```