# EqualDistanceConstraint Class

## Overview

#### Description
This class represents a EqualDistance constraint node in the owning Assoc2dConstraintGroup.
It can be applied between two pairs of points.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.EqualDistanceConstraint
```

```text
public class EqualDistanceConstraint : GeometricalConstraint;
```

## Members

### Constructors

- EqualDistanceConstraint

## Constructors Details

### EqualDistanceConstraint

#### Description
Default constructor.
```text
public EqualDistanceConstraint();
```