# PromptAngleOptionsEventArgs Class

## Overview

#### Description
This class provides data for the PromptingForAngle event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptAngleOptionsEventArgs
```

```text
public sealed class PromptAngleOptionsEventArgs : EventArgs;
```

### Properties

- Options

## Properties Details

### Options

#### Description
Gets the input parameters of the prompt.
```text
public PromptAngleOptions Options;
```

#### Conditions
Read-only