# DwfReference Class

## Overview

#### Description
This .NET class wraps the AcDbDwfReference ObjectARX class.
Represents DWF underlays in the drawing. Underlays are similar to raster images but their content is snappable.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.Entity
        Autodesk.AutoCAD.DatabaseServices.UnderlayReference
            Autodesk.AutoCAD.DatabaseServices.DwfReference
```

```text
public class DwfReference : UnderlayReference;
```

## Members

### Constructors

- DwfReference

## Constructors Details

### DwfReference

#### Description
Default constructor.
```text
public DwfReference();
```