# PathRef Class

## Overview

#### Description
This wraps the ObjectARX AcDbPathRef class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.GeomRef
    Autodesk.AutoCAD.DatabaseServices.PathRef
```

```text
public class PathRef : GeomRef;
```

### Constructors

- PathRef()
- [PathRef(EdgeRef[])](#pathref(edgeref[]))
- [PathRef(FullSubentityPath[], FullSubentityPath[])](#pathref(fullsubentitypath[],-fullsubentitypath[]))

### Methods

- GetEntityArray
- IsEqualTo
- IsReferencePath

### Properties

- EdgeRefs

## Constructors Details

### PathRef()

#### Description
This wraps the ObjectARX AcDbPathRef::AcDbPathRef() method
```text
public PathRef();
```

### PathRef(EdgeRef[])

#### Description
This wraps the ObjectARX AcDbPathRef::AcDbPathRef() method
```text
public PathRef(
    EdgeRef\[\] edges
);
```

### PathRef(FullSubentityPath[], FullSubentityPath[])

#### Description
This wraps the ObjectARX AcDbPathRef::AcDbPathRef () method.
```text
public PathRef(
    FullSubentityPath\[\] edgeSubentPathArr,
    FullSubentityPath\[\] faceSubentPathArr
);
```

### GetEntityArray

#### Description
This wraps the ObjectARX AcDbPathRef::getEntityArray() method
```text
public Entity\[\] GetEntityArray(
    [MarshalAs(UnmanagedType.U1)] bool bConcatenate
);
```

### IsEqualTo

#### Description
This wraps the ObjectARX AcDbPathRef::isEqualTo() method
```text
public bool IsEqualTo(
    Curve3d curve
);
```

### IsReferencePath

#### Description
This wraps the ObjectARX AcDbPathRef::isReferencePath() method
```text
public bool IsReferencePath();
```

### EdgeRefs

#### Description
This wraps the ObjectARX AcDbPathRef::edgeRefs() and AcDbPathRef::setEdgeRefs() methods.
```text
public EdgeRef EdgeRefs;
```