# PromptDoubleOptionsEventArgs Class

## Overview

#### Description
This class provides data for the PromptingForDouble event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptDoubleOptionsEventArgs
```

```text
public sealed class PromptDoubleOptionsEventArgs : EventArgs;
```

### Properties

- Options

## Properties Details

### Options

#### Description
Gets the input parameters of the prompt.
```text
public PromptDoubleOptions Options;
```

#### Conditions
Read-only