# AssocExtrudedSurfaceActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody
```

```text
public class AssocExtrudedSurfaceActionBody : AssocPathBasedSurfaceActionBody;
```

### Constructors

- AssocExtrudedSurfaceActionBody

### Methods

- CreateInstance
- GetHeight
- GetTaperAngle
- SetHeight
- SetTaperAngle

### Properties

- Height
- TaperAngle

## Constructors Details

### AssocExtrudedSurfaceActionBody

#### Description
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::AcDbAssocExtrudedSurfaceActionBody() method.
```text
public AssocExtrudedSurfaceActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARXAcDbAssocExtrudedSurfaceActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    ObjectId resultingSurfaceId,
    PathRef inputPath,
    Vector3d directionVec,
    SweepOptions sweepOptions,
    [MarshalAs(UnmanagedType.U1)] bool enable
);
```

### GetHeight

#### Description
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::height() method.
```text
public double GetHeight(
    out string expression,
    out string evaluatorId
);
```

### GetTaperAngle

#### Description
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::taperAngle() method.
```text
public double GetTaperAngle(
    out string expression,
    out string evaluatorId
);
```

### SetHeight

#### Description
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::setHeight() method.
```text
public void SetHeight(
    double height,
    string expression,
    string evaluatorId
);
```

### SetTaperAngle

#### Description
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::setTaperAngle() method.
```text
public void SetTaperAngle(
    double taperAngle,
    string expression,
    string evaluatorId
);
```

### Height

#### Description
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::height() and AcDbAssocExtrudedSurfaceActionBody::setHeight() methods.
```text
public double Height;
```

### TaperAngle

#### Description
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::taperAngle() and AcDbAssocExtrudedSurfaceActionBody::setTaperAngle() methods.
```text
public double TaperAngle;
```