# AssocArrayPolarParameters Class

## Overview

#### Description
AssocArrayPolarParameters wraps the ObjectARX AcDbAssocArrayPolarParameters class.
This class provides an interface for manipulating polar array parameters.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.AssocArrayParameters
    Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters
        Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters
```

```text
public class AssocArrayPolarParameters : AssocArrayCommonParameters;
```

### Constructors

- AssocArrayPolarParameters()
- AssocArrayPolarParameters(double, double, double, int, int, int, double)

### Methods

- GetAngleBetweenItems
- GetFillAngle
- GetItemCount
- GetRadius
- GetStartAngle
- SetAngleBetweenItems
- SetFillAngle
- SetItemCount
- SetRadius
- SetStartAngle

### Other

- AutoCAD.DatabaseServices.AssocArrayPolarParameters.ArcDirection Enumeration

### Properties

- AngleBetweenItems
- Direction
- FillAngle
- ItemCount
- Radius
- RotateItems
- StartAngle

## Constructors Details

### AssocArrayPolarParameters()

#### Description
Default constructor.
Wraps the default constructor AcDbAssocArrayPolarParameters constructor, with all default values.
```text
public AssocArrayPolarParameters();
protected internal AssocArrayPolarParameters(
    IntPtr unmanagedPointer,
    [MarshalAs(UnmanagedType.U1)] bool autoDelete
);
```

### AssocArrayPolarParameters(double, double, double, int, int, int, double)

#### Description
Parameterized constructor. The angle, which stands for angle between, is measured in degrees.
```text
public AssocArrayPolarParameters(
    double angle,
    double rowSpacing,
    double levelSpacing,
    int itemCount,
    int rowCount,
    int levelCount,
    double rowElevation
);
```

### GetAngleBetweenItems

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::angleBetweenItems() method.
The angle is measured in degrees.
```text
public double GetAngleBetweenItems(
    out string expression,
    out string evaluatorId
);
```

### GetFillAngle

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::fillAngle() method.
The angle is measured in degrees.
```text
public double GetFillAngle(
    out string expression,
    out string evaluatorId
);
```

### GetItemCount

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::itemCount() method.
```text
public int GetItemCount(
    out string expression,
    out string evaluatorId
);
```

### GetRadius

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::radius() method.
```text
public double GetRadius(
    out string expression,
    out string evaluatorId
);
```

### GetStartAngle

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::startAngle() method.
The angle is measured in degrees.
```text
public double GetStartAngle(
    out string expression,
    out string evaluatorId
);
```

### SetAngleBetweenItems

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::setAngleBetweenItems() method.
The angle is measured in degrees.
```text
public void SetAngleBetweenItems(
    double val,
    string expression,
    string evaluatorId
);
```

### SetFillAngle

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::setFillAngle() method.
The angle is measured in degrees.
```text
public void SetFillAngle(
    double val,
    string expression,
    string evaluatorId
);
```

### SetItemCount

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::setItemCount() method.
```text
public void SetItemCount(
    int count,
    string expression,
    string evaluatorId
);
```

### SetRadius

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::setRadius() method.
```text
public void SetRadius(
    double val,
    string expression,
    string evaluatorId
);
```

### SetStartAngle

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::setStartAngle() method.
The angle is measured in degrees.
```text
public void SetStartAngle(
    double val,
    string expression,
    string evaluatorId
);
```

### AutoCAD.DatabaseServices.AssocArrayPolarParameters.ArcDirection Enumeration

#### Description
Specifies the direction of the arc which the array items depend on.
```text
public enum ArcDirection {
  Clockwise,
  CounterClockwise
}
```

#### Members
| Members | Description |
| --- | --- |
| Clockwise | Clockwise direction of the arc. |
| CounterClockwise | Counterclockwise direction of the arc. |

## Properties Details

### AngleBetweenItems

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::angleBetweenItems() and AcDbAssocArrayPolarParameters::setAngleBetweenItems() methods.
The angle is measured in degrees.
```text
public double AngleBetweenItems;
```

#### Conditions
Read / write
### Direction

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::direction() and AcDbAssocArrayPolarParameters::setDirection() methods.
```text
public ArcDirection Direction;
```

#### Conditions
Read / write
### FillAngle

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::fillAngle() and AcDbAssocArrayPolarParameters::setFillAngle() methods.
The angle is measured in degrees.
```text
public double FillAngle;
```

#### Conditions
Read / write
### ItemCount

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::itemCount() and AcDbAssocArrayPolarParameters::setItemCount() methods.
```text
public int ItemCount;
```

#### Conditions
Read / write
### Radius

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::radius() and AcDbAssocArrayPolarParameters::setRadius() methods.
```text
public double Radius;
```

#### Conditions
Read / write
### RotateItems

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::rotateItems() and AcDbAssocArrayPolarParameters::setRotateItems() methods.
```text
public bool RotateItems;
```

#### Conditions
Read / write
### StartAngle

#### Description
Wraps the ObjectARX AcDbAssocArrayPolarParameters::startAngle() and AcDbAssocArrayPolarParameters::setStartAngle() methods.
The angle is measured in degrees.
```text
public double StartAngle;
```

#### Conditions
Read / write