# PromptDistanceOptionsEventArgs Class

## Overview

#### Description
This class provides data for the PromptingForDistance event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptDistanceOptionsEventArgs
```

```text
public sealed class PromptDistanceOptionsEventArgs : EventArgs;
```

### Properties

- Options

## Properties Details

### Options

#### Description
Gets the input parameters of the prompt.
```text
public PromptDistanceOptions Options;
```

#### Conditions
Read-only