# Autodesk.AutoCAD.DatabaseServices.PlotStyleNameType Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::PlotStyleNameType ObjectARX enum.
```text
public enum PlotStyleNameType {
  PlotStyleNameByLayer,
  PlotStyleNameByBlock,
  PlotStyleNameIsDictionaryDefault,
  PlotStyleNameById
}
```

#### Members
| Members | Description |
| --- | --- |
| PlotStyleNameByLayer |
| PlotStyleNameByBlock |
| PlotStyleNameIsDictionaryDefault |
| PlotStyleNameById |