# Autodesk.AutoCAD.DatabaseServices.PathOption Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::PathOption ObjectARX class.
It represents path options.
```text
public enum PathOption {
  AbsolutePath = 3,
  NoPath = 1,
  PathAndFile = 4,
  RelativePath = 2
}
```

#### Members
| Members | Description |
| --- | --- |
| AbsolutePath = 3 | Store absolute path |
| NoPath = 1 | Don't store path |
| PathAndFile = 4 | Don't store path |
| RelativePath = 2 | Store relative path |