# AssocBlendSurfaceActionBody Class

## Overview

#### Description
This is class Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody
```

```text
public class AssocBlendSurfaceActionBody : AssocPathBasedSurfaceActionBody;
```

### Constructors

- AssocBlendSurfaceActionBody

### Methods

- CreateInstance
- GetContinuityGripPoints
- GetEndEdgeBulge
- GetEndEdgeContinuity
- GetProfiles
- GetStartEdgeBulge
- GetStartEdgeContinuity
- SetEndEdgeBulge
- SetEndEdgeContinuity
- SetStartEdgeBulge
- SetStartEdgeContinuity

### Properties

- BlendOption
- EndEdgeBulge
- EndEdgeContinuity
- StartEdgeBulge
- StartEdgeContinuity

## Constructors Details

### AssocBlendSurfaceActionBody

#### Description
This wraps the ObjectARXAcDbAssocBlendSurfaceActionBody::AcDbAssocBlendSurfaceActionBody() method.
```text
public AssocBlendSurfaceActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    ObjectId resultingSurfaceId,
    LoftProfile startProfile,
    LoftProfile endProfile,
    BlendOptions blendOptions,
    [MarshalAs(UnmanagedType.U1)] bool enable
);
```

### GetContinuityGripPoints

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::getContinuityGripPoints() method.
```text
public void GetContinuityGripPoints(
    out Point3d startEdgePt,
    out Point3d endEdgePt
);
```

### GetEndEdgeBulge

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::endEdgeBulge() method.
```text
public double GetEndEdgeBulge(
    out string expression,
    out string evaluatorId
);
```

### GetEndEdgeContinuity

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::endEdgeContinuity() method.
```text
public short GetEndEdgeContinuity(
    out string expression,
    out string evaluatorId
);
```

### GetProfiles

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::getProfiles() method.
```text
public void GetProfiles(
    out LoftProfile startProfile,
    out LoftProfile endProfile
);
```

### GetStartEdgeBulge

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::startEdgeBulge() method.
```text
public double GetStartEdgeBulge(
    out string expression,
    out string evaluatorId
);
```

### GetStartEdgeContinuity

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::startEdgeContinuity() method.
```text
public short GetStartEdgeContinuity(
    out string expression,
    out string evaluatorId
);
```

### SetEndEdgeBulge

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::setEndEdgeBulge () method.
```text
public void SetEndEdgeBulge(
    double value,
    string expression,
    string evaluatorId
);
```

### SetEndEdgeContinuity

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::setEndEdgeContinuity () method.
```text
public void SetEndEdgeContinuity(
    short value,
    string expression,
    string evaluatorId
);
```

### SetStartEdgeBulge

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::setStartEdgeBulge () method.
```text
public void SetStartEdgeBulge(
    double value,
    string expression,
    string evaluatorId
);
```

### SetStartEdgeContinuity

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::setStartEdgeContinuity () method.
```text
public void SetStartEdgeContinuity(
    short value,
    string expression,
    string evaluatorId
);
```

### BlendOption

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::getBlendOptions() and AcDbAssocBlendSurfaceActionBody::setBlendOptions() methods.
```text
public BlendOptions BlendOption;
```

### EndEdgeBulge

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::endEdgeBulge() and AcDbAssocBlendSurfaceActionBody::setEndEdgeBulge() methods.
```text
public double EndEdgeBulge;
```

### EndEdgeContinuity

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::endEdgeContinuity() and AcDbAssocBlendSurfaceActionBody::setEndEdgeContinuity () methods.
```text
public short EndEdgeContinuity;
```

### StartEdgeBulge

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::startEdgeBulge() and AcDbAssocBlendSurfaceActionBody::setStartEdgeBulge() methods.
```text
public double StartEdgeBulge;
```

### StartEdgeContinuity

#### Description
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::startEdgeContinuity() and AcDbAssocBlendSurfaceActionBody::setStartEdgeContinuity () methods.
```text
public short StartEdgeContinuity;
```