# Autodesk.AutoCAD.DatabaseServices.TextAngleType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbMLeaderStyle::TextAngleType ObjectARX class.
This enum describes the types of text angle type.
```text
public enum TextAngleType {
  InsertAngle,
  HorizontalAngle,
  AlwaysRightReadingAngle
}
```

#### Members
| Members | Description |
| --- | --- |
| InsertAngle | The direction of text is according to the last leaderline segment. |
| HorizontalAngle | The direction of text is always horizontal. |
| AlwaysRightReadingAngle | The direction of text is according to the last leaderline segment and text is always right-side up. |