# Notifier Class

## Overview

#### Description
This is class Autodesk.AutoCAD.DatabaseServices.Notifier.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.Notifier
    Autodesk.AutoCAD.DatabaseServices.PointCloudItem
```

```text
public class Notifier : INotifyPropertyChanged;
```

### Methods

- OnPropertyChanged

## Methods Details

### OnPropertyChanged

#### Description
This is OnPropertyChanged, a member of class Notifier.
```text
public void OnPropertyChanged(
    string propertyName
);
```