# ColinearConstraint Class

## Overview

#### Description
This class represents a Colinear (coincident) constraint node in the owning Assoc2dConstraintGroup. It can be applied between two constrained line.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.ColinearConstraint
```

```text
public class ColinearConstraint : GeometricalConstraint;
```

## Members

### Constructors

- ColinearConstraint

## Constructors Details

### ColinearConstraint

#### Description
Default constructor.
```text
public ColinearConstraint();
```