# Cell Class

## Overview

#### Description
This class represents table cells.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.CellRange
    Autodesk.AutoCAD.DatabaseServices.Cell
```

```text
public sealed class Cell : CellRange;
```

### Properties

- Column
- Row

## Properties Details

### Column

#### Description
Returns the number of columns.
```text
public int Column;
```

#### Conditions
Read-only
### Row

#### Description
Returns the number of rows
```text
public int Row;
```

#### Conditions
Read-only