# PromptSelectionResultEventArgs Class

## Overview

#### Description
This class provides data for the PromptedForSelection> event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptSelectionResultEventArgs
```

```text
public sealed class PromptSelectionResultEventArgs : EventArgs;
```

### Properties

- Result

## Properties Details

### Result

#### Description
Gets the result of the selection.
```text
public PromptSelectionResult Result;
```

#### Conditions
Read-only