# PromptEntityOptionsEventArgs Class

## Overview

#### Description
This class provides data for the PromptingForEntity> event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptEntityOptionsEventArgs
```

```text
public sealed class PromptEntityOptionsEventArgs : EventArgs;
```

### Properties

- Options

## Properties Details

### Options

#### Description
Gets the input parameters of the prompt.
```text
public PromptEntityOptions Options;
```

#### Conditions
Read-only