# SweepOptions Class

## Overview

#### Description
This .NET class wrap the ObjectARX AcDbSweepOptions class.
Use SweepOptionsBuilder class to set sweep options.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.SweepOptions
```

```text
public sealed class SweepOptions : DisposableWrapper, ICloneable;
```

### Properties

- Align
- AlignAngle
- AlignStart
- Bank
- BasePoint
- CheckIntersections
- DraftAngle
- EndDraftDist
- PathEntityTransform
- ScaleFactor
- StartDraftDist
- SweepEntityTransform
- TwistAngle

## Properties Details

### Align

#### Description
This wraps the ObjectARX AcDbSweepOptions::align method.
```text
public SweepOptionsAlignOption Align;
```

#### Conditions
Read-only
### AlignAngle

#### Description
This wraps the ObjectARX AcDbSweepOptions::alignAngle method.
```text
public double AlignAngle;
```

#### Conditions
Read-only
### AlignStart

#### Description
This wraps the ObjectARX AcDbSweepOptions::alignStart method.
```text
public bool AlignStart;
```

#### Conditions
Read-only
### Bank

#### Description
This wraps the ObjectARX AcDbSweepOptions::bank method.
```text
public bool Bank;
```

#### Conditions
Read-only
### BasePoint

#### Description
The wraps the ObjectARX AcDbSweepOptions::basePoint method.
```text
public Point3d BasePoint;
```

#### Conditions
Read-only
### CheckIntersections

#### Description
This wraps the ObjectARX AcDbSweepOptions::checkIntersections method.
```text
public bool CheckIntersections;
```

#### Conditions
Read-only
### DraftAngle

#### Description
This wraps the ObjectARX AcDbSweepOptions::draftAngle method.
```text
public double DraftAngle;
```

#### Conditions
Read-only
### EndDraftDist

#### Description
This wraps the ObjectARX AcDbSweepOptions::endDraftDist method.
```text
public double EndDraftDist;
```

#### Conditions
Read-only
### PathEntityTransform

#### Description
This wraps the ObjectARX AcDbSweepOptions::getPathEntityTransform method.
```text
public Matrix3d PathEntityTransform;
```

#### Conditions
Read-only
### ScaleFactor

#### Description
This wraps the ObjectARX AcDbSweepOptions::scaleFactor method.
```text
public double ScaleFactor;
```

#### Conditions
Read-only
### StartDraftDist

#### Description
This wraps the ObjectARX AcDbSweepOptions::startDraftDist method.
```text
public double StartDraftDist;
```

#### Conditions
Read-only
### SweepEntityTransform

#### Description
This wraps the ObjectARX AcDbSweepOptions::getSweepEntityTransform method.
```text
public Matrix3d SweepEntityTransform;
```

#### Conditions
Read-only
### TwistAngle

#### Description
This wraps the ObjectARX AcDbSweepOptions::twistAngle method.
```text
public double TwistAngle;
```

#### Conditions
Read-only