# PromptNestedEntityOptionsEventArgs Class

## Overview

#### Description
This class provides data for the PromptingForNestedEntity> event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptionsEventArgs
```

```text
public sealed class PromptNestedEntityOptionsEventArgs : EventArgs;
```

### Properties

- Options

## Properties Details

### Options

#### Description
Gets the input parameters of the prompt.
```text
public PromptNestedEntityOptions Options;
```

#### Conditions
Read-only