# AssocExtendSurfaceActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocExtendSurfaceActionBody
```

```text
public class AssocExtendSurfaceActionBody : AssocPathBasedSurfaceActionBody;
```

### Constructors

- AssocExtendSurfaceActionBody

### Methods

- CreateInstance
- GetDistance
- SetDistance

### Properties

- Distance

## Constructors Details

### AssocExtendSurfaceActionBody

#### Description
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody::AcDbAssocExtendSurfaceActionBody() method.
```text
public AssocExtendSurfaceActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    ObjectId resultingSurfaceId,
    EdgeRef\[\] extendEdges,
    double distance,
    Surface.EdgeExtensionType extendOption,
    [MarshalAs(UnmanagedType.U1)] bool enabled
);
```

### GetDistance

#### Description
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody::distance() method.
```text
public double GetDistance(
    out string expression,
    out string evaluatorId
);
```

### SetDistance

#### Description
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody::setDistance() method.
```text
public void SetDistance(
    double distance,
    string expression,
    string evaluatorId
);
```

### Distance

#### Description
This wraps the ObjectARX AcDbAssocExtendSurfaceActionBody::distance() and AcDbAssocExtendSurfaceActionBody::setDistance() methods.
```text
public double Distance;
```