# PromptPointOptionsEventArgs Class

## Overview

#### Description
This class provides data for the PromptingForPoint event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptPointOptionsEventArgs
```

```text
public sealed class PromptPointOptionsEventArgs : EventArgs;
```

### Properties

- Options

## Properties Details

### Options

#### Description
Gets the input parameters of the prompt.
```text
public PromptPointOptions Options;
```

#### Conditions
Read-only