# NurbSurface Class

## Overview

#### Description
This wraps the ObjectARX AcDbNurbSurface class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.NurbSurface
```

```text
public class NurbSurface : Autodesk.AutoCAD.DatabaseServices.Surface;
```

### Constructors

- NurbSurface()
- [NurbSurface(int, int, [MarshalAs(UnmanagedType.U1)] bool, int, int, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection)](#nurbsurface(int,-int,-[marshalas(unmanagedtype.u1)]-bool,-int,-int,-point3dcollection,-doublecollection,-knotcollection,-knotcollection))

### Methods

- Evaluate(double, double)
- Evaluate(double, double, int, Point3d, Vector3dCollection)
- Evaluate(double, double, Point3d, Vector3d, Vector3d)
- Evaluate(double, double, Point3d, Vector3d, Vector3d, Vector3d, Vector3d, Vector3d)
- GetControlPointAt
- GetIsolineAtU
- GetIsolineAtV
- GetNormal
- GetParameterOfPoint
- GetWeight
- InsertControlPointsAtU
- InsertControlPointsAtV
- InsertKnotAtU
- InsertKnotAtV
- IsPlanar
- IsPointOnSurface
- ModifyPosition
- ModifyPositionAndTangent
- Rebuild(int, int, int, int)
- [Rebuild(int, int, int, int, [MarshalAs(UnmanagedType.U1)] bool)](#rebuild(int,-int,-int,-int,-[marshalas(unmanagedtype.u1)]-bool))
- RemoveControlPointsAtU
- RemoveControlPointsAtV
- Set
- SetControlPointAt
- SetControlPoints
- SetWeight

### Properties

- ControlPoints
- DegreeInU
- DegreeInV
- IsClosedInU
- IsClosedInV
- IsPeriodicInU
- IsPeriodicInV
- IsRational
- NumberOfControlPointsInU
- NumberOfControlPointsInV
- NumberOfKnotsInU
- NumberOfKnotsInV
- NumberOfSpansInU
- NumberOfSpansInV
- PeriodInU
- PeriodInV
- UKnots
- VKnots

## Constructors Details

### NurbSurface()

#### Description
This wraps the ObjectARX AcDbNurbSurface::AcDbNurbSurface() method
```text
public NurbSurface();
```

### NurbSurface(int, int, [MarshalAs(UnmanagedType.U1)] bool, int, int, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection)

#### Description
This wraps the ObjectARX AcDbNurbSurface::AcDbNurbSurface() method
```text
public NurbSurface(
    int uDegree,
    int vDegree,
    [MarshalAs(UnmanagedType.U1)] bool rational,
    int uNumControlPoints,
    int vNumControlPoints,
    Point3dCollection ctrlPts,
    DoubleCollection weights,
    KnotCollection uKnots,
    KnotCollection vKnots
);
```

### Evaluate(double, double)

#### Description
This wraps the ObjectARX evaluate(double u, double v, AcGePoint3d&amp; pos) method
```text
public Point3d Evaluate(
    double u,
    double v
);
```

### Evaluate(double, double, int, Point3d, Vector3dCollection)

#### Description
This wraps the ObjectARX evaluate(double u, double v, int derivDegree, AcGePoint3d&amp; point, AcGeVector3dArray&amp; derivatives) method
```text
public void Evaluate(
    double u,
    double v,
    int derivDegree,
    ref Point3d point,
    ref Vector3dCollection derivatives
);
```

### Evaluate(double, double, Point3d, Vector3d, Vector3d)

#### Description
This wraps the ObjectARX evaluate(double u, double v, AcGePoint3d&amp; pos, AcGeVector3d&amp; uDeriv, AcGeVector3d&amp; vDeriv) method
```text
public void Evaluate(
    double u,
    double v,
    ref Point3d pos,
    ref Vector3d uDeriv,
    ref Vector3d vDeriv
);
```

### Evaluate(double, double, Point3d, Vector3d, Vector3d, Vector3d, Vector3d, Vector3d)

#### Description
This wraps the ObjectARX evaluate(double u, double v, AcGePoint3d&amp; pos, AcGeVector3d&amp; uDeriv, AcGeVector3d&amp; vDeriv, AcGeVector3d&amp; uuDeriv, AcGeVector3d&amp; uvDeriv, AcGeVector3d&amp; vvDeriv) method
```text
public void Evaluate(
    double u,
    double v,
    ref Point3d pos,
    ref Vector3d uDeriv,
    ref Vector3d vDeriv,
    ref Vector3d uuDeriv,
    ref Vector3d uvDeriv,
    ref Vector3d vvDeriv
);
```

### GetControlPointAt

#### Description
This wraps the ObjectARX AcDbNurbSurface::getControlPointAt() method
```text
public Point3d GetControlPointAt(
    int uIndex,
    int vIndex
);
```

### GetIsolineAtU

#### Description
This wraps the ObjectARX AcDbNurbSurface::getIsolineAtU() method
```text
public Curve\[\] GetIsolineAtU(
    double u
);
```

### GetIsolineAtV

#### Description
This wraps the ObjectARX AcDbNurbSurface::getIsolineAtV() method
```text
public Curve\[\] GetIsolineAtV(
    double v
);
```

### GetNormal

#### Description
This wraps the ObjectARX AcDbNurbSurface::getNormal() method
```text
public Vector3d GetNormal(
    double u,
    double v
);
```

### GetParameterOfPoint

#### Description
This wraps the ObjectARX AcDbNurbSurface::getParameterOfPoint() method
```text
public void GetParameterOfPoint(
    Point3d point,
    out double u,
    out double v
);
```

### GetWeight

#### Description
This wraps the ObjectARX AcDbNurbSurface::getWeight() method
```text
public double GetWeight(
    int uIndex,
    int vIndex
);
```

### InsertControlPointsAtU

#### Description
This wraps the ObjectARX AcDbNurbSurface::InsertControlPointsAtU() method
```text
public void InsertControlPointsAtU(
    double u,
    Point3dCollection vCtrlPts,
    DoubleCollection vWeights
);
```

### InsertControlPointsAtV

#### Description
This wraps the ObjectARX AcDbNurbSurface::InsertControlPointsAtV() method
```text
public void InsertControlPointsAtV(
    double v,
    Point3dCollection uCtrlPts,
    DoubleCollection uWeights
);
```

### InsertKnotAtU

#### Description
This wraps the ObjectARX AcDbNurbSurface::InsertKnotAtU() method
```text
public void InsertKnotAtU(
    double u
);
```

### InsertKnotAtV

#### Description
This wraps the ObjectARX AcDbNurbSurface::InsertKnotAtV() method
```text
public void InsertKnotAtV(
    double v
);
```

### IsPlanar

#### Description
This wraps the ObjectARX AcDbNurbSurface::isPlanar() method
```text
public bool IsPlanar(
    out Point3d ptOnSurface,
    out Vector3d normal
);
```

### IsPointOnSurface

#### Description
This wraps the ObjectARX AcDbNurbSurface::isPointOnSurface() method
```text
public bool IsPointOnSurface(
    Point3d point
);
```

### ModifyPosition

#### Description
This wraps the ObjectARX AcDbNurbSurface::modifyPositionAndTangent() method
```text
public void ModifyPosition(
    double u,
    double v,
    Point3d point
);
```

### ModifyPositionAndTangent

#### Description
This wraps the ObjectARX AcDbNurbSurface::modifyPositionAndTangent() method
```text
public void ModifyPositionAndTangent(
    double u,
    double v,
    Point3d point,
    Vector3d uDeriv,
    Vector3d vDeriv
);
```

### Rebuild(int, int, int, int)

#### Description
This wraps the ObjectARX AcDbNurbSurface::rebuild() method.
```text
public void Rebuild(
    int uDegree,
    int vDegree,
    int numUCtrlPts,
    int numVCtrlPts
);
```

### Rebuild(int, int, int, int, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbNurbSurface::rebuild() method.
```text
public void Rebuild(
    int uDegree,
    int vDegree,
    int numUCtrlPts,
    int numVCtrlPts,
    [MarshalAs(UnmanagedType.U1)] bool bRestore
);
```

### RemoveControlPointsAtU

#### Description
This wraps the ObjectARX AcDbNurbSurface::RemoveControlPointsAtU() method
```text
public void RemoveControlPointsAtU(
    int uIndex
);
```

### RemoveControlPointsAtV

#### Description
This wraps the ObjectARXAcDbNurbSurface::RemoveControlPointsAtV() method
```text
public void RemoveControlPointsAtV(
    int vIndex
);
```

### Set

#### Description
This wraps the ObjectARX AcDbNurbSurface::set () method
```text
public void Set(
    int uDegree,
    int vDegree,
    [MarshalAs(UnmanagedType.U1)] bool rational,
    int uNumControlPoints,
    int vNumControlPoints,
    Point3dCollection ctrlPts,
    DoubleCollection weights,
    KnotCollection uKnots,
    KnotCollection vKnots
);
```

### SetControlPointAt

#### Description
This wraps the ObjectARX AcDbNurbSurface::setControlPointAt() method
```text
public void SetControlPointAt(
    int uIndex,
    int vIndex,
    Point3d point
);
```

### SetControlPoints

#### Description
This wraps the ObjectARX AcDbNurbSurface::setControlPoints() method
```text
public void SetControlPoints(
    int uCount,
    int vCount,
    Point3dCollection points
);
```

### SetWeight

#### Description
This wraps the ObjectARX AcDbNurbSurface::setWeight() method
```text
public void SetWeight(
    int uIndex,
    int vIndex,
    double weight
);
```

### ControlPoints

#### Description
This wraps the ObjectARX AcDbNurbSurface::getControlPoints() method
```text
public Point3dCollection ControlPoints;
```

### DegreeInU

#### Description
This wraps the ObjectARX AcDbNurbSurface::getDegreeInU() method
```text
public int DegreeInU;
```

### DegreeInV

#### Description
This wraps the ObjectARX AcDbNurbSurface::getDegreeInV() method
```text
public int DegreeInV;
```

### IsClosedInU

#### Description
This wraps AcDbNurbSurface::isClosedInU() method
```text
public bool IsClosedInU;
```

### IsClosedInV

#### Description
This wraps the ObjectARX AcDbNurbSurface::isClosedInV() method
```text
public bool IsClosedInV;
```

### IsPeriodicInU

#### Description
This wraps the ObjectARX AcDbNurbSurface::isPeriodicInU() method
```text
public bool IsPeriodicInU;
```

### IsPeriodicInV

#### Description
This wraps the ObjectARXAcDbNurbSurface::isPeriodicInV() method
```text
public bool IsPeriodicInV;
```

### IsRational

#### Description
This wraps the ObjectARX AcDbNurbSurface::isRational() method
```text
public bool IsRational;
```

### NumberOfControlPointsInU

#### Description
This wraps the ObjectARX AcDbNurbSurface::getNumberOfControlPointsInU() method
```text
public int NumberOfControlPointsInU;
```

### NumberOfControlPointsInV

#### Description
This wraps the ObjectARX AcDbNurbSurface::getNumberOfControlPointsInV() method
```text
public int NumberOfControlPointsInV;
```

### NumberOfKnotsInU

#### Description
This wraps the ObjectARX AcDbNurbSurface::getNumberOfKnotsInU() method
```text
public int NumberOfKnotsInU;
```

### NumberOfKnotsInV

#### Description
This wraps the ObjectARX AcDbNurbSurface::getNumberOfKnotsInV() method
```text
public int NumberOfKnotsInV;
```

### NumberOfSpansInU

#### Description
This wraps the ObjectARX AcDbNurbSurface::getNormal() method
```text
public int NumberOfSpansInU;
```

### NumberOfSpansInV

#### Description
This wraps the ObjectARX AcDbNurbSurface::getIsolineAtU() method
```text
public int NumberOfSpansInV;
```

### PeriodInU

#### Description
This wraps the ObjectARX AcDbNurbSurface::getPeriodInU() method
```text
public double PeriodInU;
```

### PeriodInV

#### Description
This wraps the ObjectARX AcDbNurbSurface::getPeriodInV() method
```text
public double PeriodInV;
```

### UKnots

#### Description
This wraps the ObjectARX AcDbNurbSurface::getUKnots() method
```text
public KnotCollection UKnots;
```

### VKnots

#### Description
This wraps the ObjectARX AcDbNurbSurface::getVKnots() method
```text
public KnotCollection VKnots;
```