# LivePreviewCommand Class

## Overview

#### Description
This is class Autodesk.AutoCAD.EditorInput.LivePreviewCommand.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.LivePreviewActionBase
    Autodesk.AutoCAD.EditorInput.LivePreviewCommand
```

```text
public sealed class LivePreviewCommand : LivePreviewActionBase;
```

### Constructors

- LivePreviewCommand

### Methods

- Execute

## Constructors Details

### LivePreviewCommand

#### Description
This is LivePreviewCommand, a member of class LivePreviewCommand.
```text
public LivePreviewCommand(
    string cmd
);
```

### Execute

#### Description
This is Execute, a member of class LivePreviewCommand.
```text
public sealed override void Execute();
```