# VerticalConstraint Class

## Overview

#### Description
This class represents a Vertical constraint node in the owning Assoc2dConstraintGroup.
It can be applied on one constrained line.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.ParallelConstraint
            Autodesk.AutoCAD.DatabaseServices.VerticalConstraint
```

```text
public class VerticalConstraint : ParallelConstraint;
```

## Members

### Constructors

- VerticalConstraint

## Constructors Details

### VerticalConstraint

#### Description
Default constructor.
```text
public VerticalConstraint();
```