# WblockNoticeEventArgs Class

## Overview

#### Description
This class provides data for the WblockNotice event of the database.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.WblockNoticeEventArgs
```

```text
public sealed class WblockNoticeEventArgs : EventArgs;
```

### Properties

- To

## Properties Details

### To

#### Description
Gets the database being written to.
```text
public Database To;
```

#### Conditions
Read / Write