# ObjectEventArgs Class

## Overview

#### Description
This class provides data for various object-related events of the database.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ObjectEventArgs
```

```text
public sealed class ObjectEventArgs : EventArgs;
```

### Properties

- DBObject

## Properties Details

### DBObject

#### Description
Accesses the object that is changed.
```text
public Autodesk.AutoCAD.DatabaseServices.DBObject DBObject;
```

#### Conditions
Read-only