# LivePreviewActionBase Class

## Overview

#### Description
This is class Autodesk.AutoCAD.EditorInput.LivePreviewActionBase.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.LivePreviewActionBase
    Autodesk.AutoCAD.EditorInput.LivePreviewAction
    Autodesk.AutoCAD.EditorInput.LivePreviewCommand
    Autodesk.AutoCAD.EditorInput.LivePreviewDelegate
    Autodesk.AutoCAD.EditorInput.LivePreviewPropertySetting
```

```text
public abstract class LivePreviewActionBase;
```

### Constructors

- LivePreviewActionBase

### Methods

- Execute
- OnAborted

## Constructors Details

### LivePreviewActionBase

#### Description
This is LivePreviewActionBase, a member of class LivePreviewActionBase.
```text
protected LivePreviewActionBase();
```

### Execute

#### Description
This is Execute, a member of class LivePreviewActionBase.
```text
public virtual void Execute();
```

### OnAborted

#### Description
This is OnAborted, a member of class LivePreviewActionBase.
```text
public virtual void OnAborted();
```