# TextEditorCursor Class

## Overview

#### Description
This wraps the ObjectARX AcDbTextEditorCursor class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase
    Autodesk.AutoCAD.DatabaseServices.TextEditorCursor
```

```text
public class TextEditorCursor : TextEditorSelectionbase;
```

### Properties

- Column
- Location
- Paragraph

## Properties Details

### Column

#### Description
This wraps the ObjectARX AcDbTextEditorCursor::column() method.
```text
public TextEditorColumn Column;
```

### Location

#### Description
Gets and sets the current cursor location.
This wraps the ObjectARX AcDbTextEditorCursor::location() and AcDbTextEditorCursor::setLocation() methods.
```text
public TextEditorLocation Location;
```

### Paragraph

#### Description
This wraps the ObjectARX AcDbTextEditorCursor::paragraph() method.
```text
public TextEditorParagraph Paragraph;
```