# Autodesk.AutoCAD.DatabaseServices.CellAlignment Enumeration

## Overview

#### Description
This .NET class wraps the CellAlignment ObjectARX enum.
These values specify how text will be aligned in a table cell and are available for horizontally oriented text only.
```text
public enum CellAlignment {
  BottomCenter = 8,
  BottomLeft = 7,
  BottomRight = 9,
  MiddleCenter = 5,
  MiddleLeft = 4,
  MiddleRight = 6,
  TopCenter = 2,
  TopLeft = 1,
  TopRight = 3
}
```

#### Members
| Members | Description |
| --- | --- |
| BottomCenter = 8 | Centers text at a point specified for the bottom of the text within a text table cell. |
| BottomLeft = 7 | Left-justifies text at a point specified for the bottom of the text within a text table cell. |
| BottomRight = 9 | Right-justifies text at a point specified for the bottom of the text within a text table cell. |
| MiddleCenter = 5 | Centers text at a point specified for the middle of the text within a text table cell. |
| MiddleLeft = 4 | Left-justifies text at a point specified for the middle of the text within a text table cell. |
| MiddleRight = 6 | Right-justifies text at a point specified for the middle of the text within a text table cell. |
| TopCenter = 2 | Centers text at a point specified for the top of the text within a text table cell. |
| TopLeft = 1 | Left-justifies text at a point specified for the top of the text within a text table cell. |
| TopRight = 3 | Right-justifies text at a point specified for the top of the text within a text table cell. |