# Autodesk.AutoCAD.DatabaseServices.PaperOrientationStates Enumeration

## Overview

#### Description
An enum which retrieves the current value of the paper orientation property on an annotative object.
```text
public enum PaperOrientationStates {
  True,
  False,
  NotApplicable
}
```

#### Members
| Members | Description |
| --- | --- |
| True | The object is currently associated with the paper. |
| False | The object is not currently associated with the paper. |
| NotApplicable | There is no paper orientation. |