# Autodesk.AutoCAD.DatabaseServices.LampColorPreset Enumeration

## Overview

#### Description
This .NET class wraps the AcDbLight::LampColorPreset ObjectARX enum.
```text
public enum LampColorPreset {
  D65White,
  Fluorescent,
  CoolWhite,
  WhiteFluorescent,
  DaylightFluorescent,
  Incandescent,
  Xenon,
  Halogen,
  Quartz,
  MetalHalide,
  Mercury,
  PhosphorMercury,
  HighPressureSodium,
  LowPressureSodium,
  Custom
}
```

#### Members
| Members | Description |
| --- | --- |
| D65White | D65White lamp color. |
| Fluorescent | Fluorescent lamp color. |
| CoolWhite | CoolWhite lamp color |
| WhiteFluorescent | White Fluorescent lamp color |
| DaylightFluorescent | Daylight Fluorescent lamp color. |
| Incandescent | Incandescent lamp color. |
| Xenon | Xenon lamp color |
| Halogen | Halogen lamp color |
| Quartz | Quartz lamp color |
| MetalHalide | Metal Halide lamp color. |
| Mercury | Mercury lamp color. |
| PhosphorMercury | Phosphor Mercury lamp color. |
| HighPressureSodium | High Pressure Sodium lamp color. |
| LowPressureSodium | Low Pressure Sodium lamp color. |
| Custom | Custom lamp color. |