# MidPointConstraint Class

## Overview

#### Description
This class represents a MidPoint constraint node in the owning Assoc2dConstraintGroup.
It can be applied between a point and a bounded line (not ray) or arc.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.MidPointConstraint
```

```text
public class MidPointConstraint : GeometricalConstraint;
```

## Members

### Constructors

- MidPointConstraint

## Constructors Details

### MidPointConstraint

#### Description
Default constructor.
```text
public MidPointConstraint();
```