# LivePreviewContextProxy Class

## Overview

#### Description
This is class Autodesk.AutoCAD.EditorInput.LivePreviewContextProxy.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.LivePreviewContextProxy
```

```text
public class LivePreviewContextProxy : IDisposable;
```

### Constructors

- LivePreviewContextProxy

### Methods

- Dispose()
- [Dispose([MarshalAs(UnmanagedType.U1)] bool)](#dispose([marshalas(unmanagedtype.u1)]-bool))
- Finalize

## Constructors Details

### LivePreviewContextProxy

#### Description
This is LivePreviewContextProxy, a member of class LivePreviewContextProxy.
```text
public LivePreviewContextProxy(
    string contexName,
    Delegate callback,
    params object\[\] parameters
);
```

### Dispose()

#### Description
This is Dispose, a member of class LivePreviewContextProxy.
```text
public sealed override void Dispose();
```

### Dispose([MarshalAs(UnmanagedType.U1)] bool)

#### Description
This is Dispose, a member of class LivePreviewContextProxy.
```text
protected virtual void Dispose(
    [MarshalAs(UnmanagedType.U1)] bool A_0
);
```

### Finalize

#### Description
This is Finalize, a member of class LivePreviewContextProxy.
```text
protected override void Finalize();
```