# Autodesk.AutoCAD.DatabaseServices.ObjectSnapModes Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::OsnapMode ObjectARX enum.
It describes the way objects can snap.
```text
public enum ObjectSnapModes {
  ModeCenter = 3,
  ModeEnd = 1,
  ModeIns = 7,
  ModeMid = 2,
  ModeNear = 10,
  ModeNode = 4,
  ModePerpendicular = 8,
  ModeQuad = 5,
  ModeTangent = 9
}
```

#### Members
| Members | Description |
| --- | --- |
| ModeCenter = 3 | Center |
| ModeEnd = 1 | Endpoint |
| ModeIns = 7 | Insertion |
| ModeMid = 2 | Midpoint |
| ModeNear = 10 | Nearest |
| ModeNode = 4 | Node |
| ModePerpendicular = 8 | Perpendicular |
| ModeQuad = 5 | Quadrant |
| ModeTangent = 9 | Tangent |