# Autodesk.AutoCAD.DatabaseServices.SectionViewArrowDirection Enumeration

## Overview

#### Description
The type defining section view symbol arrowhead direction.
```text
public enum SectionViewArrowDirection {
  TowardsCuttingPlane,
  AwayFromCuttingPlane
}
```

#### Members
| Members | Description |
| --- | --- |
| TowardsCuttingPlane | This flag is set when the section view symbol arrowheads are oriented towards the cutting plane.enum |
| AwayFromCuttingPlane | This flag is set when the section view symbol arrowheads are oriented away from the cutting plane.enum |