# RolloverEventArgs Class

## Overview

#### Description
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.RolloverEventArgs
```

```text
public sealed class RolloverEventArgs : EventArgs;
```

### Properties

- Highlighted
- Picked

## Properties Details

### Highlighted

#### Description
Assesses the highlighted paths.
```text
public FullSubentityPath Highlighted;
```

#### Conditions
Read / Write
### Picked

#### Description
Assesses the picked paths.
```text
public FullSubentityPath Picked;
```

#### Conditions
Read / Write