# AssocEdgeFilletActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocEdgeFilletActionBody
```

```text
public class AssocEdgeFilletActionBody : AssocSurfaceActionBody;
```

### Constructors

- AssocEdgeFilletActionBody

### Methods

- CreateInstance
- GetRadius
- SetRadius

### Properties

- Radius

## Constructors Details

### AssocEdgeFilletActionBody

#### Description
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody::AcDbAssocEdgeFilletActionBody() method.
```text
public AssocEdgeFilletActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    FullSubentityPath\[\] filletEdges,
    double radius,
    [MarshalAs(UnmanagedType.U1)] bool enable
);
```

### GetRadius

#### Description
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody::radius() method.
```text
public double GetRadius(
    out string expression,
    out string evaluatorId
);
```

### SetRadius

#### Description
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody::setRadius() method.
```text
public void SetRadius(
    double radius,
    string expression,
    string evaluatorId
);
```

### Radius

#### Description
This wraps the ObjectARX AcDbAssocEdgeFilletActionBody::radius() and AcDbAssocEdgeFilletActionBody::setRadius() methods.
```text
public double Radius;
```