# Autodesk.AutoCAD.DatabaseServices.UnderlayLayerState Enumeration

## Overview

#### Description
State of underlay layer, whether it's enabled or disabled.
```text
public enum UnderlayLayerState {
  Off,
  On
}
```

#### Members
| Members | Description |
| --- | --- |
| Off | Underlay layer turned off. |
| On | Underlay layer turned on. |