# ObjectClosedEventArgs Class

## Overview

#### Description
This is class Autodesk.AutoCAD.DatabaseServices.ObjectClosedEventArgs.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ObjectClosedEventArgs
```

```text
public sealed class ObjectClosedEventArgs : EventArgs;
```

### Properties

- Id

## Properties Details

### Id

#### Description
This is Id, a member of class ObjectClosedEventArgs.
```text
public ObjectId Id;
```