# TextEditorSelectionbase Class

## Overview

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase
    Autodesk.AutoCAD.DatabaseServices.TextEditorCursor
    Autodesk.AutoCAD.DatabaseServices.TextEditorSelection
```

```text
public class TextEditorSelectionbase : DisposableWrapper;
```

### Methods

- InputSpecialChar
- InsertColumnBreak
- InsertImportedText
- InsertString
- InsertSymbol

### Other

- AutoCAD.DatabaseServices.TextEditorSelectionbase.FlowAlign Enumeration
- AutoCAD.DatabaseServices.TextEditorSelectionbase.InsertTextType Enumeration

### Properties

- Bold
- Color
- FlowAlignment
- Font
- Height
- Italic
- Language
- MaxObliqueAngle
- MaxTrackingFactor
- MaxWidthScale
- MinObliqueAngle
- MinTrackingFactor
- MinWidthScale
- ObliqueAngle
- Overline
- Strikethrough
- TrackingFactor
- Underline
- WidthScale

## Methods Details

### InputSpecialChar

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::inputSpecialChar() method.
```text
public void InputSpecialChar(
    [MarshalAs(UnmanagedType.U2)] char ch
);
```

### InsertColumnBreak

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::insertColumnBreak() method.
```text
public void InsertColumnBreak();
```

### InsertImportedText

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::insertImportedText() method.
```text
public void InsertImportedText(
    InsertTextType type,
    byte\[\] data
);
```

### InsertString

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::insertString() method.
```text
public void InsertString(
    string @string
);
```

### InsertSymbol

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::insertSymbol() method.
```text
public void InsertSymbol(
    [MarshalAs(UnmanagedType.U2)] char ch,
    int langId
);
```

### AutoCAD.DatabaseServices.TextEditorSelectionbase.FlowAlign Enumeration

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::FlowAlign enum.
```text
public enum FlowAlign {
  FlowBase,
  FlowCenter,
  FlowTop
}
```

### AutoCAD.DatabaseServices.TextEditorSelectionbase.InsertTextType Enumeration

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::InsertTextType enum.
```text
public enum InsertTextType {
  UnicodeMTextFormat,
  MTextFormat,
  RichTextFormat,
  UnicodeDTextFormat,
  DTextFormat,
  UnicodeTextFormat,
  MultibyteTextFormat
}
```

## Properties Details

### Bold

#### Description
Gets and sets the bold property for the current selection or cursor.
This wraps the ObjectARX AcDbTextEditorSelectionBase::bold() and AcDbTextEditorSelectionBase::toggleBold() methods.
```text
public bool Bold;
```

### Color

#### Description
Gets and sets the color for the current selection or cursor.
This wraps the ObjectARXAcDbTextEditorSelectionBase::color() andAcDbTextEditorSelectionBase::setColor() methods.
```text
public Autodesk.AutoCAD.Colors.Color Color;
```

### FlowAlignment

#### Description
Gets and sets the flow alignment for the current selection or cursor.
This wraps the ObjectARX AcDbTextEditorSelectionBase::flowAlign() and AcDbTextEditorSelectionBase::setFlowAlign() methods.
```text
public FlowAlign FlowAlignment;
```

### Font

#### Description
Gets and sSets the font for the current selection or cursor.
This wraps the ObjectARX AcDbTextEditorSelectionBase::font() and AcDbTextEditorSelectionBase::setFont() methods.
```text
public Autodesk.AutoCAD.DatabaseServices.Font Font;
```

### Height

#### Description
Gets and sets the text height for the current selection or cursor.
This wraps the ObjectARX AcDbTextEditorSelectionBase::height() and AcDbTextEditorSelectionBase::setHeight() methods.
```text
public double Height;
```

### Italic

#### Description
Gets and sets the italic property for the current selection or cursor.
This wraps the ObjectARX AcDbTextEditorSelectionBase::italic() and AcDbTextEditorSelectionBase::toggleItalic() methods.
```text
public bool Italic;
```

### Language

#### Description
Gets and sets the language for the current selection or cursor.
This wraps the ObjectARX AcDbTextEditorSelectionBase::language() and AcDbTextEditorSelectionBase::setLanguage() methods.
```text
public int Language;
```

### MaxObliqueAngle

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::maxObliqueAngle() method.
```text
public static double MaxObliqueAngle;
```

### MaxTrackingFactor

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::maxTrackingFactor() method.
```text
public static double MaxTrackingFactor;
```

### MaxWidthScale

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::maxWidthScale() method.
```text
public static double MaxWidthScale;
```

### MinObliqueAngle

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::minObliqueAngle() method.
```text
public static double MinObliqueAngle;
```

### MinTrackingFactor

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::minTrackingFactor() method.
```text
public static double MinTrackingFactor;
```

### MinWidthScale

#### Description
This wraps the ObjectARX AcDbTextEditorSelectionBase::minWidthScale() method.
```text
public static double MinWidthScale;
```

### ObliqueAngle

#### Description
Gets and sets the oblique angle for the current selection or cursor.
This wraps the ObjectARX AcDbTextEditorSelectionBase::obliqueAngle() and AcDbTextEditorSelectionBase::setObliqueAngle() methods.
```text
public double ObliqueAngle;
```

### Overline

#### Description
Gets and sets the overline property for the current selection or cursor.
This wraps the ObjectARX AcDbTextEditorSelectionBase::overline() and AcDbTextEditorSelectionBase::toggleOverline() methods.
```text
public bool Overline;
```

### Strikethrough

#### Description
Get current strikethrough state.
```text
public bool Strikethrough;
```

#### Returns
Returns true if overline is on, else false.
#### Conditions
Read / Write
### TrackingFactor

#### Description
Gets and sets the tracking factor for the current selection or cursor.
This wraps the ObjectARX AcDbTextEditorSelectionBase::trackingFactor() and AcDbTextEditorSelectionBase::setTrackingFactor() methods.
```text
public double TrackingFactor;
```

### Underline

#### Description
Gets and sets the underline property for the current selection or cursor.
This wraps the ObjectARX AcDbTextEditorSelectionBase::underline() and AcDbTextEditorSelectionBase::toggleUnderline() methods.
```text
public bool Underline;
```

### WidthScale

#### Description
Gets and sets the width scale factor for the current selection or cursor.
This wraps the ObjectARX AcDbTextEditorSelectionBase::widthScale() and AcDbTextEditorSelectionBase::setWidthScale() methods.
```text
public double WidthScale;
```