# EqualLengthConstraint Class

## Overview

#### Description
This class represents a EqualLength constraint node in the owning Assoc2dConstraintGroup.
It can be applied between two constrained bounded lines (not rays).
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.EqualLengthConstraint
```

```text
public class EqualLengthConstraint : GeometricalConstraint;
```

## Members

### Constructors

- EqualLengthConstraint

## Constructors Details

### EqualLengthConstraint

#### Description
Default constructor.
```text
public EqualLengthConstraint();
```