# AssocPathActionParam Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocPathActionParam class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionParam
        Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam
            Autodesk.AutoCAD.DatabaseServices.AssocPathActionParam
```

```text
public class AssocPathActionParam : AssocCompoundActionParam;
```

### Constructors

- AssocPathActionParam

### Methods

- GetEdgeRefArray
- SetEdgeRefArray
- UpdateEdgeRef

## Constructors Details

### AssocPathActionParam

#### Description
This wraps the ObjectARX AssocPathActionParam::AcDbAssocPathActionParam() method.
```text
public AssocPathActionParam();
```

### GetEdgeRefArray

#### Description
This wraps the ObjectARX AssocPathActionParam::getEdgeRefArray() method.
```text
public EdgeRef\[\]\[\] GetEdgeRefArray();
```

### SetEdgeRefArray

#### Description
This wraps the ObjectARX AssocPathActionParam::setEdgeRefArray() method.
```text
public void SetEdgeRefArray(
    EdgeRef\[\] edgeRef
);
```

### UpdateEdgeRef

#### Description
This wraps the ObjectARX AssocPathActionParam::updateEdgeRef() method.
```text
public void UpdateEdgeRef(
    int index,
    EdgeRef edge
);
```