# SubentRef Class

## Overview

#### Description
This wraps the ObjectARX AcDbSubentRef class
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.GeomRef
    Autodesk.AutoCAD.DatabaseServices.SubentRef
        Autodesk.AutoCAD.DatabaseServices.EdgeRef
        Autodesk.AutoCAD.DatabaseServices.FaceRef
        Autodesk.AutoCAD.DatabaseServices.VertexRef
```

```text
public abstract class SubentRef : GeomRef;
```

### Methods

- CopyFrom
- CreateEntity

### Properties

- Entity
- SubentId

## Methods Details

### CopyFrom

#### Description
This wraps the ObjectARX AcDbSubentRef::operator =(const AcDbSubentRef&amp;) method
```text
public void CopyFrom(
    SubentRef source
);
```

### CreateEntity

#### Description
This wraps the ObjectARX AcDbSubentRef::createEntity() method
```text
public Autodesk.AutoCAD.DatabaseServices.Entity CreateEntity();
```

### Entity

#### Description
This wraps the ObjectARXAcDbSubentRef::entity() method
```text
public CompoundObjectId Entity;
```

### SubentId

#### Description
This wraps the ObjectARX AcDbSubentRef::subentId() method
```text
public SubentityId SubentId;
```