# Autodesk.AutoCAD.DatabaseServices.TextAlignmentType Enumeration

## Overview

#### Description
This .NET enum wraps the AcDbMLeaderStyle::TextAlignmentType ObjectARX enum. This enum describes the types of text alignment type.
```text
public enum TextAlignmentType {
  LeftAlignment,
  CenterAlignment,
  RightAlignment
}
```

#### Members
| Members | Description |
| --- | --- |
| LeftAlignment | Left-justifies text in the MText. |
| CenterAlignment | Centers text in MText. |
| RightAlignment | Right-justifies text in the MText. |