# PromptIntegerResultEventArgs Class

## Overview

#### Description
This class provides data for the PromptingForInteger event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptIntegerResultEventArgs
```

```text
public sealed class PromptIntegerResultEventArgs : EventArgs;
```

### Properties

- Result

## Properties Details

### Result

#### Description
Gets the result of the selection.
```text
public PromptIntegerResult Result;
```

#### Conditions
Read-only