# AssocSweptSurfaceActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody
```

```text
public class AssocSweptSurfaceActionBody : AssocPathBasedSurfaceActionBody;
```

### Constructors

- AssocSweptSurfaceActionBody

### Methods

- CreateInstance
- GetAlignAngle
- GetScaleFactor
- GetTwistAngle
- SetAlignAngle
- SetScaleFactor
- SetTwistAngle

### Properties

- AlignAngle
- ScaleFactor
- TwistAngle

## Constructors Details

### AssocSweptSurfaceActionBody

#### Description
This wraps the ObjectARXAcDbAssocSweptSurfaceActionBody::AcDbAssocSweptSurfaceActionBody() method.
```text
public AssocSweptSurfaceActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    ObjectId resultingSurfaceId,
    PathRef sweptPath,
    PathRef path,
    SweepOptions sweptOptions,
    [MarshalAs(UnmanagedType.U1)] bool enable
);
```

### GetAlignAngle

#### Description
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::alignAngle() method.
```text
public double GetAlignAngle(
    out string expression,
    out string evaluatorId
);
```

### GetScaleFactor

#### Description
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::scaleFactor() method.
```text
public double GetScaleFactor(
    out string expression,
    out string evaluatorId
);
```

### GetTwistAngle

#### Description
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::twistAngle() method.
```text
public double GetTwistAngle(
    out string expression,
    out string evaluatorId
);
```

### SetAlignAngle

#### Description
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::setAlignAngle() method.
```text
public void SetAlignAngle(
    double value,
    string expression,
    string evaluatorId
);
```

### SetScaleFactor

#### Description
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::setScaleFactor() method.
```text
public void SetScaleFactor(
    double value,
    string expression,
    string evaluatorId
);
```

### SetTwistAngle

#### Description
This wraps the ObjectARXAcDbAssocSweptSurfaceActionBody::setTwistAngle() method.
```text
public void SetTwistAngle(
    double value,
    string expression,
    string evaluatorId
);
```

### AlignAngle

#### Description
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::alignAngle() and AcDbAssocSweptSurfaceActionBody::setAlignAngle ()methods.
```text
public double AlignAngle;
```

### ScaleFactor

#### Description
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::scaleFactor() and AcDbAssocSweptSurfaceActionBody::setScaleFactor () methods.
```text
public double ScaleFactor;
```

### TwistAngle

#### Description
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::twistAngle() and AcDbAssocSweptSurfaceActionBody::setTwistAngle () methods.
```text
public double TwistAngle;
```