# Autodesk.AutoCAD.DatabaseServices.MlineJustification Enumeration

## Overview

#### Description
This .NET class wraps the Mline::Justification ObjectARX enum.
This enum defines the type of justifications an mline can have.
```text
public enum MlineJustification {
  Top,
  Zero,
  Bottom
}
```

#### Members
| Members | Description |
| --- | --- |
| Top | Top justification |
| Zero | No justification |
| Bottom | Bottom justification |