# Profile3d Class

## Overview

#### Description
This wraps the ObjectARX AcDb3dProfile class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.Profile3d
    Autodesk.AutoCAD.DatabaseServices.LoftProfile
```

```text
public class Profile3d : RXObject;
```

### Constructors

- Profile3d()
- Profile3d(Autodesk.AutoCAD.DatabaseServices.Entity)
- Profile3d(FullSubentityPath)
- Profile3d(PathRef)
- Profile3d(Profile3d)
- Profile3d(VertexRef)

### Methods

- [ConvertProfile([MarshalAs(UnmanagedType.U1)] bool, [MarshalAs(UnmanagedType.U1)] bool, [MarshalAs(UnmanagedType.U1)] bool, [MarshalAs(UnmanagedType.U1)] bool)](#convertprofile([marshalas(unmanagedtype.u1)]-bool,-[marshalas(unmanagedtype.u1)]-bool,-[marshalas(unmanagedtype.u1)]-bool,-[marshalas(unmanagedtype.u1)]-bool))
- [ConvertProfile(PathRef[])](#convertprofile(pathref[]))
- CopyFrom
- MergeProfiles

### Properties

- Entity
- IsClosed
- IsEdge
- IsFace
- IsPlanar
- IsSubent
- IsValid
- ProfilePathRef
- ProfileVertexRef

## Constructors Details

### Profile3d()

#### Description
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile () method.
```text
public Profile3d();
```

### Profile3d(Autodesk.AutoCAD.DatabaseServices.Entity)

#### Description
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile () method.
```text
public Profile3d(
    Autodesk.AutoCAD.DatabaseServices.Entity entity
);
```

### Profile3d(FullSubentityPath)

#### Description
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile() method.
```text
public Profile3d(
    FullSubentityPath faceSubentPath
);
```

### Profile3d(PathRef)

#### Description
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile () method.
```text
public Profile3d(
    PathRef pathRef
);
```

### Profile3d(Profile3d)

#### Description
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile () method.
```text
public Profile3d(
    Profile3d profile3d
);
```

### Profile3d(VertexRef)

#### Description
This wraps the ObjectARX AcDb3dProfile::AcDb3dProfile () method.
```text
public Profile3d(
    VertexRef vertexRef
);
```

### ConvertProfile([MarshalAs(UnmanagedType.U1)] bool, [MarshalAs(UnmanagedType.U1)] bool, [MarshalAs(UnmanagedType.U1)] bool, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDb3dProfile::convertProfile() method.
```text
public Profile3d\[\] ConvertProfile(
    [MarshalAs(UnmanagedType.U1)] bool explodeMultiFaceRegions,
    [MarshalAs(UnmanagedType.U1)] bool convertSurfaceToEdges,
    [MarshalAs(UnmanagedType.U1)] bool nonPlanarOnly,
    [MarshalAs(UnmanagedType.U1)] bool outerLoopOnly
);
```

### ConvertProfile(PathRef[])

#### Description
This wraps the ObjectARX AcDb3dProfile::convertProfile() method.
```text
public static Profile3d ConvertProfile(
    PathRef\[\] pathRefArray
);
```

### CopyFrom

#### Description
This wraps the ObjectARX AcDb3dProfile::operator =() method.
```text
public void CopyFrom(
    Profile3d source
);
```

### MergeProfiles

#### Description
This wraps the ObjectARXAcDb3dProfile::mergeProfiles () method.
```text
public static Profile3d\[\] MergeProfiles(
    Profile3d\[\] profiles,
    [MarshalAs(UnmanagedType.U1)] bool mergeEdges,
    [MarshalAs(UnmanagedType.U1)] bool mergeCurves
);
```

### Entity

#### Description
This wraps the ObjectARX AcDb3dProfile::entity() and AcDb3dProfile::set() methods.
```text
public Autodesk.AutoCAD.DatabaseServices.Entity Entity;
```

### IsClosed

#### Description
This wraps the ObjectARX AcDb3dProfile::isClosed () method.
```text
public bool IsClosed;
```

### IsEdge

#### Description
This wraps the ObjectARX AcDb3dProfile::isEdge () method.
```text
public bool IsEdge;
```

### IsFace

#### Description
This wraps the ObjectARXAcDb3dProfile::isFace () method.
```text
public bool IsFace;
```

### IsPlanar

#### Description
This wraps the ObjectARX AcDb3dProfile::isPlanar () method.
```text
public bool IsPlanar;
```

### IsSubent

#### Description
This wraps the ObjectARX AcDb3dProfile::isSubent () method.
```text
public bool IsSubent;
```

### IsValid

#### Description
This wraps the ObjectARX AcDb3dProfile::isValid () method.
```text
public bool IsValid;
```

### ProfilePathRef

#### Description
This wraps the ObjectARX AcDb3dProfile::getPathRef() and AcDb3dProfile::set() methods.
```text
public PathRef ProfilePathRef;
```

### ProfileVertexRef

#### Description
This wraps the ObjectARX AcDb3dProfile::getVertexRef() and AcDb3dProfile::set() methods.
```text
public VertexRef ProfileVertexRef;
```