# TextEditorWipeout Class

## Overview

#### Description
This wraps the ObjectARX AcDbTextEditorWipeout class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.TextEditorWipeout
```

```text
public class TextEditorWipeout : DisposableWrapper;
```

### Properties

- BackgroundFillColor
- BackgroundFillEnabled
- BackgroundScaleFactor
- MaxBackgroundScaleFactor
- MinBackgroundScaleFactor
- UseBackgroundColor

## Properties Details

### BackgroundFillColor

#### Description
Gets and sets the background fill color.
This wraps the ObjectARX AcDbTextEditorWipeout::getBackgroundFillColor() and AcDbTextEditorWipeout::setBackgroundFillColor() methods.
```text
public Autodesk.AutoCAD.Colors.Color BackgroundFillColor;
```

### BackgroundFillEnabled

#### Description
Gets and sets the flag to enable the background fill.
This wraps the ObjectARX AcDbTextEditorWipeout::enableBackgroundFill() and AcDbTextEditorWipeout::setEnableBackgroundFill() methods.
```text
public bool BackgroundFillEnabled;
```

### BackgroundScaleFactor

#### Description
Gets and sets the background scale factor.
This wraps the ObjectARX AcDbTextEditorWipeout::getBackgroundScaleFactor() and AcDbTextEditorWipeout::setBackgroundScaleFactor() methods.
```text
public double BackgroundScaleFactor;
```

### MaxBackgroundScaleFactor

#### Description
This wraps the ObjectARX AcDbTextEditorWipeout::maxBackgroundScaleFactor() method.
```text
public static double MaxBackgroundScaleFactor;
```

### MinBackgroundScaleFactor

#### Description
This wraps the ObjectARX AcDbTextEditorWipeout::minBackgroundScaleFactor() method.
```text
public static double MinBackgroundScaleFactor;
```

### UseBackgroundColor

#### Description
Gets and sets the flag to use the background color.
This wraps the ObjectARX AcDbTextEditorWipeout::useBackgroundColor() and AcDbTextEditorWipeout::setUseBackgroundColor() methods.
```text
public bool UseBackgroundColor;
```