# PromptEntityResultEventArgs Class

## Overview

#### Description
This class provides data for the PromptedForEntity event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptEntityResultEventArgs
```

```text
public sealed class PromptEntityResultEventArgs : EventArgs;
```

### Properties

- Result

## Properties Details

### Result

#### Description
Gets the result of the selection.
```text
public PromptEntityResult Result;
```

#### Conditions
Read-only