# SurfaceTrimInfo Class

## Overview

#### Description
This wraps the ObjectARX AcDbSurfaceTrimInfo class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.SurfaceTrimInfo
```

```text
public class SurfaceTrimInfo : DisposableWrapper;
```

### Constructors

- SurfaceTrimInfo

### Methods

- SetTrimInfo(CompoundObjectId, TrimRelation, SubentityId)
- SetTrimInfo(CompoundObjectId, Vector3d, TrimRelation)

### Other

- AutoCAD.DatabaseServices.SurfaceTrimInfo.TrimRelation Enumeration

### Properties

- IsCurve
- ProjVector
- Relation
- ToolBodyId

## Constructors Details

### SurfaceTrimInfo

#### Description
This wraps the ObjectARX AcDbSurfaceTrimInfo::AcDbSurfaceTrimInfo() method.
```text
public SurfaceTrimInfo();
```

### SetTrimInfo(CompoundObjectId, TrimRelation, SubentityId)

#### Description
This wraps the ObjectARX AcDbSurfaceTrimInfo::setTrimInfo() method.
```text
public void SetTrimInfo(
    CompoundObjectId surfaceId,
    TrimRelation relation,
    SubentityId subEntityId
);
```

### SetTrimInfo(CompoundObjectId, Vector3d, TrimRelation)

#### Description
This wraps the ObjectARX AcDbSurfaceTrimInfo::setTrimInfo() method.
```text
public void SetTrimInfo(
    CompoundObjectId curveId,
    Vector3d projVector,
    TrimRelation relation
);
```

### AutoCAD.DatabaseServices.SurfaceTrimInfo.TrimRelation Enumeration

#### Description
This wraps the ObjectARX AcDbSurfaceTrimInfo::TrimRelation enum.
```text
public enum TrimRelation {
  InsideTool,
  OutsideTool
}
```

## Properties Details

### IsCurve

#### Description
This wraps the ObjectARX AcDbSurfaceTrimInfo::isCurve() method.
```text
public bool IsCurve;
```

### ProjVector

#### Description
This wraps the ObjectARX AcDbSurfaceTrimInfo::projVector() and AcDbSurfaceTrimInfo::setProjVector() methods.
```text
public Vector3d ProjVector;
```

### Relation

#### Description
This wraps the ObjectARX AcDbSurfaceTrimInfo::relation() and AcDbSurfaceTrimInfo::setRelation () methods.
```text
public TrimRelation Relation;
```

### ToolBodyId

#### Description
This wraps the ObjectARX AcDbSurfaceTrimInfo::toolBodyId() and AcDbSurfaceTrimInfo::setToolBodyId() methods.
```text
public CompoundObjectId ToolBodyId;
```