# Autodesk.AutoCAD.DatabaseServices.AnnotativeStates Enumeration

## Overview

#### Description
This class determines the state of the annotation (whether it exists or not).
```text
public enum AnnotativeStates {
  True,
  False,
  NotApplicable
}
```

#### Members
| Members | Description |
| --- | --- |
| True | The state is true. |
| False | The state is false. |
| NotApplicable | The state does not matter. |