# PerpendicularConstraint Class

## Overview

#### Description
This class represents a Perpendicular constraint node in the owning Assoc2dConstraintGroup.
It can be applied between two lines.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.PerpendicularConstraint
```

```text
public class PerpendicularConstraint : GeometricalConstraint;
```

## Members

### Constructors

- PerpendicularConstraint

## Constructors Details

### PerpendicularConstraint

#### Description
Default constructor.
```text
public PerpendicularConstraint();
```