# Autodesk.AutoCAD.DatabaseServices.GsMarkType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbMLeader::gsMarkType ObjectARX enum.
```text
public enum GsMarkType {
  ArrowMark = 1,
  BlockMark = 0x3a9c,
  DoglegMark = 0x2711,
  LeaderLineMark = 0x1389,
  MTextMark = 0x3a99,
  MTextUnderLineMark = 0x3a9a,
  None = 0,
  ToleranceMark = 0x3a9b
}
```

#### Members
| Members | Description |
| --- | --- |
| ArrowMark = 1 | Arrow symbol gs mark. |
| BlockMark = 0x3a9c | BlockAttribute content gs mark |
| DoglegMark = 0x2711 | Dogleg gs mark. |
| LeaderLineMark = 0x1389 | A leaderLine gs mark. |
| MTextMark = 0x3a99 | MText content gs mark. |
| MTextUnderLineMark = 0x3a9a | MText underline content gs mark, including text frame if MLeader has one. |
| None = 0 | Null gs mark |
| ToleranceMark = 0x3a9b | Tolerance content gs mark |