# IdMappingEventArgs Class

## Overview

#### Description
This class provides data for the various events of the database.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.IdMappingEventArgs
```

```text
public sealed class IdMappingEventArgs : EventArgs;
```

### Properties

- IdMapping

## Properties Details

### IdMapping

#### Description
Accesses the IdMapping that is associated with this event.
```text
public Autodesk.AutoCAD.DatabaseServices.IdMapping IdMapping;
```

#### Conditions
Read-only