# PdfDefinition Class

## Overview

#### Description
This .NET class wraps the ObjectARX class AcDbPdfDefinition.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition
        Autodesk.AutoCAD.DatabaseServices.PdfDefinition
```

```text
public class PdfDefinition : UnderlayDefinition;
```

## Members

### Constructors

- PdfDefinition

## Constructors Details

### PdfDefinition

#### Description
This is PdfDefinition, a member of class PdfDefinition.
```text
public PdfDefinition();
```