# BlendOptions Class

## Overview

#### Description
The wraps the ObjectARX AcDbBlendOptions class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.BlendOptions
```

```text
public sealed class BlendOptions : DisposableWrapper, ICloneable;
```

### Constructors

- BlendOptions

### Other

- AutoCAD.DatabaseServices.BlendOptions.DriveModeType Enumeration

### Properties

- CoplanarDirection
- CoplanarPoint
- DriveMode
- Quality
- Simplify
- Solid

## Constructors Details

### BlendOptions

#### Description
This wraps the ObjectARX AcDbBlendOptions::AcDbBlendOptions() method.
```text
public BlendOptions();
```

### AutoCAD.DatabaseServices.BlendOptions.DriveModeType Enumeration

#### Description
This wraps the ObjectARX AcDbBlendOptions::DriveModeType enum.
```text
public enum DriveModeType {
  DriveModeFirst,
  DriveModeSecond,
  DriveModeBoth
}
```

## Properties Details

### CoplanarDirection

#### Description
This wraps the ObjectARX AcDbBlendOptions::coplanarDirection () method.
```text
public Vector3d? CoplanarDirection;
```

### CoplanarPoint

#### Description
This wraps the ObjectARX AcDbBlendOptions::coplanarPoint() method.
```text
public Point3d? CoplanarPoint;
```

### DriveMode

#### Description
This wraps the ObjectARX AcDbBlendOptions::driveMode () method.
```text
public DriveModeType DriveMode;
```

### Quality

#### Description
This wraps the ObjectARX AcDbBlendOptions::quality() method.
```text
public uint Quality;
```

### Simplify

#### Description
This wraps the ObjectARX AcDbBlendOptions::simplify() method.
```text
public bool Simplify;
```

### Solid

#### Description
This wraps the ObjectARX AcDbBlendOptions::solid() method.
```text
public bool Solid;
```