# GeomRef Class

## Overview

#### Description
This wraps the ObjectARX AcDbGeomRef class
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.GeomRef
    Autodesk.AutoCAD.DatabaseServices.PathRef
    Autodesk.AutoCAD.DatabaseServices.SubentRef
```

```text
public abstract class GeomRef : RXObject;
```

### Methods

- Reset

### Properties

- IsEmpty
- IsValid

## Methods Details

### Reset

#### Description
This wraps the ObjectARX AcDbGeomRef::reset() method
```text
public void Reset();
```

### IsEmpty

#### Description
This wraps the ObjectARX AcDbGeomRef::isEmpty() method
```text
public bool IsEmpty;
```

### IsValid

#### Description
This wraps the ObjectARX AcDbGeomRef::isValid() method
```text
public bool IsValid;
```