# PointCloud Class

## Overview

#### Description
This is class Autodesk.AutoCAD.DatabaseServices.PointCloud.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.Entity
        Autodesk.AutoCAD.DatabaseServices.PointCloud
```

```text
public class PointCloud : Entity;
```

### Constructors

- PointCloud

### Methods

- RegenPointClouds

## Constructors Details

### PointCloud

#### Description
This is PointCloud, a member of class PointCloud.
```text
public PointCloud();
```

### RegenPointClouds

#### Description
This is RegenPointClouds, a member of class PointCloud.
```text
public static void RegenPointClouds();
```