# SymmetricConstraint Class

## Overview

#### Description
This class represents a Symmetric constraint node in the owning Assoc2dConstraintGroup.
It can be applied between two same type of constrained geometries (except spline).
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.SymmetricConstraint
```

```text
public class SymmetricConstraint : GeometricalConstraint;
```

## Members

### Constructors

- SymmetricConstraint

## Constructors Details

### SymmetricConstraint

#### Description
Default constructor.
```text
public SymmetricConstraint();
```