# RegAppTableRecord Class

## Overview

#### Description
This .NET class wraps the AcDbRegAppTableRecord ObjectARX class.
Objects of this class represent records in the RegAppTable (known as the APPID symbol table in AutoCAD and DXF). Each of these records represents an application ID used to identify a group of Extended Entity Data attached to objects in the drawing database.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.SymbolTableRecord
        Autodesk.AutoCAD.DatabaseServices.RegAppTableRecord
```

```text
public class RegAppTableRecord : SymbolTableRecord;
```

## Members

### Constructors

- RegAppTableRecord

## Constructors Details

### RegAppTableRecord

#### Description
Default constructor.
```text
public RegAppTableRecord();
```