# ConcentricConstraint Class

## Overview

#### Description
This class represents a Concentric constraint node in the owning Assoc2dConstraintGroup. It can be applied between two circles, arcs or ellipses.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.ConcentricConstraint
            Autodesk.AutoCAD.DatabaseServices.CenterPointConstraint
```

```text
public class ConcentricConstraint : GeometricalConstraint;
```

## Members

### Constructors

- ConcentricConstraint

## Constructors Details

### ConcentricConstraint

#### Description
Default constructor.
```text
public ConcentricConstraint();
```