# Autodesk.AutoCAD.DatabaseServices.ViewStyleType Enumeration

## Overview

#### Description
The type of the view style.
```text
public enum ViewStyleType {
  FromBase,
  WireframeVisibleEdges,
  WireframeHiddenEdges,
  ShadedVisibleEdges,
  ShadedHiddenEdges
}
```

#### Members
| Members | Description |
| --- | --- |
| FromBase | The view style type is controlled by the base view. Return value is an enum. |
| WireframeVisibleEdges | The view style is shaded with visible edges only. Return value is an enum. |
| WireframeHiddenEdges | The view style type is wireframe with hidden edges displayed. Return value is enum. |
| ShadedVisibleEdges | The view style is shaded with visible edges only. Return value is an enum. |
| ShadedHiddenEdges | The view style is shaded with hidden edges displayed. Return value is an enum. |