# AssocPathBasedSurfaceActionBody Class

## Overview

#### Description
This wraps AcDbAssocPathBasedSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocExtendSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocPlaneSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocRevolvedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocTrimSurfaceActionBody
```

```text
public class AssocPathBasedSurfaceActionBody : AssocSurfaceActionBody;
```

### Constructors

- AssocPathBasedSurfaceActionBody

### Methods

- GetInputPaths
- GetInputPoints
- MakeInputPathsDrawOnTopOfResultingSurface
- RemoveAllPathParams
- [SetInputPaths(EdgeRef[])](#setinputpaths(edgeref[]))
- [SetInputPaths(PathRef[])](#setinputpaths(pathref[]))
- SetInputPoints
- UpdateInputPath

### Properties

- InputPathParams

## Constructors Details

### AssocPathBasedSurfaceActionBody

#### Description
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::AcDbAssocPathBasedSurfaceActionBody() method.
```text
public AssocPathBasedSurfaceActionBody();
```

### GetInputPaths

#### Description
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::getInputPaths() method.
```text
public void GetInputPaths(
    out EdgeRef\[\] paths
);
```

### GetInputPoints

#### Description
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::getInputPoints() method.
```text
public VertexRef\[\] GetInputPoints();
```

### MakeInputPathsDrawOnTopOfResultingSurface

#### Description
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::makeInputPathsDrawOnTopOfResultingSurface() method.
```text
public void MakeInputPathsDrawOnTopOfResultingSurface();
```

### RemoveAllPathParams

#### Description
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::removeAllPathParams() method.
```text
public void RemoveAllPathParams();
```

### SetInputPaths(EdgeRef[])

#### Description
This wraps the ObjectARXAcDbAssocPathBasedSurfaceActionBody::setInputPaths() method.
```text
public void SetInputPaths(
    EdgeRef\[\] edges
);
```

### SetInputPaths(PathRef[])

#### Description
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::setInputPaths() method.
```text
public void SetInputPaths(
    PathRef\[\] paths
);
```

### SetInputPoints

#### Description
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::setInputPoints() method.
```text
public void SetInputPoints(
    VertexRef\[\] points
);
```

### UpdateInputPath

#### Description
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::updateInputPath() method.
```text
public void UpdateInputPath(
    int index,
    PathRef pathRef
);
```

### InputPathParams

#### Description
This wraps the ObjectARX AcDbAssocPathBasedSurfaceActionBody::getInputPathParams() method.
```text
public ObjectIdCollection InputPathParams;
```