# AssocCompoundActionParam Class

## Overview

#### Description
This is class Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionParam
        Autodesk.AutoCAD.DatabaseServices.AssocCompoundActionParam
            Autodesk.AutoCAD.DatabaseServices.AssocPathActionParam
```

```text
public class AssocCompoundActionParam : AssocActionParam;
```

### Constructors

- AssocCompoundActionParam

### Methods

- AddParam
- ParamAtIndex
- ParamAtName(string)
- ParamAtName(string, int)
- ParamsAtName
- RemoveAllParams
- RemoveParam

### Properties

- OwnedParams
- ParamCount

## Constructors Details

### AssocCompoundActionParam

#### Description
This wraps the ObjectARX AssocCompoundActionParam::AcDbAssocCompoundActionParam() method.
```text
public AssocCompoundActionParam();
```

### AddParam

#### Description
This wraps the ObjectARX AssocCompoundActionParam::addParam () method.
```text
public int AddParam(
    ObjectId paramId
);
```

### ParamAtIndex

#### Description
This wraps the ObjectARX AssocCompoundActionParam::paramAtIndex() method.
```text
public ObjectId ParamAtIndex(
    int index
);
```

### ParamAtName(string)

#### Description
This wraps the ObjectARX AssocCompoundActionParam::paramAtName() method.
```text
public ObjectId ParamAtName(
    string paramName
);
```

### ParamAtName(string, int)

#### Description
This wraps the ObjectARX AssocCompoundActionParam::paramAtName() method.
```text
public ObjectId ParamAtName(
    string paramName,
    int index
);
```

### ParamsAtName

#### Description
This wraps the ObjectARX AssocCompoundActionParam::paramsAtName () method.
```text
public ObjectIdCollection ParamsAtName(
    string paramName
);
```

### RemoveAllParams

#### Description
This wraps the ObjectARX AssocCompoundActionParam::removeAllParams() method.
```text
public void RemoveAllParams(
    [MarshalAs(UnmanagedType.U1)] bool alsoEraseThem
);
```

### RemoveParam

#### Description
This wraps the ObjectARX AssocCompoundActionParam::removeParam () method.
```text
public void RemoveParam(
    ObjectId paramId,
    [MarshalAs(UnmanagedType.U1)] bool alsoEraseIt
);
```

### OwnedParams

#### Description
This wraps the ObjectARX AssocCompoundActionParam::ownedParams () method.
```text
public ObjectIdCollection OwnedParams;
```

### ParamCount

#### Description
This wraps the ObjectARX AssocCompoundActionParam::paramCount() method.
```text
public int ParamCount;
```