# Autodesk.AutoCAD.DatabaseServices.SaveType Enumeration

## Overview

#### Description
This .NET enum wraps the AcDb::SaveType ObjectARX enum.
Class
Autodesk.AutoCAD.DatabaseServices
#### Members
| Members | Description |
| --- | --- |
| NoSave | saveAs is not called; no save takes place |
| Save12 | Save as type AutoCAD R12 |
| Save13 | Save as type AutoCAD R13 |
| Save14 | Save as type AutoCAD R14 |
| Save2000 | Save as type AutoCAD 2000 |
| Save2004 | Save as type AutoCAD 2004 |
| Save2007 | Save as type AutoCAD 2007 |
| Save2010 | Save as type AutoCAD 2010 |
| Save2013 | Save as type AutoCAD 2013 |
| Save2018 | Save as type AutoCAD 2018 |

Previous Declaration
```text
public enum SaveType {
NoSave,
Save12,
Save13,
Save14,
Save2000,
Save2004,
Save2007,
Save2010,
Save2013
}
```