# Autodesk.AutoCAD.DatabaseServices.GridProperties Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::GridProperty ObjectARX enum. These values describe the grid lines of a table.
```text
public enum GridProperties {
  Color = 8,
  DoubleLineSpacing = 0x20,
  Invalid = 0,
  LineStyle = 1,
  Linetype = 4,
  LineWeight = 2,
  Visibility = 0x10
}
```

#### Members
| Members | Description |
| --- | --- |
| Color = 8 | Grid line color |
| DoubleLineSpacing = 0x20 | Grid double line spacing |
| Invalid = 0 | Unknown grid property |
| LineStyle = 1 | Grid line style |
| Linetype = 4 | Grid line type |
| LineWeight = 2 | Grid line weight |
| Visibility = 0x10 | Grid line visibility |