# Autodesk.AutoCAD.DatabaseServices.PointCloudCropType Enumeration

## Overview

#### Description
Defines the crop type. The crop type is the shape of the cropping region.
```text
public enum PointCloudCropType {
  Invalid,
  Rectangular,
  Polygonal,
  Circular
}
```

#### Members
| Members | Description |
| --- | --- |
| Invalid | Undefined type. |
| Rectangular | Rectangular type. |
| Polygonal | Polygonal type. |
| Circular | Circle type. |