# Autodesk.AutoCAD.DatabaseServices.GridLineStyle Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::GridLineStyle ObjectARX enum.
```text
public enum GridLineStyle {
  Double = 2,
  Single = 1
}
```

#### Members
| Members | Description |
| --- | --- |
| Double = 2 | Double grid lines |
| Single = 1 | Single grid line |