# Autodesk.AutoCAD.DatabaseServices.HatchObjectType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbHatch::HatchObjectType ObjectARX enum.
Values in this enum describe the type of a hatch object.
```text
public enum HatchObjectType {
  HatchObject,
  GradientObject
}
```

#### Members
| Members | Description |
| --- | --- |
| HatchObject | Indicates that the object is currently a classic hatch |
| GradientObject | Indicates that the object is currently a color gradient |