# Autodesk.AutoCAD.EditorInput.DragCursor Enumeration

## Overview

#### Description
This enum lists the cursor types that may be used while dragging.
```text
public enum DragCursor {
  Normal,
  None,
  Selection
}
```

#### Members
| Members | Description |
| --- | --- |
| Normal | Normal drag cursor. |
| None | No cursor type. |
| Selection | Selection drag cursor. |