# G2SmoothConstraint Class

## Overview

#### Description
This class represents a G2Smooth composite constraint node in the owning Assoc2dConstraintGroup.
It can be applied between a constrained bounded spline and other constrained bounded curve. It is a combination of AcTangentConstraint and AcEqualCurvatureConstraint.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.CompositeConstraint
            Autodesk.AutoCAD.DatabaseServices.G2SmoothConstraint
```

```text
public class G2SmoothConstraint : CompositeConstraint;
```

## Members

### Constructors

- G2SmoothConstraint

## Constructors Details

### G2SmoothConstraint

#### Description
Default constructor.
```text
public G2SmoothConstraint();
```