# Autodesk.AutoCAD.DatabaseServices.DrawLeaderOrderType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbMLeaderStyle::DrawLeaderOrderType ObjectARX enum.
This enum describes the types of the order of creating MLeader object's leaderline.
```text
public enum DrawLeaderOrderType {
  DrawLeaderHeadFirst,
  DrawLeaderTailFirst
}
```

#### Members
| Members | Description |
| --- | --- |
| DrawLeaderHeadFirst | Draw leaderline head first |
| DrawLeaderTailFirst | Draw leaderline tail first |