# TextEditorStack Structure

## Overview

#### Description
This wraps the ObjectARX AcDbTextEditorStack class.
```text
public struct TextEditorStack {
  public enum StackType {
    HorizontalStack,
    DiagonalStack,
    ToleranceStack,
    DecimalStack
  }
}
```

### Other

- AutoCAD.DatabaseServices.TextEditorStack.StackType Enumeration

### Properties

- Bottom
- DecimalChar
- FlowAlign
- MaxStackScale
- MinStackScale
- Scale
- Top
- Type

## Other Details

### AutoCAD.DatabaseServices.TextEditorStack.StackType Enumeration

#### Description
This wraps the ObjectARX AcDbTextEditorStack::StackType enum.
```text
public enum StackType {
  HorizontalStack,
  DiagonalStack,
  ToleranceStack,
  DecimalStack
}
```

## Properties Details

### Bottom

#### Description
Gets and sets the stack bottom string.
This wraps the ObjectARX AcDbTextEditorStack::bottom() and AcDbTextEditorStack::setBottom() methods.
```text
public string Bottom;
```

### DecimalChar

#### Description
Gets and sets the stack decimal char.
This wraps the ObjectARX AcDbTextEditorStack::decimalChar() and AcDbTextEditorStack::setDecimalChar() methods.
```text
public char DecimalChar;
```

### FlowAlign

#### Description
Gets and sets the stack flow alignment.
This wraps the ObjectARX AcDbTextEditorStack::alignType() and AcDbTextEditorStack::setAlignType() methods.
```text
public Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase.FlowAlign FlowAlign;
```

### MaxStackScale

#### Description
This wraps the ObjectARX AcDbTextEditorStack::maxStackScale() method.
```text
public static double MaxStackScale;
```

### MinStackScale

#### Description
This wraps the ObjectARX AcDbTextEditorStack::minStackScale() method.
```text
public static double MinStackScale;
```

### Scale

#### Description
Gets and sets the stack scale factor.
This wraps the ObjectARX AcDbTextEditorStack::scale() and AcDbTextEditorStack::setScale() methods.
```text
public double Scale;
```

### Top

#### Description
Gets and sets the stack top string.
This wraps the ObjectARX AcDbTextEditorStack::top() and AcDbTextEditorStack::setTop() methods.
```text
public string Top;
```

### Type

#### Description
Gets and sets the stack type.
This wraps the ObjectARX AcDbTextEditorStack::type() and AcDbTextEditorStack::setType() methods.
```text
public StackType Type;
```