# Autodesk.AutoCAD.DatabaseServices.EndCap Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::EndCaps ObjectARX enum.
```text
public enum EndCap {
  None,
  Round,
  Angle,
  Square
}
```

#### Members
| Members | Description |
| --- | --- |
| None |
| Round |
| Angle |
| Square |