# LivePreviewAction Class

## Overview

#### Description
This is class Autodesk.AutoCAD.EditorInput.LivePreviewAction.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.LivePreviewActionBase
    Autodesk.AutoCAD.EditorInput.LivePreviewAction
```

```text
public sealed class LivePreviewAction : LivePreviewActionBase;
```

### Constructors

- LivePreviewAction

### Methods

- Execute

## Constructors Details

### LivePreviewAction

#### Description
This is LivePreviewAction, a member of class LivePreviewAction.
```text
public LivePreviewAction(
    Delegate method,
    params object\[\] args
);
```

### Execute

#### Description
This is Execute, a member of class LivePreviewAction.
```text
public sealed override void Execute();
```