# Autodesk.AutoCAD.DatabaseServices.CellOption Enumeration

## Overview

#### Description
This .NET class wraps the CellOption ObjectARX enum.
For internal use only.
```text
public enum CellOption {
  None,
  InheritCellFormat
}
```

#### Members
| Members | Description |
| --- | --- |
| None | No option |
| InheritCellFormat | Field should inherit the cell format |