# NormalConstraint Class

## Overview

#### Description
This class represents a Normal constraint node in the owning Assoc2dConstraintGroup.
Currently it can only be applied between a line and circle(or arc).
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.NormalConstraint
```

```text
public class NormalConstraint : GeometricalConstraint;
```

## Members

### Constructors

- NormalConstraint

## Constructors Details

### NormalConstraint

#### Description
Default constructor.
```text
public NormalConstraint();
```