# EqualRadiusConstraint Class

## Overview

#### Description
This class represents a EqualRadius constraint node in the owning Assoc2dConstraintGroup.
It can be applied between two constrained circles (arcs).
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.EqualRadiusConstraint
```

```text
public class EqualRadiusConstraint : GeometricalConstraint;
```

## Members

### Constructors

- EqualRadiusConstraint

## Constructors Details

### EqualRadiusConstraint

#### Description
Default constructor.
```text
public EqualRadiusConstraint();
```