# AssocArrayCommonParameters Class

## Overview

#### Description
AssocArrayCommonParameters wraps the ObjectARX AcDbAssocArrayCommonParameters class.
This class provides an interface for manipulating array parameters that are common to Rectangular, Path and Polar Array. Its derived classes provide specific interfaces to manipulate array parameters that are unique each array type.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.AssocArrayParameters
    Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters
        Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters
        Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters
        Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters
```

```text
public abstract class AssocArrayCommonParameters : AssocArrayParameters;
```

### Methods

- GetLevelCount
- GetLevelSpacing
- GetRowCount
- GetRowElevation
- GetRowSpacing
- SetLevelCount
- SetLevelSpacing
- SetRowCount
- SetRowElevation
- SetRowSpacing

### Properties

- BaseNormal
- BasePlane
- BasePoint
- LevelCount
- LevelSpacing
- RowCount
- RowElevation
- RowSpacing

## Methods Details

### GetLevelCount

#### Description
This wraps the ObjectARX ObjectARX AcDbAssocArrayCommonParameters::levelCount() method.
```text
public int GetLevelCount(
    out string expression,
    out string evaluatorId
);
```

### GetLevelSpacing

#### Description
This wraps the ObjectARX AcDbAssocArrayCommonParameters::levelSpacing() method.
```text
public double GetLevelSpacing(
    out string expression,
    out string evaluatorId
);
```

### GetRowCount

#### Description
This wraps the ObjectARX AcDbAssocArrayCommonParameters::rowCount() method.
```text
public int GetRowCount(
    out string expression,
    out string evaluatorId
);
```

### GetRowElevation

#### Description
This wraps the ObjectARX AcDbAssocArrayCommonParameters::rowElevation() method.
```text
public double GetRowElevation(
    out string expression,
    out string evaluatorId
);
```

### GetRowSpacing

#### Description
This wraps the ObjectARX AcDbAssocArrayCommonParameters::rowSpacing() method.
```text
public double GetRowSpacing(
    out string expression,
    out string evaluatorId
);
```

### SetLevelCount

#### Description
This wraps the ObjectARX AcDbAssocArrayCommonParameters::setLevelCount() method.
```text
public void SetLevelCount(
    int count,
    string expression,
    string evaluatorId
);
```

### SetLevelSpacing

#### Description
This wraps the ObjectARX AcDbAssocArrayCommonParameters::setLevelSpacing() method.
```text
public void SetLevelSpacing(
    double spacing,
    string expression,
    string evaluatorId
);
```

### SetRowCount

#### Description
This wraps the ObjectARX AcDbAssocArrayCommonParameters::setRowCount() method.
```text
public void SetRowCount(
    int count,
    string expression,
    string evaluatorId
);
```

### SetRowElevation

#### Description
This wraps the ObjectARX AcDbAssocArrayCommonParameters::setRowElevation() method.
```text
public void SetRowElevation(
    double value,
    string expression,
    string evaluatorId
);
```

### SetRowSpacing

#### Description
This wraps the ObjectARX AcDbAssocArrayCommonParameters::setRowSpacing() method.
```text
public void SetRowSpacing(
    double spacing,
    string expression,
    string evaluatorId
);
```

### BaseNormal

#### Description
Wraps the ObjectARX AcDbAssocArrayCommonParameters::getBasePlane() and AcDbAssocArrayCommonParameters::setBasePlane() methods.
```text
public Vector3d BaseNormal;
```

#### Conditions
Read / write
### BasePlane

#### Description
Wraps the ObjectARX AcDbAssocArrayCommonParameters::getBasePlane() and AcDbAssocArrayCommonParameters::setBasePlane() methods.
```text
public FaceRef BasePlane;
```

#### Conditions
Read / write
### BasePoint

#### Description
Wraps the ObjectARX AcDbAssocArrayCommonParameters::getBasePlane() and AcDbAssocArrayCommonParameters::setBasePlane() methods.
```text
public VertexRef BasePoint;
```

#### Conditions
Read / write
### LevelCount

#### Description
Wraps the ObjectARX AcDbAssocArrayCommonParameters::levelCount() and AcDbAssocArrayCommonParameters::setLevelCount() methods.
```text
public int LevelCount;
```

#### Conditions
Read / write
### LevelSpacing

#### Description
Wraps the ObjectARX AcDbAssocArrayCommonParameters::levelSpacing() and AcDbAssocArrayCommonParameters::setLevelSpacing() methods.
```text
public double LevelSpacing;
```

#### Conditions
Read / write
### RowCount

#### Description
Wraps the ObjectARX the ObjectARX AcDbAssocArrayCommonParameters::rowCount() and AcDbAssocArrayCommonParameters::setRowCount() methodS.
```text
public int RowCount;
```

#### Conditions
Read / write
### RowElevation

#### Description
Wraps the ObjectARX AcDbAssocArrayCommonParameters::rowElevation() and AcDbAssocArrayCommonParameters::setRowElevation() methods.
```text
public double RowElevation;
```

#### Conditions
Read / write
### RowSpacing

#### Description
Wraps the ObjectARX AcDbAssocArrayCommonParameters::rowSpacing() and AcDbAssocArrayCommonParameters::setRowSpacing() methods.
```text
public double RowSpacing;
```

#### Conditions
Read / write