# Autodesk.AutoCAD.DatabaseServices.MaintenanceReleaseVersion Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::MaintenanceReleaseVersion ObjectARX enumerated type.
This is an entity containing information about the release versions.
#### Members
| Members | Description |
| --- | --- |
| Release0 = 0 | kDHL_1012 = R13c0-3, kDHL_1014 = R14c0 |
| Release1 = 1 | kDHL_1012 = R13c0-3 |
| Release2010Max = 0xff |
| Release2010Newest = 0xe2 |
| Release4 = 4 | kDHL_1012 = R13c4 |
| Release5 = 5 | kDHL_1012 = R13c4_m |
| Release6 = 6 | kDHL_1012 = R13c4a |
| ReleaseCurrent = 0x141 | Current maintenance release version |
| ReleaseExtendedCurrent = 0x173 | Maximum maintenance release version |
| ReleaseMax = 0x7fffffff | Maximum maintenance release version |
| ReleaseNewest = 0x141 | Newest maintenance release version |

Previous Declaration
```text
public enum MaintenanceReleaseVersion {
 Release0 = 0,
 Release1 = 1,
 Release10 = 10,
 Release100 = 100,
 Release101 = 0x65,
 Release102 = 0x66,
 Release103 = 0x67,
 Release104 = 0x68,
 Release105 = 0x69,
 Release106 = 0x6a,
 Release107 = 0x6b,
 Release108 = 0x6c,
 Release109 = 0x6d,
 Release11 = 11,
 Release110 = 110,
 Release111 = 0x6f,
 Release112 = 0x70,
 Release113 = 0x71,
 Release114 = 0x72,
 Release115 = 0x73,
 Release116 = 0x74,
 Release117 = 0x75,
 Release118 = 0x76,
 Release119 = 0x77,
 Release12 = 12,
 Release120 = 120,
 Release121 = 0x79,
 Release122 = 0x7a,
 Release123 = 0x7b,
 Release124 = 0x7c,
 Release125 = 0x7d,
 Release126 = 0x7e,
 Release127 = 0x7f,
 Release128 = 0x80,
 Release129 = 0x81,
 Release13 = 13,
 Release130 = 130,
 Release131 = 0x83,
 Release132 = 0x84,
 Release133 = 0x85,
 Release134 = 0x86,
 Release135 = 0x87,
 Release136 = 0x88,
 Release137 = 0x89,
 Release138 = 0x8a,
 Release139 = 0x8b,
 Release14 = 14,
 Release140 = 140,
 Release141 = 0x8d,
 Release142 = 0x8e,
 Release143 = 0x8f,
 Release144 = 0x90,
 Release145 = 0x91,
 Release146 = 0x92,
 Release147 = 0x93,
 Release148 = 0x94,
 Release149 = 0x95,
 Release15 = 15,
 Release150 = 150,
 Release151 = 0x97,
 Release152 = 0x98,
 Release153 = 0x99,
 Release154 = 0x9a,
 Release155 = 0x9b,
 Release156 = 0x9c,
 Release157 = 0x9d,
 Release158 = 0x9e,
 Release159 = 0x9f,
 Release16 = 0x10,
 Release160 = 160,
 Release17 = 0x11,
 Release18 = 0x12,
 Release19 = 0x13,
 Release2 = 2,
 Release20 = 20,
 Release2010Max = 0xff,
 Release2010Newest = 0xe2,
 Release21 = 0x15,
 Release22 = 0x16,
 Release23 = 0x17,
 Release24 = 0x18,
 Release25 = 0x19,
 Release26 = 0x1a,
 Release27 = 0x1b,
 Release28 = 0x1c,
 Release29 = 0x1d,
 Release3 = 3,
 Release30 = 30,
 Release31 = 0x1f,
 Release32 = 0x20,
 Release33 = 0x21,
 Release34 = 0x22,
 Release35 = 0x23,
 Release36 = 0x24,
 Release37 = 0x25,
 Release38 = 0x26,
 Release39 = 0x27,
 Release4 = 4,
 Release40 = 40,
 Release41 = 0x29,
 Release42 = 0x2a,
 Release43 = 0x2b,
 Release44 = 0x2c,
 Release45 = 0x2d,
 Release46 = 0x2e,
 Release47 = 0x2f,
 Release48 = 0x30,
 Release49 = 0x31,
 Release5 = 5,
 Release50 = 50,
 Release51 = 0x33,
 Release52 = 0x34,
 Release53 = 0x35,
 Release54 = 0x36,
 Release55 = 0x37,
 Release56 = 0x38,
 Release57 = 0x39,
 Release58 = 0x3a,
 Release59 = 0x3b,
 Release6 = 6,
 Release60 = 60,
 Release61 = 0x3d,
 Release62 = 0x3e,
 Release63 = 0x3f,
 Release64 = 0x40,
 Release65 = 0x41,
 Release66 = 0x42,
 Release67 = 0x43,
 Release68 = 0x44,
 Release69 = 0x45,
 Release7 = 7,
 Release70 = 70,
 Release71 = 0x47,
 Release72 = 0x48,
 Release73 = 0x49,
 Release74 = 0x4a,
 Release75 = 0x4b,
 Release76 = 0x4c,
 Release77 = 0x4d,
 Release78 = 0x4e,
 Release79 = 0x4f,
 Release8 = 8,
 Release80 = 80,
 Release81 = 0x51,
 Release82 = 0x52,
 Release83 = 0x53,
 Release84 = 0x54,
 Release85 = 0x55,
 Release86 = 0x56,
 Release87 = 0x57,
 Release88 = 0x58,
 Release89 = 0x59,
 Release9 = 9,
 Release90 = 90,
 Release91 = 0x5b,
 Release92 = 0x5c,
 Release93 = 0x5d,
 Release94 = 0x5e,
 Release95 = 0x5f,
 Release96 = 0x60,
 Release97 = 0x61,
 Release98 = 0x62,
 Release99 = 0x63,
 ReleaseCheckExtended = 0x7d,
 ReleaseCurrent = 0xf1,
 ReleaseExtendedCurrent = 0x123,
 ReleaseExtendedNewest = 1,
 ReleaseMax = 0x7fffffff,
 ReleaseNewest = 0xf1,
 ReleaseUnknown = 0x7ffffffe
}
```