# AssocVertexActionParam Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocVertexActionParam class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionParam
        Autodesk.AutoCAD.DatabaseServices.AssocVertexActionParam
```

```text
public class AssocVertexActionParam : AssocActionParam;
```

### Constructors

- AssocVertexActionParam

### Methods

- GetVertexRef
- SetVertexRef

### Properties

- DependentOnCompoundObject

## Constructors Details

### AssocVertexActionParam

#### Description
This wraps the ObjectARX AssocVertexActionParam::AcDbAssocVertexActionParam() method.
```text
public AssocVertexActionParam();
```

### GetVertexRef

#### Description
This wraps the ObjectARX AssocVertexActionParam::getVertexRef() method.
```text
public VertexRef GetVertexRef();
```

### SetVertexRef

#### Description
This wraps the ObjectARX AssocVertexActionParam::setVertexRef() method.
```text
public void SetVertexRef(
    VertexRef pointRef,
    [MarshalAs(UnmanagedType.U1)] bool isReadDep,
    [MarshalAs(UnmanagedType.U1)] bool isWriteDep
);
```

### DependentOnCompoundObject

#### Description
This wraps the ObjectARX AcDbAssocVertexActionParam::getDependentOnCompoundObject() method.
```text
public CompoundObjectId DependentOnCompoundObject;
```