# AssocPatchSurfaceActionBody Class

## Overview

#### Description
This wraps AcDbAssocPatchSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody
```

```text
public class AssocPatchSurfaceActionBody : AssocPathBasedSurfaceActionBody;
```

### Constructors

- AssocPatchSurfaceActionBody

### Methods

- [CreateInstance(ObjectId, EdgeRef[], EdgeRef[], VertexRef[], [MarshalAs(UnmanagedType.U1)] bool)](#createinstance(objectid,-edgeref[],-edgeref[],-vertexref[],-[marshalas(unmanagedtype.u1)]-bool))
- [CreateInstance(ObjectId, EdgeRef[], EdgeRef[], VertexRef[], int, double, [MarshalAs(UnmanagedType.U1)] bool)](#createinstance(objectid,-edgeref[],-edgeref[],-vertexref[],-int,-double,-[marshalas(unmanagedtype.u1)]-bool))
- GetBulge
- GetContinuity
- SetBulge
- SetConstraintCurves
- SetConstraintPoints
- SetContinuity

### Properties

- Bulge
- Continuity
- ContinuityGripPoint

## Constructors Details

### AssocPatchSurfaceActionBody

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::AcDbAssocPatchSurfaceActionBody() method.
```text
public AssocPatchSurfaceActionBody();
```

### CreateInstance(ObjectId, EdgeRef[], EdgeRef[], VertexRef[], [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    ObjectId patchSurfaceId,
    EdgeRef\[\] profileCurves,
    EdgeRef\[\] constraintCurves,
    VertexRef\[\] constraintPoints,
    [MarshalAs(UnmanagedType.U1)] bool enable
);
```

### CreateInstance(ObjectId, EdgeRef[], EdgeRef[], VertexRef[], int, double, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    ObjectId patchSurfaceId,
    EdgeRef\[\] edgeCurves,
    EdgeRef\[\] constraintCurves,
    VertexRef\[\] constraintPoints,
    int nContinuity,
    double dBulge,
    [MarshalAs(UnmanagedType.U1)] bool bEnabled
);
```

### GetBulge

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::bulge() method.
```text
public double GetBulge(
    out string expression,
    out string evaluatorId
);
```

### GetContinuity

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::continuity() method.
```text
public int GetContinuity(
    out string expression,
    out string evaluatorId
);
```

### SetBulge

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::setBulge() method.
```text
public void SetBulge(
    double value,
    string expression,
    string evaluatorId
);
```

### SetConstraintCurves

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::setConstraintCurves() method.
```text
public void SetConstraintCurves(
    EdgeRef\[\] constraintCurves
);
```

### SetConstraintPoints

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::setConstraintPoints() method.
```text
public void SetConstraintPoints(
    VertexRef\[\] constraintPoints
);
```

### SetContinuity

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::setContinuity() method.
```text
public void SetContinuity(
    int value,
    string expression,
    string evaluatorId
);
```

### Bulge

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::bulge() and AcDbAssocPatchSurfaceActionBody::setBulge() methods.
```text
public double Bulge;
```

### Continuity

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::continuity() and AcDbAssocPatchSurfaceActionBody::setContinuity ()methods.
```text
public int Continuity;
```

### ContinuityGripPoint

#### Description
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::getContinuityGripPoint() method.
```text
public Point3d ContinuityGripPoint;
```