# TextEditor Class

## Overview

#### Description
This wraps the ObjectARX AcDbTextEditor class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ITextEditorSelectable
    Autodesk.AutoCAD.DatabaseServices.TextEditor
```

```text
public class TextEditor : DisposableWrapper, ITextEditorSelectable;
```

### Methods

- ClearSelection
- Close
- CreateTextEditor
- FindTextW
- GetFont
- MakeSelection
- Redraw
- SelectAll

### Other

- AutoCAD.DatabaseServices.TextEditor.ExitStatus Enumeration
- AutoCAD.DatabaseServices.TextEditor.TextFindFlags Enumeration

### Properties

- ActualHeight
- ActualWidth
- Attachment
- AutoCAPS
- AutoListEnabled
- Columns
- Cursor
- DefaultStackAlignment
- DefaultStackScale
- DefinedHeight
- DefinedWidth
- EndOfText
- FontCount
- IsAnnotativeStyle
- NumberingEnabled
- Paragraphs
- Selection
- StackCount
- StartOfText
- Style
- StyleCount
- TabOnlyDelimiter
- TextHeight
- VerticalSHX
- VerticalTTF
- Wipeout

## Methods Details

### ClearSelection

#### Description
This wraps the ObjectARX AcDbTextEditor::clearSelection() method.
```text
public void ClearSelection();
```

### Close

#### Description
This wraps the ObjectARX AcDbTextEditor::close() method.
```text
public void Close(
    ExitStatus stat
);
```

### CreateTextEditor

#### Description
This wraps the ObjectARX AcDbTextEditor::createDbTextEditor() method.
```text
public static TextEditor CreateTextEditor(
    MText mtext
);
```

### FindTextW

#### Description
This wraps the ObjectARX AcDbTextEditor::findText() method.
```text
public void FindTextW(
    string findString,
    TextFindFlags findFlags,
    [In, Out] ref TextEditorLocation start,
    [In, Out] ref TextEditorLocation end
);
```

### GetFont

#### Description
This wraps the ObjectARX AcDbTextEditor::getFontName() and AcDbTextEditor::isTrueTypeFont() methods.
```text
public Font GetFont(
    int index
);
```

### MakeSelection

#### Description
This wraps the ObjectARX AcDbTextEditor::makeSelection() method.
```text
public void MakeSelection(
    TextEditorLocation start,
    TextEditorLocation end
);
```

### Redraw

#### Description
This wraps the ObjectARX AcDbTextEditor::redraw() method.
```text
public void Redraw();
```

### SelectAll

#### Description
This wraps the ObjectARX AcDbTextEditor::selectAll() method.
```text
public void SelectAll();
```

### AutoCAD.DatabaseServices.TextEditor.ExitStatus Enumeration

#### Description
This wraps the ObjectARX AcDbTextEditor::ExitStatus enum.
```text
public enum ExitStatus {
  ExitQuit,
  ExitSave
}
```

### AutoCAD.DatabaseServices.TextEditor.TextFindFlags Enumeration

#### Description
This wraps ObjectARX AcDbTextEditor::TextFindFlags enum.
```text
public enum TextFindFlags {
  HalfFullForm = 4,
  IgnoreAccent = 8,
  MatchCase = 1,
  UseWildcards = 0x10,
  WholeWord = 2
}
```

## Properties Details

### ActualHeight

#### Description
This wraps the ObjectARX AcDbTextEditor::actualHeight() method.
```text
public double ActualHeight;
```

### ActualWidth

#### Description
This wraps the ObjectARX AcDbTextEditor::actualWidth() method.
```text
public double ActualWidth;
```

### Attachment

#### Description
Gets and sets the attachment point for the editor.
This wraps the ObjectARX AcDbTextEditor::attachment() and AcDbTextEditor::setAttachment() methods.
```text
public Autodesk.AutoCAD.DatabaseServices.AttachmentPoint Attachment;
```

### AutoCAPS

#### Description
Gets and sets the auto CAPS flag.
This wraps the ObjectARX AcDbTextEditor::autoCAPS() and AcDbTextEditor::setAutoCAPS() methods.
```text
public bool AutoCAPS;
```

### AutoListEnabled

#### Description
This wraps the ObjectARX AcDbTextEditor::autolistEnabled() and AcDbTextEditor::setAutolistEnabled() methods.
```text
public bool AutoListEnabled;
```

### Columns

#### Description
This wraps the ObjectARX AcDbTextEditor::columns() method.
```text
public TextEditorColumns Columns;
```

### Cursor

#### Description
This wraps the ObjectARX AcDbTextEditor::cursor() method.
```text
public TextEditorCursor Cursor;
```

### DefaultStackAlignment

#### Description
Gets and sets the default stack alignment for selection object.
This wraps the ObjectARX AcDbTextEditor::defaultStackAlignment() andAcDbTextEditor::setDefaultStackAlignment() methods.
```text
public TextEditorSelectionbase.FlowAlign DefaultStackAlignment;
```

### DefaultStackScale

#### Description
Gets and sets the default stack scale factor for selection object.
This wraps the ObjectARX AcDbTextEditor::defaultStackScale() and AcDbTextEditor::setDefaultStackScale() methods.
```text
public double DefaultStackScale;
```

### DefinedHeight

#### Description
Gets and sets the defined height for the editor.
This wraps the ObjectARX AcDbTextEditor::definedHeight() and AcDbTextEditor::setDefinedHeight() methods.
```text
public double DefinedHeight;
```

### DefinedWidth

#### Description
Gets and sets the defined width for the editor.
This wraps the ObjectARX AcDbTextEditor::definedWidth() and AcDbTextEditor::setDefinedWidth() methods.
```text
public double DefinedWidth;
```

### EndOfText

#### Description
This wraps the ObjectARX AcDbTextEditor::endOfText() method.
```text
public virtual TextEditorLocation EndOfText;
```

### FontCount

#### Description
This wraps the ObjectARX AcDbTextEditor::getFontCount() method.
```text
public int FontCount;
```

### IsAnnotativeStyle

#### Description
Indicates whether the current text editor style is annotative.
```text
public bool IsAnnotativeStyle;
```

#### Conditions
Read-only
### NumberingEnabled

#### Description
Gets and sets the flag to enable all the paragraphs numbering.
This wraps the ObjectARX AcDbTextEditor::numberingEnabled() and AcDbTextEditor::setEnableNumbering() methods.
```text
public bool NumberingEnabled;
```

### Paragraphs

#### Description
Gets the TextEditorParagraph array of TextEditor.
```text
public TextEditorParagraph Paragraphs;
```

#### Conditions
Read-only
### Selection

#### Description
This wraps the ObjectARX AcDbTextEditor::selection() method.
```text
public TextEditorSelection Selection;
```

### StackCount

#### Description
This wraps the ObjectARX AcDbTextEditor::stackCount() method.
```text
public int StackCount;
```

### StartOfText

#### Description
This wraps the ObjectARX AcDbTextEditor::startOfText() method.
```text
public virtual TextEditorLocation StartOfText;
```

### Style

#### Description
Gets and sets the current text editor text style object Id.
```text
public ObjectId Style;
```

#### Conditions
Read / write
### StyleCount

#### Description
This wraps the ObjectARX AcDbTextEditor::getStyleCount() method.
```text
public int StyleCount;
```

### TabOnlyDelimiter

#### Description
This wraps the ObjectARX AcDbTextEditor::tabOnlyDelimiter() and AcDbTextEditor::setTabOnlyDelimiter() methods.
```text
public bool TabOnlyDelimiter;
```

### TextHeight

#### Description
Gets and sets the text height for the editor.
This wraps the ObjectARX AcDbTextEditor::textHeight() and AcDbTextEditor::setTextHeight() methods.
```text
public double TextHeight;
```

### VerticalSHX

#### Description
This wraps the ObjectARX AcDbTextEditor::isVerticalSHX() method.
```text
public bool VerticalSHX;
```

### VerticalTTF

#### Description
This wraps the ObjectARX AcDbTextEditor::isVerticalTTF() method.
```text
public bool VerticalTTF;
```

### Wipeout

#### Description
This wraps the ObjectARX AcDbTextEditor::wipeout() method.
```text
public TextEditorWipeout Wipeout;
```