# Autodesk.AutoCAD.DatabaseServices.ImageQuality Enumeration

## Overview

#### Description
This .NET class wraps the AcDbRasterVariables::ImageQuality ObjectARX enum.
```text
public enum ImageQuality {
  Draft = 0,
  High = 1,
  Invalid = -1
}
```

#### Members
| Members | Description |
| --- | --- |
| Draft = 0 |
| High = 1 |
| Invalid = -1 |