# Autodesk.AutoCAD.DatabaseServices.OrthographicView Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::OrthographicView ObjectARX enum.
```text
public enum OrthographicView {
  NonOrthoView,
  TopView,
  BottomView,
  FrontView,
  BackView,
  LeftView,
  RightView
}
```

#### Members
| Members | Description |
| --- | --- |
| NonOrthoView | Specifies that the view is non-orthographic relative to the UCS |
| TopView | Specifies that the view is a top view relative to the UCS |
| BottomView | Specifies that the view is a bottom view relative to the UCS |
| FrontView | Specifies that the view is a front view relative to the UCS |
| BackView | Specifies that the view is a back view relative to the UCS |
| LeftView | Specifies that the view is a left view relative to the UCS |
| RightView | Specifies that the view is a right view relative to the UCS |