# Autodesk.AutoCAD.DatabaseServices.LeaderType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbMLeaderStyle::LeaderType ObjectARX enum.
This enum describes the types of the type of leaderline.
```text
public enum LeaderType {
  InVisibleLeader,
  StraightLeader,
  SplineLeader
}
```

#### Members
| Members | Description |
| --- | --- |
| InVisibleLeader | Invisible leader |
| StraightLeader | Straight line leader |
| SplineLeader | Spline line leader |