# PromptPointResultEventArgs Class

## Overview

#### Description
This class provides data for the PromptedForPoint event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptPointResultEventArgs
```

```text
public sealed class PromptPointResultEventArgs : EventArgs;
```

### Properties

- Result

## Properties Details

### Result

#### Description
Gets the result of the selection.
```text
public PromptPointResult Result;
```

#### Conditions
Read-only