# GeoCoordinateCategory Class

## Overview

#### Description
This is class Autodesk.AutoCAD.DatabaseServices.GeoCoordinateCategory.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.GeoCoordinateCategory
```

```text
public class GeoCoordinateCategory : DisposableWrapper;
```

### Methods

- CreateAll
- GetCoordinateAt
- NumOfCoordinate

### Properties

- ID

## Methods Details

### CreateAll

#### Description
This is CreateAll, a member of class GeoCoordinateCategory.
```text
public static GeoCoordinateCategory\[\] CreateAll();
```

### GetCoordinateAt

#### Description
This is GetCoordinateAt, a member of class GeoCoordinateCategory.
```text
public GeoCoordinateSystem GetCoordinateAt(
    int index
);
```

### NumOfCoordinate

#### Description
This is NumOfCoordinate, a member of class GeoCoordinateCategory.
```text
public int NumOfCoordinate();
```

### ID

#### Description
This is ID, a member of class GeoCoordinateCategory.
```text
public string ID;
```