# TextEditorSelection Class

## Overview

#### Description
This wraps the ObjectARX AcDbTextEditorSelection class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.TextEditorSelectionbase
    Autodesk.AutoCAD.DatabaseServices.TextEditorSelection
```

```text
public class TextEditorSelection : TextEditorSelectionbase;
```

### Methods

- CanSupportFont
- CanSupportLanguage
- ChangeToLowercase
- ChangeToUppercase
- CombineParagraphs
- ConvertToPlainText
- RemoveAllFormatting
- RemoveCharacterFormatting
- RemoveParagraphFormatting
- Stack
- UnStack
- UpdateField

### Properties

- CanChangeCase
- CanStack
- CanUnStack
- FieldObject
- Paragraphs
- SelectionString
- SingleFieldSelected
- SingleStackSelected
- StackSettings

## Methods Details

### CanSupportFont

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::fontSupported() method.
```text
public bool CanSupportFont(
    Font font
);
```

### CanSupportLanguage

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::languageSupported() method.
```text
public bool CanSupportLanguage(
    int charset
);
```

### ChangeToLowercase

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::changeToLowercase() method.
```text
public bool ChangeToLowercase();
```

### ChangeToUppercase

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::changeToUppercase() method.
```text
public bool ChangeToUppercase();
```

### CombineParagraphs

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::combineParagraphs() method.
```text
public void CombineParagraphs();
```

### ConvertToPlainText

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::convertToPlainText() method.
```text
public void ConvertToPlainText();
```

### RemoveAllFormatting

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::removeAllFormatting() method.
```text
public void RemoveAllFormatting();
```

### RemoveCharacterFormatting

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::removeCharacterFormatting() method.
```text
public void RemoveCharacterFormatting();
```

### RemoveParagraphFormatting

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::removeParagraphFormatting() method.
```text
public void RemoveParagraphFormatting();
```

### Stack

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::stack() method.
```text
public void Stack();
```

### UnStack

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::unStack() method.
```text
public void UnStack();
```

### UpdateField

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::updateField() method.
```text
public void UpdateField();
```

### CanChangeCase

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::canChangeCase() method.
```text
public bool CanChangeCase;
```

### CanStack

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::canStack() method.
```text
public bool CanStack;
```

### CanUnStack

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::canUnStack() method.
```text
public bool CanUnStack;
```

### FieldObject

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::field() method.
```text
public Field FieldObject;
```

### Paragraphs

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::paragraph() method.
```text
public TextEditorParagraph Paragraphs;
```

### SelectionString

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::getSelectionText() method.
```text
public string SelectionString;
```

### SingleFieldSelected

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::singleFieldSelected() method.
```text
public bool SingleFieldSelected;
```

### SingleStackSelected

#### Description
This wraps the ObjectARX AcDbTextEditorSelection::singleStackSelected() method.
```text
public bool SingleStackSelected;
```

### StackSettings

#### Description
Gets and sets the selected stack object.
This wraps the ObjectARX AcDbTextEditorSelection::getStack() and AcDbTextEditorSelection::setStack() methods.
After you get the StackSettings from current selection and change the properties, you should save the StackSettings back to selection. Otherwise there is no effect for your changes.
```text
public TextEditorStack StackSettings;
```