# AssocArrayRectangularParameters Class

## Overview

#### Description
AssocArrayRectangularParameters wraps the ObjectARX AcDbAssocArrayRectangularParameters class.
This class provides an interface for manipulating rectangular array parameters.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.AssocArrayParameters
    Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters
        Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters
```

```text
public class AssocArrayRectangularParameters : AssocArrayCommonParameters;
```

### Constructors

- AssocArrayRectangularParameters()
- AssocArrayRectangularParameters(double, double, double, int, int, int, double, double)

### Methods

- GetAxesAngle
- GetColumnCount
- GetColumnSpacing
- SetAxesAngle
- SetColumnCount
- SetColumnSpacing

### Properties

- AxesAngle
- ColumnCount
- ColumnSpacing
- XAxisDirection
- YAxisDirection

## Constructors Details

### AssocArrayRectangularParameters()

#### Description
Default constructor.
Wraps the default AcDbAssocArrayRectangularParameters constructor, with all default values.
```text
public AssocArrayRectangularParameters();
```

### AssocArrayRectangularParameters(double, double, double, int, int, int, double, double)

#### Description
Parameterized constructor. The _axesAngle_ and _rotation_ parameters are in degrees.
```text
public AssocArrayRectangularParameters(
    double columnSpacing,
    double rowSpacing,
    double levelSpacing,
    int columnCount,
    int rowCount,
    int levelCount,
    double rowElevation,
    double axesAngle
);
```

### GetAxesAngle

#### Description
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::axesAngle() method.
The angle is measured in degrees.
```text
public double GetAxesAngle(
    out string expression,
    out string evaluatorId
);
```

### GetColumnCount

#### Description
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::columnCount() method.
```text
public int GetColumnCount(
    out string expression,
    out string evaluatorId
);
```

### GetColumnSpacing

#### Description
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::columnSpacing() method.
```text
public double GetColumnSpacing(
    out string expression,
    out string evaluatorId
);
```

### SetAxesAngle

#### Description
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::setAxesAngle() method.
The axesAngle being set is measured in degrees.
```text
public void SetAxesAngle(
    double val,
    string expression,
    string evaluatorId
);
```

### SetColumnCount

#### Description
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::setColumnCount() method.
```text
public void SetColumnCount(
    int count,
    string expression,
    string evaluatorId
);
```

### SetColumnSpacing

#### Description
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::setColumnSpacing() method.
```text
public void SetColumnSpacing(
    double spacing,
    string expression,
    string evaluatorId
);
```

### AxesAngle

#### Description
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::axesAngle() and AcDbAssocArrayRectangularParameters::setAxesAngle() methods.
The axesAngle being set is measured in degrees.
```text
public double AxesAngle;
```

#### Conditions
Read / write
### ColumnCount

#### Description
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::columnCount() and AcDbAssocArrayRectangularParameters::setColumnCount() methods.
```text
public int ColumnCount;
```

#### Conditions
Read / write
### ColumnSpacing

#### Description
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::columnSpacing() and AcDbAssocArrayRectangularParameters::setColumnSpacing() methods.
```text
public double ColumnSpacing;
```

#### Conditions
Read / write
### XAxisDirection

#### Description
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::axisDirection() and AcDbAssocArrayRectangularParameters::setAxisDirection() methods.
```text
public Vector3d XAxisDirection;
```

#### Conditions
Read / write
### YAxisDirection

#### Description
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::axisDirection() and AcDbAssocArrayRectangularParameters::setAxisDirection() methods.
This property updates the axes angle between the x axis and y axis. It is not allowed that the x axis and y axis are parallel. Moreover, if the normal vector of the plane formed by the x axis and y axis changes, the normal will also be updated.
```text
public Vector3d YAxisDirection;
```

#### Conditions
Read / write