# Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks Enumeration

## Overview

#### Description
This .NET class wraps the CellEdgeMasks ObjectARX enum.
These values specify the cell edge of a table cell.
```text
public enum CellEdgeMasks {
  BottomMask = 4,
  LeftMask = 8,
  RightMask = 2,
  TopMask = 1
}
```

#### Members
| Members | Description |
| --- | --- |
| BottomMask = 4 | Indicates the bottom-edge index of the cell. |
| LeftMask = 8 | Indicates the left-edge index of the cell. |
| RightMask = 2 | Indicates the right-edge index of the cell. |
| TopMask = 1 | Indicates the top-edge index of the cell. |