# OsnapOverrule Class

## Overview

#### Description
This .NET class wraps the ObjectARX class AcDbOsnapOverrule.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.OsnapOverrule
```

```text
public abstract class OsnapOverrule : Overrule;
```

### Methods

- GetObjectSnapPoints(Entity, ObjectSnapModes, IntPtr, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
- GetObjectSnapPoints(Entity, ObjectSnapModes, IntPtr, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
- SetCustomFilter
- SetExtensionDictionaryEntryFilter
- SetIdFilter
- SetNoFilter
- SetXDataFilter

## Methods Details

### GetObjectSnapPoints(Entity, ObjectSnapModes, IntPtr, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)

#### Description
This .NET method wraps the ObjectARX method:
AcDbOsnapOverrule::getOsnapPoints (AcDbEntity*, AcDb::OsnapMode, Adesk::GsMarker, AcGePoint3d&, AcGePoint3d&, AcGeMatrix3d&, AcGePoint3dArray&, AcDbIntArray &).
```text
public virtual void GetObjectSnapPoints(
    Entity entity,
    ObjectSnapModes snapMode,
    IntPtr gsSelectionMark,
    Point3d pickPoint,
    Point3d lastPoint,
    Matrix3d viewTransform,
    Point3dCollection snapPoints,
    IntegerCollection geometryIds
);
```

### GetObjectSnapPoints(Entity, ObjectSnapModes, IntPtr, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)

#### Description
This .NET method wraps the ObjectARX method:
AcDbOsnapOverrule::getOsnapPoints (AcDbEntity*, AcDb::OsnapMode, Adesk::GsMarker, AcGePoint3d&, AcGePoint3d&, AcGeMatrix3d&, AcGePoint3dArray&, AcDbIntArray &, AcGeMatrix3d&).
```text
public virtual void GetObjectSnapPoints(
    Entity entity,
    ObjectSnapModes snapMode,
    IntPtr gsSelectionMark,
    Point3d pickPoint,
    Point3d lastPoint,
    Matrix3d viewTransform,
    Point3dCollection snapPoints,
    IntegerCollection geometryIds,
    Matrix3d insertionMat
);
```

### SetCustomFilter

#### Description
Enables the use of the IsApplicable method in determining whether an overrule applies.
```text
public sealed override void SetCustomFilter();
```

#### See Also
OsnapOverrule.SetNoFilter Method; Overrule.IsApplicable Method

### SetExtensionDictionaryEntryFilter

#### Description
Enables the use of extension dictionary lookups to determine whether overrules apply.
Use this method when you want AutoCAD to look for an extension dictionary entry with entryName on the overruled subject before calling any of your overrules. The overrules won't be called if entryName is not present in the extension dictionary.
```text
public sealed override void SetExtensionDictionaryEntryFilter(
    string entryName
);
```

#### Parameters
| Parameters | Description |
| --- | --- |
| string entryName | Input the name of the entry. |

#### See Also
OsnapOverrule.SetNoFilter Method

### SetIdFilter

#### Description
Enables the use of id lookups to determine whether overrules apply.
Use this method when you want AutoCAD to only call your overrule for objects with a matching id in ids.
```text
public sealed override void SetIdFilter(
    ObjectId\[\] ids
);
```

#### Parameters
| Parameters | Description |
| --- | --- |
| ObjectId[] ids | Input an array of ObjectId. |

#### See Also
OsnapOverrule.SetNoFilter Method

### SetNoFilter

#### Description
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.
```text
public sealed override void SetNoFilter();
```

#### See Also
OsnapOverrule.SetCustomFilter Method; OsnapOverrule.SetExtensionDictionaryEntryFilter Method; OsnapOverrule.SetIdFilter Method; OsnapOverrule.SetXDataFilter Method; Overrule.IsApplicable Method

### SetXDataFilter

#### Description
Enables the use of xdata in determining whether overrules apply. Use this method when you want AutoCAD to look for xdata with registeredApplicationName on the overruled subject before calling any of your overrules.
```text
public sealed override void SetXDataFilter(
    string registeredApplicationName
);
```

#### Parameters
| Parameters | Description |
| --- | --- |
| string registeredApplicationName | Input the name of the registered application. |

#### See Also
OsnapOverrule.SetNoFilter Method