# VertexRef Class

## Overview

#### Description
This wraps the ObjectARX AcDbVertexRef class
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.GeomRef
    Autodesk.AutoCAD.DatabaseServices.SubentRef
        Autodesk.AutoCAD.DatabaseServices.VertexRef
```

```text
public class VertexRef : SubentRef;
```

### Constructors

- VertexRef()
- VertexRef(CompoundObjectId)
- VertexRef(CompoundObjectId, SubentityId)
- VertexRef(CompoundObjectId, SubentityId, Point3d)
- VertexRef(Entity)
- VertexRef(FullSubentityPath)
- VertexRef(Point3d)

### Properties

- Point

## Constructors Details

### VertexRef()

#### Description
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef() method
```text
public VertexRef();
```

### VertexRef(CompoundObjectId)

#### Description
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef() method.
```text
public VertexRef(
    CompoundObjectId compoundObjectId
);
```

### VertexRef(CompoundObjectId, SubentityId)

#### Description
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef() method.
```text
public VertexRef(
    CompoundObjectId compoundObjectId,
    SubentityId subentId
);
```

### VertexRef(CompoundObjectId, SubentityId, Point3d)

#### Description
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef() method.
```text
public VertexRef(
    CompoundObjectId compoundObjectId,
    SubentityId subentId,
    Point3d point
);
```

### VertexRef(Entity)

#### Description
This wraps the ObjectARX AcDbVertexRef::VertexRef() method
```text
public VertexRef(
    Entity entity
);
```

### VertexRef(FullSubentityPath)

#### Description
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef() method
```text
public VertexRef(
    FullSubentityPath path
);
```

### VertexRef(Point3d)

#### Description
This wraps the ObjectARX AcDbVertexRef::AcDbVertexRef(const AcGePoint3d *pGePoint) method
```text
public VertexRef(
    Point3d point
);
```

### Point

#### Description
This wraps the ObjectARX AcDbVertexRef::point() method
```text
public Point3d Point;
```