# PointCurveConstraint Class

## Overview

#### Description
This class represents a PointCurve (coincident) constraint node in the owning Assoc2dConstraintGroup.
It can be applied between a constrained point and a constrained curve.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.PointCurveConstraint
```

```text
public class PointCurveConstraint : GeometricalConstraint;
```

## Members

### Constructors

- PointCurveConstraint

## Constructors Details

### PointCurveConstraint

#### Description
Default constructor.
```text
public PointCurveConstraint();
```