# TextEditorColumn Class

## Overview

#### Description
This wraps the ObjectARX AcDbTextEditorColumn class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ITextEditorSelectable
    Autodesk.AutoCAD.DatabaseServices.TextEditorColumn
```

```text
public class TextEditorColumn : DisposableWrapper, ITextEditorSelectable;
```

### Properties

- EndOfText
- Height
- StartOfText

## Properties Details

### EndOfText

#### Description
This wraps the ObjectARX AcDbTextEditorColumn::endOfText() method.
```text
public virtual TextEditorLocation EndOfText;
```

### Height

#### Description
Gets and sets the height of the column object.
This wraps the ObjectARX AcDbTextEditorColumn::height() and AcDbTextEditorColumn::setHeight() methods.
```text
public double Height;
```

### StartOfText

#### Description
This wraps the ObjectARX AcDbTextEditorColumn::startOfText() method.
```text
public virtual TextEditorLocation StartOfText;
```