# Autodesk.AutoCAD.DatabaseServices.PointCloudProperty Enumeration

## Overview

#### Description
Defines the properties of point cloud data.
```text
public enum PointCloudProperty {
  Classification = 3,
  Color = 1,
  Intensity = 2,
  Normal = 4
}
```

#### Members
| Members | Description |
| --- | --- |
| Classification = 3 | The classification property. |
| Color = 1 | The color property. |
| Intensity = 2 | The intensity property. |
| Normal = 4 | The normal property. |