# Autodesk.AutoCAD.DatabaseServices.DragStatus Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::DragStat ObjectARX enum.
It provides status values concerning a drag operation.
```text
public enum DragStatus {
  DragStart,
  DragEnd,
  DragAbort
}
```

#### Members
| Members | Description |
| --- | --- |
| DragStart | A drag operation has just started |
| DragEnd | A drag operation has just ended |
| DragAbort | A drag operation has just aborted |