# Autodesk.AutoCAD.DatabaseServices.DetailSymbolBoundaryType Enumeration

## Overview

#### Description
An enum defining the type of the detail symbol boundary.
```text
public enum DetailSymbolBoundaryType {
  CircularBoundary,
  RectangularBoundary,
  CustomBoundary
}
```

#### Members
| Members | Description |
| --- | --- |
| CircularBoundary | enum |
| RectangularBoundary | enum |
| CustomBoundary | enum |

#### See Also
AcDbDetailSymbol::BoundaryType