# AssocNetworkSurfaceActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody
```

```text
public class AssocNetworkSurfaceActionBody : AssocPathBasedSurfaceActionBody;
```

### Constructors

- AssocNetworkSurfaceActionBody

### Methods

- CreateInstance
- GetBulge(AssocLoftedSurfaceActionBody.ProfileType)
- GetBulge(AssocLoftedSurfaceActionBody.ProfileType, out string, out string)
- GetContinuity(AssocLoftedSurfaceActionBody.ProfileType)
- GetContinuity(AssocLoftedSurfaceActionBody.ProfileType, out string, out string)
- SetBulge(AssocLoftedSurfaceActionBody.ProfileType, double)
- SetBulge(AssocLoftedSurfaceActionBody.ProfileType, double, string, string)
- SetContinuity(AssocLoftedSurfaceActionBody.ProfileType, int)
- SetContinuity(AssocLoftedSurfaceActionBody.ProfileType, int, string, string)

## Constructors Details

### AssocNetworkSurfaceActionBody

#### Description
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::AcDbAssocNetworkSurfaceActionBody() method.
```text
public AssocNetworkSurfaceActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    ObjectId resultingSurfaceId,
    PathRef\[\] crossSections,
    PathRef\[\] guideCurves,
    int\[\] continuityArray,
    double\[\] bulgeArray,
    [MarshalAs(UnmanagedType.U1)] bool bEnable
);
```

### GetBulge(AssocLoftedSurfaceActionBody.ProfileType)

#### Description
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::getBulge() method.
```text
public double GetBulge(
    AssocLoftedSurfaceActionBody.ProfileType type
);
```

### GetBulge(AssocLoftedSurfaceActionBody.ProfileType, out string, out string)

#### Description
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::getBulge() method.
```text
public double GetBulge(
    AssocLoftedSurfaceActionBody.ProfileType type,
    out string expression,
    out string evaluatorId
);
```

### GetContinuity(AssocLoftedSurfaceActionBody.ProfileType)

#### Description
This wraps the ObjectARXAcDbAssocNetworkSurfaceActionBody::getContinuity() method.
```text
public int GetContinuity(
    AssocLoftedSurfaceActionBody.ProfileType type
);
```

### GetContinuity(AssocLoftedSurfaceActionBody.ProfileType, out string, out string)

#### Description
This wraps the ObjectARXAcDbAssocNetworkSurfaceActionBody::getContinuity() method.
```text
public int GetContinuity(
    AssocLoftedSurfaceActionBody.ProfileType type,
    out string expression,
    out string evaluatorId
);
```

### SetBulge(AssocLoftedSurfaceActionBody.ProfileType, double)

#### Description
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::setBulge() method.
```text
public void SetBulge(
    AssocLoftedSurfaceActionBody.ProfileType type,
    double value
);
```

### SetBulge(AssocLoftedSurfaceActionBody.ProfileType, double, string, string)

#### Description
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::setBulge() method.
```text
public void SetBulge(
    AssocLoftedSurfaceActionBody.ProfileType type,
    double value,
    string expression,
    string evaluatorId
);
```

### SetContinuity(AssocLoftedSurfaceActionBody.ProfileType, int)

#### Description
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::setContinuity() method.
```text
public void SetContinuity(
    AssocLoftedSurfaceActionBody.ProfileType type,
    int value
);
```

### SetContinuity(AssocLoftedSurfaceActionBody.ProfileType, int, string, string)

#### Description
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::setContinuity() method.
```text
public void SetContinuity(
    AssocLoftedSurfaceActionBody.ProfileType type,
    int value,
    string expression,
    string evaluatorId
);
```