# Autodesk.AutoCAD.DatabaseServices.TextHorizontalMode Enumeration

## Overview

#### Description
This .NET enum wraps the AcDb::TextHorzMode ObjectARX enum. This enum gives the horizontal mode of the text.
```text
public enum TextHorizontalMode {
  TextLeft,
  TextCenter,
  TextRight,
  TextAlign,
  TextMid,
  TextFit
}
```

#### Members
| Members | Description |
| --- | --- |
| TextLeft | TH_LEFT |
| TextCenter | TH_CENT |
| TextRight | TH_RIGHT |
| TextAlign | THV_ALIGN |
| TextMid | THV_MID |
| TextFit | THV_FIT |