# DgnReference Class

## Overview

#### Description
This .NET class wraps the AcDbDgnReference ObjectARX class.
Represents DGN underlays in the drawing. Underlays are similar to raster images but their content is snappable.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.Entity
        Autodesk.AutoCAD.DatabaseServices.UnderlayReference
            Autodesk.AutoCAD.DatabaseServices.DgnReference
```

```text
public class DgnReference : UnderlayReference;
```

## Members

### Constructors

- DgnReference

## Constructors Details

### DgnReference

#### Description
Default constructor.
```text
public DgnReference();
```