# TextEditorParagraph Class

## Overview

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ITextEditorSelectable
    Autodesk.AutoCAD.DatabaseServices.TextEditorParagraph
```

```text
public class TextEditorParagraph : DisposableWrapper, ITextEditorSelectable;
```

### Methods

- AddTab
- ContinueNumbering
- GetTab
- RemoveTab
- RestartNumbering

### Other

- AutoCAD.DatabaseServices.TextEditorParagraph.AlignmentType Enumeration
- AutoCAD.DatabaseServices.TextEditorParagraph.LineSpacingStyle Enumeration
- AutoCAD.DatabaseServices.TextEditorParagraph.NumberingType Enumeration

### Properties

- Alignment
- EndOfText
- FirstIndent
- LeftIndent
- LineSpaceFactor
- LineSpaceStyle
- MaxLineSpacingFactor
- MaxSpacingValue
- MinLineSpacingFactor
- MinSpacingValue
- ParaNumberingType
- RightIndent
- SpaceAfter
- SpaceBefore
- StartOfText
- TabsCount

## Methods Details

### AddTab

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::addTab() method.
```text
public void AddTab(
    TextEditorParagraphTab tab
);
```

### ContinueNumbering

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::continueNumbering() method.
```text
public void ContinueNumbering();
```

### GetTab

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::getTab() method.
```text
public TextEditorParagraphTab GetTab(
    int idx
);
```

### RemoveTab

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::removeTab() method.
```text
public void RemoveTab(
    TextEditorParagraphTab tab
);
```

### RestartNumbering

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::restartNumbering() method.
```text
public void RestartNumbering();
```

### AutoCAD.DatabaseServices.TextEditorParagraph.AlignmentType Enumeration

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::AlignmentType enum.
```text
public enum AlignmentType {
  AlignmentDefault,
  AlignmentLeft,
  AlignmentCenter,
  AlignmentRight,
  AlignmentJustify,
  AlignmentDistribute
}
```

### AutoCAD.DatabaseServices.TextEditorParagraph.LineSpacingStyle Enumeration

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::LineSpacingStyle enum.
```text
public enum LineSpacingStyle {
  LineSpacingDefault,
  LineSpacingExactly,
  LineSpacingAtLeast,
  LineSpacingMultiple
}
```

### AutoCAD.DatabaseServices.TextEditorParagraph.NumberingType Enumeration

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::NumberingType enum.
```text
public enum NumberingType {
  Off,
  Bullet,
  Number,
  LetterLower,
  LetterUpper,
  NumberWide,
  LetterLowerWide,
  LetterUpperWide
}
```

## Properties Details

### Alignment

#### Description
Gets and sets the alignment type for the paragraph.
This wraps the ObjectARX AcDbTextEditorParagraph::alignment() and AcDbTextEditorParagraph::setAlignment() methods.
```text
public AlignmentType Alignment;
```

### EndOfText

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::endOfText() method.
```text
public virtual TextEditorLocation EndOfText;
```

### FirstIndent

#### Description
Gets and sets the first indent value for the paragraph.
This wraps the ObjectARX AcDbTextEditorParagraph::firstIndent() and AcDbTextEditorParagraph::setFirstIndent() methods.
```text
public double FirstIndent;
```

### LeftIndent

#### Description
Gets and sets the left indent value for the paragraph.
This wraps the ObjectARX AcDbTextEditorParagraph::leftIndent() and AcDbTextEditorParagraph::setLeftIndent() methods.
```text
public double LeftIndent;
```

### LineSpaceFactor

#### Description
Gets and sets the line space factor for the paragraph.
This wraps the ObjectARX AcDbTextEditorParagraph::lineSpacingFactor() and AcDbTextEditorParagraph::setLineSpacingFactor() methods.
```text
public double LineSpaceFactor;
```

### LineSpaceStyle

#### Description
Gets and sets the line space style for the paragraph.
This wraps the ObjectARX AcDbTextEditorParagraph::lineSpacingStyle() and AcDbTextEditorParagraph::setLineSpacingStyle() methods.
```text
public LineSpacingStyle LineSpaceStyle;
```

### MaxLineSpacingFactor

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::maxLineSpacingFactor() method.
```text
public double MaxLineSpacingFactor;
```

### MaxSpacingValue

#### Description
Maximum allowable after/before space value.
```text
public double MaxSpacingValue;
```

#### Returns
Returns maximum allowable after/before space value.
#### Conditions
Read only
### MinLineSpacingFactor

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::minLineSpacingFactor() method.
```text
public double MinLineSpacingFactor;
```

### MinSpacingValue

#### Description
Minimum allowable after/before space value.
```text
public double MinSpacingValue;
```

#### Returns
Returns minimum allowable after/before space value.
#### Conditions
Read only
### ParaNumberingType

#### Description
Gets and sets the numbering type for the paragraph.
This wraps the ObjectARX AcDbTextEditorParagraph::numberingType() and AcDbTextEditorParagraph::setNumberingType() methods.
```text
public NumberingType ParaNumberingType;
```

### RightIndent

#### Description
Gets and sets the right indent value for the paragraph.
This wraps the ObjectARX AcDbTextEditorParagraph::rightIndent() and AcDbTextEditorParagraph::setRightIndent() methods.
```text
public double RightIndent;
```

### SpaceAfter

#### Description
Gets and sets the after space for the paragraph.
This wraps the ObjectARX AcDbTextEditorParagraph::spaceAfter() and AcDbTextEditorParagraph::setSpaceAfter() methods.
```text
public double SpaceAfter;
```

### SpaceBefore

#### Description
Gets and sets the before space for the paragraph.
This wraps the ObjectARXAcDbTextEditorParagraph::spaceBefore() and AcDbTextEditorParagraph::setSpaceBefore() methods.
```text
public double SpaceBefore;
```

### StartOfText

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::startOfText() method.
```text
public virtual TextEditorLocation StartOfText;
```

### TabsCount

#### Description
This wraps the ObjectARX AcDbTextEditorParagraph::tabsCount() method.
```text
public int TabsCount;
```