# TangentConstraint Class

## Overview

#### Description
This class represents a Tangent constraint node in the owning Assoc2dConstraintGroup.
It can be applied between two constrained curve.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.TangentConstraint
```

```text
public class TangentConstraint : GeometricalConstraint;
```

## Members

### Constructors

- TangentConstraint

## Constructors Details

### TangentConstraint

#### Description
Default constructor.
```text
public TangentConstraint();
```