# LongTransaction Class

## Overview

#### Description
This wraps the ObjectARX AcDbLongTransaction class
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.LongTransaction
```

```text
public sealed class LongTransaction : DBObject;
```

### Constructors

- LongTransaction

### Methods

- AddToWorkSet
- OriginObject
- RegenWorkSetWithDrawOrder
- RemoveFromWorkSet
- SyncWorkSet
- WorkSetHas

### Properties

- ActiveIdMap
- DestinationBlock
- DisallowDrawOrder
- LongTransactionName
- OriginBlock
- Type

## Constructors Details

### LongTransaction

#### Description
Constructor.
```text
public LongTransaction(
    IntPtr unmanagedPointer,
    [MarshalAs(UnmanagedType.U1)] bool autoDelete
);
```

### AddToWorkSet

#### Description
This wraps the ObjectARX AcDbLongTransaction::addToWorkSet() method.
```text
public void AddToWorkSet(
    ObjectId id
);
```

### OriginObject

#### Description
This wraps the ObjectARX AcDbLongTransaction::originObject() method.
```text
public ObjectId OriginObject(
    ObjectId id
);
```

### RegenWorkSetWithDrawOrder

#### Description
This wraps the ObjectARX AcDbLongTransaction::regenWorkSetWithDrawOrder() method.
```text
public void RegenWorkSetWithDrawOrder();
```

### RemoveFromWorkSet

#### Description
This wraps the ObjectARX AcDbLongTransaction::removeFromWorkSet() method.
```text
public void RemoveFromWorkSet(
    ObjectId id
);
```

### SyncWorkSet

#### Description
This wraps the ObjectARX AcDbLongTransaction::syncWorkSet() method.
```text
public void SyncWorkSet();
```

### WorkSetHas

#### Description
This wraps the ObjectARX AcDbLongTransaction::workSetHas() method.
```text
public bool WorkSetHas(
    ObjectId id,
    [MarshalAs(UnmanagedType.U1)] bool includeErased
);
```

### ActiveIdMap

#### Description
This wraps the ObjectARX AcDbLongTransaction::activeIdMap() method.
```text
public IdMapping ActiveIdMap;
```

### DestinationBlock

#### Description
This wraps the ObjectARX AcDbLongTransaction::destinationBlock() method.
```text
public ObjectId DestinationBlock;
```

### DisallowDrawOrder

#### Description
This wraps the ObjectARX AcDbLongTransaction::disallowDrawOrder() method.
```text
public bool DisallowDrawOrder;
```

### LongTransactionName

#### Description
This wraps the ObjectARX AcDbLongTransaction::getLongTransactionName() method.
```text
public string LongTransactionName;
```

### OriginBlock

#### Description
This wraps the ObjectARX AcDbLongTransaction::originBlock() method.
```text
public ObjectId OriginBlock;
```

### Type

#### Description
This wraps the ObjectARX AcDbLongTransaction::type() method.
```text
public LongTransactionType Type;
```