# EdgeRef Class

## Overview

#### Description
This wraps the ObjectARX AcDbEdgeRef class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.GeomRef
    Autodesk.AutoCAD.DatabaseServices.SubentRef
        Autodesk.AutoCAD.DatabaseServices.EdgeRef
```

```text
public class EdgeRef : SubentRef;
```

### Constructors

- EdgeRef()
- EdgeRef(CompoundObjectId)
- EdgeRef(CompoundObjectId, SubentityId)
- EdgeRef(CompoundObjectId, SubentityId, SubentityId)
- EdgeRef(CompoundObjectId, SubentityId, SubentityId, Curve3d)
- EdgeRef(Curve3d)
- EdgeRef(Entity)
- EdgeRef(FullSubentityPath)
- [EdgeRef(IntPtr, [MarshalAs(UnmanagedType.U1)] bool)](#edgeref(intptr,-[marshalas(unmanagedtype.u1)]-bool))

### Properties

- Curve
- FaceSubentity

## Constructors Details

### EdgeRef()

#### Description
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef method
```text
public EdgeRef();
```

### EdgeRef(CompoundObjectId)

#### Description
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method.
```text
public EdgeRef(
    CompoundObjectId compoundObjectId
);
```

### EdgeRef(CompoundObjectId, SubentityId)

#### Description
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method.
```text
public EdgeRef(
    CompoundObjectId compoundObjectId,
    SubentityId edgeSubentId
);
```

### EdgeRef(CompoundObjectId, SubentityId, SubentityId)

#### Description
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method.
```text
public EdgeRef(
    CompoundObjectId compoundObjectId,
    SubentityId edgeSubentId,
    SubentityId faceSubentId
);
```

### EdgeRef(CompoundObjectId, SubentityId, SubentityId, Curve3d)

#### Description
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method.
```text
public EdgeRef(
    CompoundObjectId compoundObjectId,
    SubentityId edgeSubentId,
    SubentityId faceSubentId,
    Curve3d curve
);
```

### EdgeRef(Curve3d)

#### Description
This wraps the ObjectARXAcDbEdgeRef::AcDbEdgeRef() method
```text
public EdgeRef(
    Curve3d curve
);
```

### EdgeRef(Entity)

#### Description
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method
```text
public EdgeRef(
    Entity entity
);
```

### EdgeRef(FullSubentityPath)

#### Description
This wraps the ObjectARX AcDbEdgeRef::AcDbEdgeRef() method
```text
public EdgeRef(
    FullSubentityPath path
);
```

### EdgeRef(IntPtr, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
EdgeRef
```text
protected internal EdgeRef(
    IntPtr unmanagedObjPtr,
    [MarshalAs(UnmanagedType.U1)] bool autoDelete
);
```

### Curve

#### Description
This wraps the ObjectARX AcDbEdgeRef::curve() method
```text
public Curve3d Curve;
```

### FaceSubentity

#### Description
This wraps the ObjectARX AcDbEdgeRef::faceSubentId() and AcDbEdgeRef::setFaceSubentity() methods.
```text
public SubentityId FaceSubentity;
```