# Autodesk.AutoCAD.DatabaseServices.FrameSetting Enumeration

## Overview

#### Description
This .NET class wraps the AcDbRasterVariables::FrameSettings ObjectARX class.
```text
public enum FrameSetting {
  ImageFrameAbove = 1,
  ImageFrameBelow = 2,
  ImageFrameInvalid = -1,
  ImageFrameOff = 0,
  ImageFrameOnNoPlot = 3
}
```

#### Members
| Members | Description |
| --- | --- |
| ImageFrameAbove = 1 | Frame drawn above image |
| ImageFrameBelow = 2 | Frame drawn below/behind image |
| ImageFrameInvalid = -1 |
| ImageFrameOff = 0 | No frame drawn around image |
| ImageFrameOnNoPlot = 3 |