# Autodesk.AutoCAD.DatabaseServices.ModelDocViewLabelAttachmentPoint Enumeration

## Overview

#### Description
The type of attachment for the model documentation view label text.
```text
public enum ModelDocViewLabelAttachmentPoint {
  AboveView,
  BelowView
}
```

#### Members
| Members | Description |
| --- | --- |
| AboveView | The view label text is to be attached above the model documentation view.enum |
| BelowView | The view label text is to be attached below the model documentation view.enum |