# Autodesk.AutoCAD.DatabaseServices.OpenMode Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::OpenMode ObjectARX enum.
This enumerated type provides the mode values used to specify how a database resident object is to be opened.
```text
public enum OpenMode {
  ForRead,
  ForWrite,
  ForNotify
}
```

#### Members

| Members | Description |
| --- | --- |
| ForRead |
| ForWrite |
| ForNotify |