# Autodesk.AutoCAD.DatabaseServices.FieldFilingOptions Enumeration

## Overview

#### Description
This .NET enum wraps the AcDbField::FilingOption ObjectARX enum. This value specifies the filing option set by the field evaluators.
```text
public enum FieldFilingOptions {
  SkipFilingResult = 1
}
```

#### Members

| Members | Description |
| --- | --- |
| SkipFilingResult = 1 | Do not file out the cached evaluation result with the field. |