# FieldEvaluationResult Structure

## Overview

#### Description
This is class Autodesk.AutoCAD.DatabaseServices.FieldEvaluationResult.
```text
public struct FieldEvaluationResult {
}
```

### Properties

- Evaluated
- Found

## Properties Details

### Evaluated

#### Description
This is Evaluated, a member of class FieldEvaluationResult.
```text
public int Evaluated;
```

### Found

#### Description
This is Found, a member of class FieldEvaluationResult.
```text
public int Found;
```