# LoftProfile Class

## Overview

#### Description
This wraps the ObjectARX AcDbLoftProfile class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.Profile3d
    Autodesk.AutoCAD.DatabaseServices.LoftProfile
```

```text
public class LoftProfile : Profile3d;
```

### Constructors

- LoftProfile()
- LoftProfile(Entity)
- LoftProfile(LoftProfile)
- LoftProfile(PathRef)
- LoftProfile(Point3d)

### Methods

- CopyFrom(LoftProfile)
- CopyFrom(Profile3d)

### Properties

- Continuity
- Magnitude

## Constructors Details

### LoftProfile()

#### Description
This wraps the ObjectARX AcDbLoftProfile::AcDbLoftProfile () method.
```text
public LoftProfile();
```

### LoftProfile(Entity)

#### Description
This wraps the ObjectARX AcDbLoftProfile::AcDbLoftProfile () method.
```text
public LoftProfile(
    Entity entity
);
```

### LoftProfile(LoftProfile)

#### Description
This wraps the ObjectARX AcDbLoftProfile::AcDbLoftProfile () method.
```text
public LoftProfile(
    LoftProfile LoftProfile
);
```

### LoftProfile(PathRef)

#### Description
This wraps the ObjectARX AcDbLoftProfile::AcDbLoftProfile ( const AcDbPathRef&amp; pathRef) method.
```text
public LoftProfile(
    PathRef pathRef
);
```

### LoftProfile(Point3d)

#### Description
This wraps the ObjectARXAcDbLoftProfile::AcDbLoftProfile () method.
```text
public LoftProfile(
    Point3d pnt
);
```

### CopyFrom(LoftProfile)

#### Description
This wraps the ObjectARX AcDbLoftProfile::operator = () method.
```text
public void CopyFrom(
    LoftProfile source
);
```

### CopyFrom(Profile3d)

#### Description
This wraps the ObjectARX AcDbLoftProfile::operator = () method.
```text
public void CopyFrom(
    Profile3d source
);
```

### Continuity

#### Description
This wraps the ObjectARX AcDbLoftProfile::continuity() and AcDbLoftProfile::setContinuity() methods.
```text
public short Continuity;
```

### Magnitude

#### Description
This wraps the ObjectARX AcDbLoftProfile::magnitude() and AcDbLoftProfile::setMagnitude() methods.
```text
public double Magnitude;
```