# Autodesk.AutoCAD.DatabaseServices.UnitType Enumeration

## Overview

#### Description
This .NET class wraps the AcValue::UnitType ObjectARX class.
```text
public enum UnitType {
  Angle = 2,
  AngleNotTransformed = 0x10000,
  Area = 4,
  Currency = 0x10,
  Distance = 1,
  Percentage = 0x20,
  Unitless = 0,
  Volume = 8
}
```

#### Members

| Members | Description |
| --- | --- |
| Angle = 2 | Number specifies angle. |
| AngleNotTransformed = 0x10000 | Angle is not transformed |
| Area = 4 | Number specifies area. |
| Currency = 0x10 | Number specifies currency. |
| Distance = 1 | Number specifies distance. |
| Percentage = 0x20 | Number specifies percentage. |
| Unitless = 0 | Unitless number. |
| Volume = 8 | Number specifies volume. |