# Autodesk.AutoCAD.DatabaseServices.RotationAngle Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::RotationAngle ObjectARX enum.
It specifies the text rotation angle within table cells.
```text
public enum RotationAngle {
  Degrees000 = 0,
  Degrees090 = 1,
  Degrees180 = 2,
  Degrees270 = 3,
  DegreesUnknown = -1
}
```

#### Members

| Members | Description |
| --- | --- |
| Degrees000 = 0 | 0 degree rotation. |
| Degrees090 = 1 | 90 degree rotation. |
| Degrees180 = 2 | 180 degree rotation. |
| Degrees270 = 3 | 270 degree rotation. |
| DegreesUnknown = -1 | Unknown rotation angle |