# Autodesk.AutoCAD.DatabaseServices.ModelDocViewLabelAlignmentType Enumeration

## Overview

#### Description
The type of alignment for the section view label text.
```text
public enum ModelDocViewLabelAlignmentType {
  AlignmentLeft,
  AlignmentCenter,
  AlignmentRight
}
```

#### Members

| Members | Description |
| --- | --- |
| AlignmentLeft | Left justification for the view label text.enum |
| AlignmentCenter | Center justification for the view label text.enum |
| AlignmentRight | Right justification for the view label text.enum |