# Autodesk.AutoCAD.DatabaseServices.LeaderDirectionType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbMLeaderStyle::LeaderDirectionType ObjectARX enum.
This enum is the leader direction type.
```text
public enum LeaderDirectionType {
  UnknownLeader,
  LeftLeader,
  RightLeader,
  TopLeader,
  BottomLeader
}
```

#### Members

| Members | Description |
| --- | --- |
| UnknownLeader | Unknown direction leader |
| LeftLeader | Left leader |
| RightLeader | Right leader |