# Autodesk.AutoCAD.EditorInput.CursorType Enumeration

## Overview

#### Description
This .NET class wraps the AcEdJig::CursorType ObjectARX enum. It gives the type of cursor that are available.
```text
public enum CursorType {
  Crosshair = 0,
  CrosshairNoRotate = 6,
  EntitySelect = 8,
  EntitySelectNoPerspective = 10,
  Invisible = 7,
  NoSpecialCursor = -1,
  NotRotated = 3,
  Parallelogram = 9,
  PickfirstOrGrips = 11,
  RectangularCursor = 1,
  RotatedCrosshair = 5,
  RubberBand = 2,
  TargetBox = 4
}
```

#### Members

| Members | Description |
| --- | --- |
| Crosshair = 0 | Cross hair type cursor. |
| CrosshairNoRotate = 6 | Cross hair type cursor with no rotation. |
| EntitySelect = 8 | Entity Select type cursor. |
| EntitySelectNoPerspective = 10 | Entity Select without perspective type cursor. |
| Invisible = 7 | Invisible type cursor. |
| NoSpecialCursor = -1 | No special type cursor. |
| NotRotated = 3 | Not rotated type cursor. |
| Parallelogram = 9 | Parallelogram type cursor. |
| PickfirstOrGrips = 11 | Pick first or grips type cursor. |
| RectangularCursor = 1 | Rectangular type cursor. |
| RotatedCrosshair = 5 | Rotated crosshair type cursor. |
| RubberBand = 2 | Rubber band type cursor. |
| TargetBox = 4 | Target box type cursor. |