# Autodesk.AutoCAD.DatabaseServices.PolyMeshType Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::PolyMeshType ObjectARX enum.
```text
public enum PolyMeshType {
  BezierSurfaceMesh = 8,
  CubicSurfaceMesh = 6,
  QuadSurfaceMesh = 5,
  SimpleMesh = 0
}
```

#### Members

| Members | Description |
| --- | --- |
| BezierSurfaceMesh = 8 |
| CubicSurfaceMesh = 6 |
| QuadSurfaceMesh = 5 |
| SimpleMesh = 0 |