# Autodesk.AutoCAD.DatabaseServices.GraphicsMetafileType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbProxyEntity::GraphicsMetafileType ObjectARX enum.
```text
public enum GraphicsMetafileType {
  NoMetafile,
  BoundingBox,
  FullGraphics
}
```

#### Members

| Members | Description |
| --- | --- |
| NoMetafile |
| BoundingBox |
| FullGraphics |