# XrefPreXrefLockFileEventArgs Class

## Overview

#### Description
This class provides data for the XrefPreXrefLockFile event.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.XrefPreXrefLockFileEventArgs
```

```text
public sealed class XrefPreXrefLockFileEventArgs : EventArgs;
```

### Properties

- btrId

## Properties Details

### btrId

#### Description
Returns the btrId property value.
```text
public ObjectId btrId;
```

#### Conditions
Read-only