# Autodesk.AutoCAD.EditorInput.SamplerStatus Enumeration

## Overview

#### Description
This enumeration represents the outcome of a sampling prompt.
```text
public enum SamplerStatus {
  OK,
  NoChange,
  Cancel
}
```

#### Members

| Members | Description |
| --- | --- |
| OK | Updated or changes accepted. |
| NoChange | No change in sampler status. |
| Cancel | Cancel the operation. |