# AssocEdgeChamferActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody
```

```text
public class AssocEdgeChamferActionBody : AssocPathBasedSurfaceActionBody;
```

### Constructors

- AssocEdgeChamferActionBody

### Methods

- CreateInstance
- GetBaseDistance
- GetOtherDistance
- SetBaseDistance
- SetOtherDistance

### Properties

- BaseDistance
- OtherDistance

## Constructors Details

### AssocEdgeChamferActionBody

#### Description
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::AcDbAssocEdgeChamferActionBody() method.
```text
public AssocEdgeChamferActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    FullSubentityPath\[\] chamferEdges,
    SubentityId modopt(IsConst) baseFace,
    double baseDistance,
    double otherDistance,
    [MarshalAs(UnmanagedType.U1)] bool enable
);
```

### GetBaseDistance

#### Description
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::baseDistance() method.
```text
public double GetBaseDistance(
    out string expression,
    out string evaluatorId
);
```

### GetOtherDistance

#### Description
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::otherDistance() method.
```text
public double GetOtherDistance(
    out string expression,
    out string evaluatorId
);
```

### SetBaseDistance

#### Description
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::setBaseDistance() method.
```text
public void SetBaseDistance(
    double distance,
    string expression,
    string evaluatorId
);
```

### SetOtherDistance

#### Description
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::setOtherDistance() method.
```text
public void SetOtherDistance(
    double distance,
    string expression,
    string evaluatorId
);
```

### BaseDistance

#### Description
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::baseDistance() and AcDbAssocEdgeChamferActionBody::setBaseDistance() methods.
```text
public double BaseDistance;
```

### OtherDistance

#### Description
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::otherDistance and AcDbAssocEdgeChamferActionBody::setOtherDistance() methods.
```text
public double OtherDistance;
```