# Autodesk.AutoCAD.DatabaseServices.CellProperties Enumeration

## Overview

#### Description
This .NET class wraps the CellProperty ObjectARX enum.
These values specify the cell properties.
```text
public enum CellProperties {
  Alignment = 0x10,
  AutoScale = 0x100,
  BackgroundColor = 0x200,
  ContentColor = 0x20,
  ContentLayout = 0x4000,
  DataFormat = 2,
  DataType = 1,
  FlowDirBtoT = 0x10000,
  Invalid = 0,
  MarginBottom = 0x2000,
  MarginHorzSpacing = 0x20000,
  MarginLeft = 0x400,
  MarginRight = 0x1000,
  MarginTop = 0x800,
  MarginVertSpacing = 0x40000,
  MergeAll = 0x8000,
  Rotation = 4,
  Scale = 8,
  TextHeight = 0x80,
  TextStyle = 0x40
}
```

#### Members

| Members | Description |
| --- | --- |
| Alignment = 0x10 | Alignment |
| AutoScale = 0x100 | Auto scale |
| BackgroundColor = 0x200 | Cell background color |
| ContentColor = 0x20 | Color |
| ContentLayout = 0x4000 | Content layout |
| DataFormat = 2 | Data format |
| DataType = 1 | Data type |
| FlowDirBtoT = 0x10000 | Table flow direction |
| Invalid = 0 | Invalid property |
| MarginBottom = 0x2000 | Bottom margin |
| MarginHorzSpacing = 0x20000 | Horizontal spacing margin |
| MarginLeft = 0x400 | Left margin |
| MarginRight = 0x1000 | Right margin |
| MarginTop = 0x800 | Top margin |
| MarginVertSpacing = 0x40000 | Vertical spacing margin |
| MergeAll = 0x8000 | Merge all cells flag |
| Rotation = 4 | Rotation |
| Scale = 8 | Scale |
| TextHeight = 0x80 | Text height |
| TextStyle = 0x40 | Text style |