# GripOverrule Class

## Overview

#### Description
This .NET class wraps the ObjectARX class AcDbGripOverrule.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.GripOverrule
```

```text
public abstract class GripOverrule : Overrule;
```

### Methods

- GetGripPoints(Entity, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
- GetGripPoints(Entity, Point3dCollection, IntegerCollection, IntegerCollection)
- GetStretchPoints
- MoveGripPointsAt(Entity, GripDataCollection, Vector3d, MoveGripPointsFlags)
- MoveGripPointsAt(Entity, IntegerCollection, Vector3d)
- MoveStretchPointsAt
- OnGripStatusChanged
- SetCustomFilter
- SetExtensionDictionaryEntryFilter
- SetIdFilter
- SetNoFilter
- SetXDataFilter

## Methods Details

### GetGripPoints(Entity, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)

#### Description
This .NET method wraps the ObjectARX method:
AcDbGripOverrule::getGripPoints (AcDbEntity*, AcDbGripDataPtrArray&, double, int, AcGeVector3d&, int).
```text
public virtual void GetGripPoints(
    Entity entity,
    GripDataCollection grips,
    double curViewUnitSize,
    int gripSize,
    Vector3d curViewDir,
    GetGripPointsFlags bitFlags
);
```

### GetGripPoints(Entity, Point3dCollection, IntegerCollection, IntegerCollection)

#### Description
This .NET method wraps the ObjectARX method:
AcDbGripOverrule::getGripPoints (AcDbEntity*, AcGePoint3dArray&, AcDbIntArray &, AcDbIntArray &).
```text
public virtual void GetGripPoints(
    Entity entity,
    Point3dCollection gripPoints,
    IntegerCollection snapModes,
    IntegerCollection geometryIds
);
```

### GetStretchPoints

#### Description
This .NET method wraps the ObjectARX method AcDbGripOverrule::getStretchPoints().
```text
public virtual void GetStretchPoints(
    Entity entity,
    Point3dCollection stretchPoints
);
```

### MoveGripPointsAt(Entity, GripDataCollection, Vector3d, MoveGripPointsFlags)

#### Description
This .NET method wraps the ObjectARX method:
AcDbGripOverrule::moveGripPointsAt (AcDbEntity*, AcDbVoidPtrArray&, AcGeVector3d&, int).
```text
public virtual void MoveGripPointsAt(
    Entity entity,
    GripDataCollection grips,
    Vector3d offset,
    MoveGripPointsFlags bitFlags
);
```

### MoveGripPointsAt(Entity, IntegerCollection, Vector3d)

#### Description
This .NET method wraps the ObjectARX method:
AcDbGripOverrule::moveGripPointsAt (AcDbEntity*, AcDbIntArray &, AcGeVector3d&).
```text
public virtual void MoveGripPointsAt(
    Entity entity,
    IntegerCollection indices,
    Vector3d offset
);
```

### MoveStretchPointsAt

#### Description
This .NET method wraps the ObjectARX method AcDbGripOverrule::moveStretchPointsAt().
```text
public virtual void MoveStretchPointsAt(
    Entity entity,
    IntegerCollection indices,
    Vector3d offset
);
```

### OnGripStatusChanged

#### Description
This .NET method wraps the ObjectARX method AcDbGripOverrule::gripStatus().
```text
public virtual void OnGripStatusChanged(
    Entity entity,
    GripStatus status
);
```

### SetCustomFilter

#### Description
Enables the use of the IsApplicable method in determining whether an overrule applies.
```text
public sealed override void SetCustomFilter();
```

#### See Also
GripOverrule.SetNoFilter Method; Overrule.IsApplicable Method

### SetExtensionDictionaryEntryFilter

#### Description
Enables the use of extension dictionary lookups to determine whether overrules apply.
Use this method when you want AutoCAD to look for an extension dictionary entry with entryName on the overruled subject before calling any of your overrules. The overrules won't be called if entryName is not present in the extension dictionary.
```text
public sealed override void SetExtensionDictionaryEntryFilter(
    string entryName
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| string entryName | Input the name of the entry. |

#### See Also
GripOverrule.SetNoFilter Method

### SetIdFilter

#### Description
Enables the use of id lookups to determine whether overrules apply.
Use this method when you want AutoCAD to only call your overrule for objects with a matching id in ids.
```text
public sealed override void SetIdFilter(
    ObjectId\[\] ids
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| ObjectId[] ids | Input an array of ObjectId. |

#### See Also
GripOverrule.SetNoFilter Method

### SetNoFilter

#### Description
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.
```text
public sealed override void SetNoFilter();
```

#### See Also
GripOverrule.SetCustomFilter Method; GripOverrule.SetExtensionDictionaryEntryFilter Method; GripOverrule.SetIdFilter Method; GripOverrule.SetXDataFilter Method; Overrule.IsApplicable Method

### SetXDataFilter

#### Description
Enables the use of xdata in determining whether overrules apply. Use this method when you want AutoCAD to look for xdata with registeredApplicationName on the overruled subject before calling any of your overrules.
```text
public sealed override void SetXDataFilter(
    string registeredApplicationName
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| string registeredApplicationName | Input the name of the registered application. |