# Autodesk.AutoCAD.DatabaseServices.AssocConstraintType Enumeration

## Overview

#### Description
This enum describes dimensional constraint type.
```text
public enum AssocConstraintType {
  NoneAssocConstraintType,
  DistanceAssocConstraintType,
  HorizontalDistanceAssocConstraintType,
  VerticalDistanceAssocConstraintType,
  Angle0AssocConstraintType,
  Angle1AssocConstraintType,
  Angle2AssocConstraintType,
  Angle3AssocConstraintType,
  RadiusAssocConstraintType,
  DiameterAssocConstraintType
}
```

#### Members

| Members | Description |
| --- | --- |
| NoneAssocConstraintType | None Associate Constraint |
| DistanceAssocConstraintType | Distance Associate Constraint |
| HorizontalDistanceAssocConstraintType | Horizontal Distance Associate Constraint |
| VerticalDistanceAssocConstraintType | Vertical Distance Associate Constraint |
| Angle0AssocConstraintType | AngularConstraint.ParallelAntiClockwise Associate Constraint |
| Angle1AssocConstraintType | AngularConstraint.AntiParallelClockwise Associate Constraint |
| Angle2AssocConstraintType | AngularConstraint.ParallelClockwise Associate Constraint |
| Angle3AssocConstraintType | AngularConstraint.AntiParallelAntiClockwise Associate Constraint |
| RadiusAssocConstraintType | Radius Associate Constraint |
| DiameterAssocConstraintType | Diameter Associate Constraint |