# SolidBackground Class

## Overview

#### Description
This .NET class wraps the AcDbSolidBackground ObjectARX class. This class represents a solid background.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.Background
        Autodesk.AutoCAD.DatabaseServices.SolidBackground
```

```text
public class SolidBackground : Background;
```

### Constructors

- SolidBackground

### Properties

- Color

## Constructors Details

### SolidBackground

#### Description
Constructor.
```text
public SolidBackground();
```

### Color

#### Description
Access the solid.
```text
public EntityColor Color;
```

#### Conditions
Read / Write