# Autodesk.AutoCAD.DatabaseServices.Intersect Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::Intersect ObjectARX class.
```text
public enum Intersect {
  OnBothOperands,
  ExtendThis,
  ExtendArgument,
  ExtendBoth
}
```

#### Members

| Members | Description |
| --- | --- |
| OnBothOperands |
| ExtendThis |
| ExtendArgument |
| ExtendBoth |