# Autodesk.AutoCAD.DatabaseServices.RigidSetTypeInfo Enumeration

## Overview

#### Description
Rigid set type.
```text
public enum RigidSetTypeInfo {
  NotRigidSet,
  ScalableRigidSet,
  NonScalableRigidSet
}
```

#### Members

| Members | Description |
| --- | --- |
| NotRigidSet | Not a rigid set. |
| ScalableRigidSet | A rigid set that can be uniformly scaled. |
| NonScalableRigidSet | A rigid set that cannot be scaled. |