# Autodesk.AutoCAD.DatabaseServices.DataLinkOption Enumeration

## Overview

#### Description
This .NET class wraps the DataLinkOption ObjectARX class.
It provides options for data links.
```text
public enum DataLinkOption {
  None,
  Anonymous,
  PersistCache
}
```

#### Members

| Members | Description |
| --- | --- |
| None | There are no options for the data link. |
| Anonymous | Data link is anonymous and shouldn't be displayed in data link manager. |
| PersistCache | Data link has a persist cache. |