# Autodesk.AutoCAD.DatabaseServices.AngleConstraint Enumeration

## Overview

#### Description
This .NET enum wraps the AcDbMLeaderStyle::SegmentAngleType ObjectARX enum.
This is an enum of the segment angle types.
```text
public enum AngleConstraint {
  Degrees015 = 1,
  Degrees030 = 2,
  Degrees045 = 3,
  Degrees060 = 4,
  Degrees090 = 6,
  DegreesAny = 0,
  DegreesHorz = 12
}
```

#### Members

| Members | Description |
| --- | --- |
| Degrees015 = 1 | 15 degrees |
| Degrees030 = 2 | 30 degrees |
| Degrees045 = 3 | 45 degrees |
| Degrees060 = 4 | 60 degrees |
| Degrees090 = 6 | 90 degrees |
| DegreesAny = 0 | Any degrees |
| DegreesHorz = 12 | 180 degrees |