# Autodesk.AutoCAD.DatabaseServices.SecurityAlgorithm Enumeration

## Overview

#### Description
This enumeration lists the available security algorithms for use in AutoCAD drawings.
```text
public enum SecurityAlgorithm {
  RC4 = 0x6801
}
```

#### Members

| Members | Description |
| --- | --- |
| RC4 = 0x6801 | SECURITYPARAMS_ALGID_RC4 |