# TransformOverrule Class

## Overview

#### Description
This .NET class wraps the ObjectARX class AcDbTransformOverrule.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.TransformOverrule
```

```text
public abstract class TransformOverrule : Overrule;
```

### Methods

- CloneMeForDragging
- Explode
- GetTransformedCopy
- HideMeForDragging
- SetCustomFilter
- SetExtensionDictionaryEntryFilter
- SetIdFilter
- SetNoFilter
- SetXDataFilter
- TransformBy

## Methods Details

### CloneMeForDragging

#### Description
This .NET method wraps the ObjectARX method AcDbTransformOverrule::cloneMeForDragging().
```text
public virtual bool CloneMeForDragging(
    Entity entity
);
```

### Explode

#### Description
This .NET method wraps the ObjectARX method AcDbTransformOverrule::explode().
```text
public virtual void Explode(
    Entity entity,
    DBObjectCollection entitySet
);
```

### GetTransformedCopy

#### Description
This .NET method wraps the ObjectARX method AcDbTransformOverrule::getTransformedCopy().
```text
public virtual Entity GetTransformedCopy(
    Entity entity,
    Matrix3d transform
);
```

### HideMeForDragging

#### Description
This .NET method wraps the ObjectARX method AcDbTransformOverrule::hideMeForDragging().
```text
public virtual bool HideMeForDragging(
    Entity entity
);
```

### SetCustomFilter

#### Description
Enables the use of the IsApplicable method in determining whether an overrule applies.
```text
public sealed override void SetCustomFilter();
```

#### See Also
TransformOverrule.SetNoFilter Method; Overrule.IsApplicable Method

### SetExtensionDictionaryEntryFilter

#### Description
Enables the use of extension dictionary lookups to determine whether overrules apply.
Use this method when you want AutoCAD to look for an extension dictionary entry with entryName on the overruled subject before calling any of your overrules. The overrules won't be called if entryName is not present in the extension dictionary.
```text
public sealed override void SetExtensionDictionaryEntryFilter(
    string entryName
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| string entryName | Input the name of the entry. |

#### See Also
TransformOverrule.SetNoFilter Method

### SetIdFilter

#### Description
Enables the use of id lookups to determine whether overrules apply.
Use this method when you want AutoCAD to only call your overrule for objects with a matching id in ids.
```text
public sealed override void SetIdFilter(
    ObjectId\[\] ids
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| ObjectId[] ids | Input an array of ObjectId. |

#### See Also
TransformOverrule.SetNoFilter Method

### SetNoFilter

#### Description
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.
```text
public sealed override void SetNoFilter();
```

#### See Also
TransformOverrule.SetCustomFilter Method; TransformOverrule.SetExtensionDictionaryEntryFilter Method; TransformOverrule.SetIdFilter Method; TransformOverrule.SetXDataFilter Method; Overrule.IsApplicable Method

### SetXDataFilter

#### Description
Enables the use of xdata in determining whether overrules apply. Use this method when you want AutoCAD to look for xdata with registeredApplicationName on the overruled subject before calling any of your overrules.
```text
public sealed override void SetXDataFilter(
    string registeredApplicationName
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| string registeredApplicationName | Input the name of the registered application. |

#### See Also
TransformOverrule.SetNoFilter Method

### TransformBy

#### Description
This .NET method wraps the ObjectARX method AcDbTransformOverrule::transformBy().
```text
public virtual void TransformBy(
    Entity entity,
    Matrix3d transform
);
```