# Autodesk.AutoCAD.DatabaseServices.TableStyleFlags Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::TableStyleFlags ObjectARX class.
For internal use only.
```text
public enum TableStyleFlags {
  HorizontalInsideLineFirst = 1,
  HorizontalInsideLineSecond = 2,
  HorizontalInsideLineThird = 4,
  TableStyleModified = 8
}
```

#### Members
| Members | Description |
| --- | --- |
| HorizontalInsideLineFirst = 1 | Indicates the horizontal bottom grid line of the title row is on top of the draw order |
| HorizontalInsideLineSecond = 2 | Indicates the horizontal bottom grid line of the header row is on top of the draw order |
| HorizontalInsideLineThird = 4 | Indicates the horizontal bottom grid line of the subheader row is on top of the draw order |
| TableStyleModified = 8 | Indicates the horizontal bottom grid line of the subheader row is on top of the draw order |