# LivePreviewContextParameter Class

## Overview

#### Description
This is class Autodesk.AutoCAD.EditorInput.LivePreviewContextParameter.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.LivePreviewContextParameter
```

```text
public sealed class LivePreviewContextParameter;
```

### Properties

- LivePreview
- Type
- Value

## Properties Details

### LivePreview

#### Description
This is LivePreview, a member of class LivePreviewContextParameter.
```text
public Autodesk.AutoCAD.EditorInput.LivePreview LivePreview;
```

### Type

#### Description
This is Type, a member of class LivePreviewContextParameter.
```text
public LivePreviewContextType Type;
```

### Value

#### Description
This is Value, a member of class LivePreviewContextParameter.
```text
public object Value;
```