# Autodesk.AutoCAD.DatabaseServices.GradientPatternType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbHatch::GradientPatternType ObjectARX enum.
Values in this enum indicate the source of the gradient pattern.
```text
public enum GradientPatternType {
  PreDefinedGradient,
  UserDefinedGradient
}
```

#### Members
| Members | Description |
| --- | --- |
| PreDefinedGradient | Indicates that the gradient name refers to one of the predefined gradient patterns |
| UserDefinedGradient | Indicates that the gradient name refers to one of the user-defined gradient patterns. |