# AssocLoftedSurfaceActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody
```

```text
public class AssocLoftedSurfaceActionBody : AssocPathBasedSurfaceActionBody;
```

### Constructors

- AssocLoftedSurfaceActionBody

### Methods

- CreateInstance
- GetBulge(ProfileType)
- GetBulge(ProfileType, out string, out string)
- GetContinuity(ProfileType)
- GetContinuity(ProfileType, out string, out string)
- SetBulge(ProfileType, double)
- SetBulge(ProfileType, double, string, string)
- SetContinuity(ProfileType, int)
- SetContinuity(ProfileType, int, string, string)

### Other

- AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType Enumeration

## Constructors Details

### AssocLoftedSurfaceActionBody

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::AcDbAssocLoftedSurfaceActionBody() method.
```text
public AssocLoftedSurfaceActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    ObjectId resultingSurfaceId,
    SubentRef\[\] crossSections,
    PathRef\[\] guideCurves,
    PathRef pathCurve,
    LoftOptions loftOptions,
    int\[\] continuityArray,
    double\[\] bulgeArray,
    [MarshalAs(UnmanagedType.U1)] bool bEnable
);
```

### GetBulge(ProfileType)

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::getBulge() method.
```text
public double GetBulge(
    ProfileType type
);
```

### GetBulge(ProfileType, out string, out string)

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::getBulge() method.
```text
public double GetBulge(
    ProfileType type,
    out string expression,
    out string evaluatorId
);
```

### GetContinuity(ProfileType)

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::getContinuity() method.
```text
public int GetContinuity(
    ProfileType type
);
```

### GetContinuity(ProfileType, out string, out string)

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::getContinuity() method.
```text
public int GetContinuity(
    ProfileType type,
    out string expression,
    out string evaluatorId
);
```

### SetBulge(ProfileType, double)

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::setBulge() method.
```text
public void SetBulge(
    ProfileType type,
    double value
);
```

### SetBulge(ProfileType, double, string, string)

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::setBulge() method.
```text
public void SetBulge(
    ProfileType type,
    double value,
    string expression,
    string evaluatorId
);
```

### SetContinuity(ProfileType, int)

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::setContinuity() method.
```text
public void SetContinuity(
    ProfileType type,
    int value
);
```

### SetContinuity(ProfileType, int, string, string)

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::setContinuity() method.
```text
public void SetContinuity(
    ProfileType type,
    int value,
    string expression,
    string evaluatorId
);
```

### AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType Enumeration

#### Description
This wraps the ObjectARX AcDbAssocLoftedSurfaceActionBody::ProfileType enum.
```text
public enum ProfileType {
  EndCrossSection = 2,
  EndGuide = 8,
  StartCrossSection = 1,
  StartGuide = 4
}
```