# Autodesk.AutoCAD.DatabaseServices.MeasurementValue Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::MeasurementValue ObjectARX class.
```text
public enum MeasurementValue {
  English,
  Metric
}
```

#### Members

| Members | Description |
| --- | --- |
| English |
| Metric |