# BeginInsertEventArgs Class

## Overview

#### Description
This class provides data for the BeginInsert event of the database.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.BeginInsertEventArgs
```

```text
public sealed class BeginInsertEventArgs : EventArgs;
```

### Properties

- From

## Properties Details

### From

#### Description
Gets the database being inserted.
```text
public Database From;
```

#### Conditions
Read-only