# PointCoincidenceConstraint Class

## Overview

#### Description
This class represents a PointCoincidence (coincident) constraint node in the owning Assoc2dConstraintGroup.
It can be applied between two constrained point.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.PointCoincidenceConstraint
```

```text
public class PointCoincidenceConstraint : GeometricalConstraint;
```

## Members

### Constructors

- PointCoincidenceConstraint

## Constructors Details

### PointCoincidenceConstraint

#### Description
Default constructor.
```text
public PointCoincidenceConstraint();
```