# Autodesk.AutoCAD.DatabaseServices.TableBreakFlowDirection Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::TableBreakFlowDirection ObjectARX class. It gives the table breaking flow direction options.
```text
public enum TableBreakFlowDirection {
  DownOrUp = 2,
  Left = 4,
  Right = 1
}
```

#### Members

| Members | Description |
| --- | --- |
| DownOrUp = 2 | Break tables in top to bottom (for top to bottom flow table) or bottom to top (for bottom to top flow table) directions. |
| Left = 4 | Break tables in right to left direction. |
| Right = 1 | Break tables in left to right direction. |