# ParallelConstraint Class

## Overview

#### Description
This class represents a Parallel constraint node in the owning Assoc2dConstraintGroup.
It can be applied between two constrained lines.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.ParallelConstraint
            Autodesk.AutoCAD.DatabaseServices.HorizontalConstraint
            Autodesk.AutoCAD.DatabaseServices.VerticalConstraint
```

```text
public class ParallelConstraint : GeometricalConstraint;
```

## Members

### Constructors

- ParallelConstraint

## Constructors Details

### ParallelConstraint

#### Description
Default constructor.
```text
public ParallelConstraint();
```