# Autodesk.AutoCAD.DatabaseServices.BlockConnectionType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbMLeaderStyle::BlockConnectionType ObjectARX enumeration.
This enum describes the types of block connection type.
```text
public enum BlockConnectionType {
  ConnectExtents,
  ConnectBase
}
```

#### Members

| Members | Description |
| --- | --- |
| ConnectExtents | Connect to extents of block. |
| ConnectBase | Connect to block base (origin) point. |