# HighlightStateOverrule Class

## Overview

#### Description
This wraps the ObjectARX AcDbHighlightStateOverrule class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.HighlightStateOverrule
```

```text
public abstract class HighlightStateOverrule : Overrule;
```

### Methods

- HighlightState
- PopHighlight
- PushHighlight

## Methods Details

### HighlightState

#### Description
this wraps the ObjectARX AcDbHighlightStateOverrule::highlightState() method.
```text
public virtual HighlightStyle HighlightState(
    Entity entity,
    FullSubentityPath subId
);
```

### PopHighlight

#### Description
This wraps the ObjectARX AcDbHighlightStateOverrule::popHighlight( AcDbEntity* pSubject, const AcDbFullSubentPath& subId) method.
```text
public virtual void PopHighlight(
    Entity entity,
    FullSubentityPath subId
);
```

### PushHighlight

#### Description
This wraps the ObjectARX AcDbHighlightStateOverrule::pushHighlight() method.
```text
public virtual void PushHighlight(
    Entity entity,
    FullSubentityPath subId,
    HighlightStyle highlightStyle
);
```