# Autodesk.AutoCAD.DatabaseServices.TableHitTestType Enumeration

## Overview

#### Description
This enumeration lists the possible results of a Table hit test.
```text
public enum TableHitTestType {
  None,
  Cell
}
```

#### Members

| Members | Description |
| --- | --- |
| None | No test type. |
| Cell | Test type performed in the cell. |