# Autodesk.AutoCAD.DatabaseServices.DataLinkGetSourceContext Enumeration

## Overview

#### Description
Describes where the data link source is contexted.
```text
public enum DataLinkGetSourceContext {
  Etransmit = 1,
  FileWatcher = 3,
  OrignalPath = 0x100,
  Other = 4,
  Unknown = 0,
  XrefManager = 2
}
```

#### Members

| Members | Description |
| --- | --- |
| Etransmit = 1 |
| FileWatcher = 3 |
| Other = 4 |
| Unknown = 0 |
| XrefManager = 2 |