# PromptNestedEntityResultEventArgs Class

## Overview

#### Description
This class provides data for the PromptedForNestedEntity event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptNestedEntityResultEventArgs
```

```text
public sealed class PromptNestedEntityResultEventArgs : EventArgs;
```

### Properties

- Result

## Properties Details

### Result

#### Description
Gets the result of the selection.
```text
public PromptNestedEntityResult Result;
```

#### Conditions
Read-only