# Autodesk.AutoCAD.DatabaseServices.Unit Enumeration

## Overview

#### Description
This .NET class wraps the AcDbRasterImageDef::Units ObjectARX class. It gives the real-world unit representing one AutoCAD drawing unit.
```text
public enum Unit {
  None,
  Millimeter,
  Centimeter,
  Meter,
  Kilometer,
  Inch,
  Foot,
  Yard,
  Mile,
  Microinches,
  Mils,
  Angstroms,
  Nanometers,
  Microns,
  Decimeters,
  Dekameters,
  Hectometers,
  GigaMeters,
  Astronomical,
  LightYears,
  Parsecs
}
```

#### Members

| Members | Description |
| --- | --- |
| None | No unit defined. |
| Millimeter | Unit indicated in Millimeters, which equals to one thousandth of a meter. |
| Centimeter | unit indicated in Centimeter. |
| Meter | unit indicated in Meters. |
| Kilometer | Unit indicated in kilometers. |
| Inch | Unit indicated in Inches. |
| Foot | Unit indicated in feet. |
| Yard | Unit indicated in Yards, which equals to about 0.91 meters. |
| Mile | unit indicated in Miles, which equals to about 1609 Kilometers. |
| Microinches | Unit indicated in MicroInches, which equals one millionth of an inch. |
| Mils | Unit indicated in Mils, which equals to one thousandth of an inch. |
| Angstroms | Unit indicated in Angstroms, which equals to one ten billionth of a meter. |
| Nanometers | Unit indicated in Nanometers, which equals to one billionth of a meter. |
| Microns | Unit indicated in Microns, which equals to 1 millionth of a meter. |
| Decimeters | Unit indicated in Decimeters, which equals to one tenth of a meter. |
| Dekameters | Unit indicated in Dekameters, which equals to 10 meters. |
| Hectometers | Unit indicated in Hectometer, which equals 100 meters. |
| GigaMeters | Unit indicated in Gigameters, which equals 109 meters. |
| Astronomical | Unit indicated in Astronomical factor. |
| LightYears | Unit indicated in Light years, which equals to about 9.46 × 1012 kilometers. |
| Parsecs | Unit indicated in Parsecs, which equals to about 19 trillion miles. |