# Autodesk.AutoCAD.DatabaseServices.LineWeight Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::LineWeight ObjectARX enumerated type.
This enumerated type provides the line weight (thickness) values used to specify how lines will be displayed and plotted. The lineweights are in 100ths of a millimeter, except for the negative values. The negative values denote the default indicated by their constant's name.
#### Members

| Members | Description |
| --- | --- |
| ByBlock = -2 | ByBlock |
| ByDIPs = -4 | For Internal use only. |
| ByLayer = -1 | ByLayer |
| ByLineWeightDefault = -3 | Default |
| LineWeight000 = 0 | 0.00mm |
| LineWeight005 = 5 | 0.05mm |
| LineWeight009 = 9 | 0.09mm |
| LineWeight013 = 13 | 0.13mm |
| LineWeight015 = 15 | 0.15mm |
| LineWeight018 = 0x12 | 0.18mm |
| LineWeight020 = 20 | 0.20mm |
| LineWeight025 = 0x19 | 0.25mm |
| LineWeight030 = 30 | 0.03mm |
| LineWeight035 = 0x23 | 0.35mm |
| LineWeight040 = 40 | 0.40mm |
| LineWeight050 = 50 | 0.50mm |
| LineWeight053 = 0x35 | 0.53mm |
| LineWeight060 = 60 | 0.60mm |
| LineWeight070 = 70 | 0.70mm |
| LineWeight080 = 80 | 0.80mm |
| LineWeight090 = 90 | 0.90mm |
| LineWeight100 = 100 | 1.00mm |
| LineWeight106 = 0x6a | 1.06mm |
| LineWeight120 = 120 | 1.20mm |
| LineWeight140 = 140 | 1.40mm |
| LineWeight158 = 0x9e | 1.58mm |
| LineWeight200 = 200 | 2.00mm |
| LineWeight211 = 0xd3 | 2.11mm |

Previous Declaration
```text
public enum LineWeight {
ByBlock = -2,
ByLayer = -1,
ByLineWeightDefault = -3,
LineWeight000 = 0,
LineWeight005 = 5,
LineWeight009 = 9,
LineWeight013 = 13,
LineWeight015 = 15,
LineWeight018 = 0x12,
LineWeight020 = 20,
LineWeight025 = 0x19,
LineWeight030 = 30,
LineWeight035 = 0x23,
LineWeight040 = 40,
LineWeight050 = 50,
LineWeight053 = 0x35,
LineWeight060 = 60,
LineWeight070 = 70,
LineWeight080 = 80,
LineWeight090 = 90,
LineWeight100 = 100,
LineWeight106 = 0x6a,
LineWeight120 = 120,
LineWeight140 = 140,
LineWeight158 = 0x9e,
LineWeight200 = 200,
LineWeight211 = 0xd3
}
```