# AssocArrayPathParameters Class

## Overview

#### Description
AssocArrayPathParameters wraps the ObjectARX AcDbAssocArrayPathParameters class.
This class provides and interface for manipulating path array parameters.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.AssocArrayParameters
    Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters
        Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters
```

```text
public class AssocArrayPathParameters : AssocArrayCommonParameters;
```

### Constructors

- AssocArrayPathParameters()
- AssocArrayPathParameters(double, double, double, int, int, int, double)

### Methods

- GetEndOffset
- GetItemCount
- GetItemSpacing
- GetStartOffset
- SetEndOffset
- SetItemCount
- SetItemSpacing
- SetStartOffset

### Other

- AutoCAD.DatabaseServices.AssocArrayPathParameters.MethodType Enumeration

### Properties

- AlignItems
- EndOffset
- ItemCount
- ItemSpacing
- Method
- Path
- PathDirection
- StartOffset

## Constructors Details

### AssocArrayPathParameters()

#### Description
Default constructor.
Wraps the default constructor ObjectARX AcDbAssocArrayPathParameters constructor, with all default values.
```text
public AssocArrayPathParameters();
protected internal AssocArrayPathParameters(
    IntPtr unmanagedPointer,
    [MarshalAs(UnmanagedType.U1)] bool autoDelete
);
```

### AssocArrayPathParameters(double, double, double, int, int, int, double)

#### Description
Parameterized constructor.
```text
public AssocArrayPathParameters(
    double itemSpacing,
    double rowSpacing,
    double levelSpacing,
    int itemCount,
    int rowCount,
    int levelCount,
    double rowElevation
);
```

### GetEndOffset

#### Description
Wraps the ObjectARX the ObjectARX AcDbAssocArrayPathParameters::endOffset() method.
```text
public double GetEndOffset(
    out string expression,
    out string evaluatorId
);
```

### GetItemCount

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::itemCount() method.
```text
public int GetItemCount(
    out string expression,
    out string evaluatorId
);
```

### GetItemSpacing

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::itemSpacing() method.
```text
public double GetItemSpacing(
    out string expression,
    out string evaluatorId
);
```

### GetStartOffset

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::startOffset() method.
```text
public double GetStartOffset(
    out string expression,
    out string evaluatorId
);
```

### SetEndOffset

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::setEndOffset() method.
```text
public void SetEndOffset(
    double offset,
    string expression,
    string evaluatorId
);
```

### SetItemCount

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::setItemCount() method.
```text
public void SetItemCount(
    int count,
    string expression,
    string evaluatorId
);
```

### SetItemSpacing

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::setItemSpacing() method.
```text
public void SetItemSpacing(
    double spacing,
    string expression,
    string evaluatorId
);
```

### SetStartOffset

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::setStartOffset() method.
```text
public void SetStartOffset(
    double offset,
    string expression,
    string evaluatorId
);
```

### AutoCAD.DatabaseServices.AssocArrayPathParameters.MethodType Enumeration

#### Description
The method of arraying items along the path.
```text
public enum MethodType {
  Divide,
  Measure
}
```

#### Members

| Members | Description |
| --- | --- |
| Divide | Divide method arranges given number of items on entire path equidistantly. |
| Measure | Mesure method arranges given number of items at specified item spacing along the path. |

## Properties Details

### AlignItems

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::alignItems()
and AcDbAssocArrayPathParameters::setAlignItems() methods.
```text
public bool AlignItems;
```

#### Conditions
Read / write
### EndOffset

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::endOffset() and AcDbAssocArrayPathParameters::setEndOffset() methods.
```text
public double EndOffset;
```

#### Conditions
Read / write
### ItemCount

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::itemCount() and AcDbAssocArrayPathParameters::setItemCount() methods.
```text
public int ItemCount;
```

#### Conditions
Read / write
### ItemSpacing

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::itemSpacing() and AcDbAssocArrayPathParameters::setItemSpacing() methods.
```text
public double ItemSpacing;
```

#### Conditions
Read / write
### Method

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::method() and AcDbAssocArrayPathParameters::setMethod() methods.
```text
public MethodType Method;
```

#### Conditions
Read / write
### Path

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::path() and AcDbAssocArrayPathParameters::setPath() methods.
```text
public EdgeRef Path;
```

#### Conditions
Read / write
### PathDirection

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::setPathDirection() method.
```text
public bool PathDirection;
```

#### Conditions
Read / write
### StartOffset

#### Description
Wraps the ObjectARX AcDbAssocArrayPathParameters::startOffset() and AcDbAssocArrayPathParameters::setStartOffset() methods.
```text
public double StartOffset;
```

#### Conditions
Read / write