# Autodesk.AutoCAD.DatabaseServices.DeepCloneType Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::DeepCloneType ObjectARX enum.
It defines the types of deep cloning.
```text
public enum DeepCloneType {
  Block = 2,
  Copy = 0,
  Explode = 1,
  Insert = 6,
  InsertCopy = 10,
  Objects = 8,
  SymbolTableMerge = 4,
  Wblock = 7,
  WblockObjects = 11,
  XrefBind = 3,
  XrefInsert = 9
}
```

#### Members

| Members | Description |
| --- | --- |
| Block = 2 |
| Copy = 0 |
| Explode = 1 |
| Insert = 6 |
| InsertCopy = 10 |
| Objects = 8 |
| SymbolTableMerge = 4 |
| Wblock = 7 |
| WblockObjects = 11 |
| XrefBind = 3 |
| XrefInsert = 9 |