# PdfReference Class

## Overview

#### Description
This .NET class wraps the ObjectARX class AcDbPdfReference.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.Entity
        Autodesk.AutoCAD.DatabaseServices.UnderlayReference
            Autodesk.AutoCAD.DatabaseServices.PdfReference
```

```text
public class PdfReference : UnderlayReference;
```

## Members

### Constructors

- PdfReference

## Constructors Details

### PdfReference

#### Description
This is PdfReference, a member of class PdfReference.
```text
public PdfReference();
```