# Camera Class

## Overview

#### Description
This is class Autodesk.AutoCAD.EditorInput.Camera.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.Camera
```

```text
public class Camera : Entity;
```

### Properties

- BackClipDistance
- BackClipEnabled
- FieldOfView
- FrontClipDistance
- FrontClipEnabled
- IsCameraPlottable
- LensLength
- Position
- Target
- ViewId
- ViewTwist

## Properties Details

### BackClipDistance

#### Description
This is BackClipDistance, a member of class Camera.
```text
public double BackClipDistance;
```

### BackClipEnabled

#### Description
This is BackClipEnabled, a member of class Camera.
```text
public bool BackClipEnabled;
```

### FieldOfView

#### Description
This is FieldOfView, a member of class Camera.
```text
public double FieldOfView;
```

### FrontClipDistance

#### Description
This is FrontClipDistance, a member of class Camera.
```text
public double FrontClipDistance;
```

### FrontClipEnabled

#### Description
This is FrontClipEnabled, a member of class Camera.
```text
public bool FrontClipEnabled;
```

### IsCameraPlottable

#### Description
This is IsCameraPlottable, a member of class Camera.
```text
public bool IsCameraPlottable;
```

### LensLength

#### Description
This is LensLength, a member of class Camera.
```text
public double LensLength;
```

### Position

#### Description
This is Position, a member of class Camera.
```text
public Point3d Position;
```

### Target

#### Description
This is Target, a member of class Camera.
```text
public Point3d Target;
```

### ViewId

#### Description
This is ViewId, a member of class Camera.
```text
public ObjectId ViewId;
```

### ViewTwist

#### Description
This is ViewTwist, a member of class Camera.
```text
public double ViewTwist;
```