# Autodesk.AutoCAD.DatabaseServices.TableStyleOverride Enumeration

## Overview

#### Description
This .NET class wraps the AcDbTable::TableStyleOverrides ObjectARX class. It enumerates the table style overrides for a table object.
```text
public enum TableStyleOverride {
  CellAlignment = 130,
  CellBackgroundColor = 0x84,
  CellBackgroundFillNone = 0x83,
  CellBottomGridColor = 0x8a,
  CellBottomGridLineWeight = 0x8e,
  CellBottomVisibility = 0x92,
  CellContentColor = 0x85,
  CellDataType = 0x94,
  CellLeftGridColor = 0x8b,
  CellLeftGridLineWeight = 0x8f,
  CellLeftVisibility = 0x93,
  CellRightGridColor = 0x89,
  CellRightGridLineWeight = 0x8d,
  CellRightVisibility = 0x91,
  CellTextHeight = 0x87,
  CellTextStyle = 0x86,
  CellTopGridColor = 0x88,
  CellTopGridLineWeight = 140,
  CellTopVisibility = 0x90,
  DataHorizontalBottomColor = 0x36,
  DataHorizontalBottomLineWeight = 0x54,
  DataHorizontalBottomVisibility = 0x72,
  DataHorizontalInsideColor = 0x35,
  DataHorizontalInsideLineWeight = 0x53,
  DataHorizontalInsideVisibility = 0x71,
  DataHorizontalTopColor = 0x34,
  DataHorizontalTopLineWeight = 0x52,
  DataHorizontalTopVisibility = 0x70,
  DataRowAlignment = 0x11,
  DataRowColor = 8,
  DataRowDataType = 0x1a,
  DataRowFillColor = 14,
  DataRowFillNone = 11,
  DataRowTextHeight = 0x17,
  DataRowTextStyle = 20,
  DataVerticalInsideColor = 0x38,
  DataVerticalInsideLineWeight = 0x56,
  DataVerticalInsideVisibility = 0x74,
  DataVerticalLeftColor = 0x37,
  DataVerticalLeftLineWeight = 0x55,
  DataVerticalLeftVisibility = 0x73,
  DataVerticalRightColor = 0x39,
  DataVerticalRightLineWeight = 0x57,
  DataVerticalRightVisibility = 0x75,
  FlowDirection = 3,
  HeaderHorizontalBottomColor = 0x30,
  HeaderHorizontalBottomLineWeight = 0x4e,
  HeaderHorizontalBottomVisibility = 0x6c,
  HeaderHorizontalInsideColor = 0x2f,
  HeaderHorizontalInsideLineWeight = 0x4d,
  HeaderHorizontalInsideVisibility = 0x6b,
  HeaderHorizontalTopColor = 0x2e,
  HeaderHorizontalTopLineWeight = 0x4c,
  HeaderHorizontalTopVisibility = 0x6a,
  HeaderRowAlignment = 0x10,
  HeaderRowColor = 7,
  HeaderRowDataType = 0x19,
  HeaderRowFillColor = 13,
  HeaderRowFillNone = 10,
  HeaderRowTextHeight = 0x16,
  HeaderRowTextStyle = 0x13,
  HeaderSuppressed = 2,
  HeaderVerticalInsideColor = 50,
  HeaderVerticalInsideLineWeight = 80,
  HeaderVerticalInsideVisibility = 110,
  HeaderVerticalLeftColor = 0x31,
  HeaderVerticalLeftLineWeight = 0x4f,
  HeaderVerticalLeftVisibility = 0x6d,
  HeaderVerticalRightColor = 0x33,
  HeaderVerticalRightLineWeight = 0x51,
  HeaderVerticalRightVisibility = 0x6f,
  HorizontalCellMargin = 4,
  TitleHorizontalBottomColor = 0x2a,
  TitleHorizontalBottomLineWeight = 0x48,
  TitleHorizontalBottomVisibility = 0x66,
  TitleHorizontalInsideColor = 0x29,
  TitleHorizontalInsideLineWeight = 0x47,
  TitleHorizontalInsideVisibility = 0x65,
  TitleHorizontalTopColor = 40,
  TitleHorizontalTopLineWeight = 70,
  TitleHorizontalTopVisibility = 100,
  TitleRowAlignment = 15,
  TitleRowColor = 6,
  TitleRowDataType = 0x18,
  TitleRowFillColor = 12,
  TitleRowFillNone = 9,
  TitleRowTextHeight = 0x15,
  TitleRowTextStyle = 0x12,
  TitleSuppressed = 1,
  TitleVerticalInsideColor = 0x2c,
  TitleVerticalInsideLineWeight = 0x4a,
  TitleVerticalInsideVisibility = 0x68,
  TitleVerticalLeftColor = 0x2b,
  TitleVerticalLeftLineWeight = 0x49,
  TitleVerticalLeftVisibility = 0x67,
  TitleVerticalRightColor = 0x2d,
  TitleVerticalRightLineWeight = 0x4b,
  TitleVerticalRightVisibility = 0x69,
  VerticalCellMargin = 5
}
```

#### Members

| Members | Description |
| --- | --- |
| CellAlignment = 130 | Indicates alignment table style override for table cell. |
| CellBackgroundColor = 0x84 | Indicates background color table style override for table cell. |
| CellBackgroundFillNone = 0x83 | Indicates background no fill table style override for table cell. |
| CellBottomGridColor = 0x8a | Indicates bottom edge grid color table style override for table cell. |
| CellBottomGridLineWeight = 0x8e | Indicates bottom edge grid lineweight table style override for table cell. |
| CellBottomVisibility = 0x92 | Indicates bottom edge grid visibility table style override for table cell. |
| CellContentColor = 0x85 | Indicates content color table style override for table cell. |
| CellDataType = 0x94 | The type of data within the cell. |
| CellLeftGridColor = 0x8b | Indicates left edge grid color table style override for table cell. |
| CellLeftGridLineWeight = 0x8f | Indicates left edge grid lineweight table style override for table cell. |
| CellLeftVisibility = 0x93 | Indicates left edge grid visibility table style override for table cell. |
| CellRightGridColor = 0x89 | Indicates right edge grid color table style override for table cell. |
| CellRightGridLineWeight = 0x8d | Indicates right edge grid lineweight table style override for table cell. |
| CellRightVisibility = 0x91 | Indicates right edge grid visibility table style override for table cell. |
| CellTextHeight = 0x87 | Indicates text height table style override for table cell. |
| CellTextStyle = 0x86 | Indicates text style table style override for table cell. |
| CellTopGridColor = 0x88 | Indicates top edge grid color table style override for table cell. |
| CellTopGridLineWeight = 140 | Indicates top edge grid lineweight table style override for table cell. |
| CellTopVisibility = 0x90 | Indicates top edge grid visibility table style override for table cell. |
| DataHorizontalBottomColor = 0x36 | Indicates data row horizontal bottom gridline color table style override for table object. |
| DataHorizontalBottomLineWeight = 0x54 | Indicates data row horizontal bottom gridline lineweight table style override for table object. |
| DataHorizontalBottomVisibility = 0x72 | Indicates data row horizontal bottom gridline visibility table style override for table object. |
| DataHorizontalInsideColor = 0x35 | Indicates data row horizontal inside gridline color table style override for table object. |
| DataHorizontalInsideLineWeight = 0x53 | Indicates data row horizontal inside gridline lineweight table style override for table object. |
| DataHorizontalInsideVisibility = 0x71 | Indicates data row horizontal inside gridline visibility table style override for table object. |
| DataHorizontalTopColor = 0x34 | Indicates data row horizontal top gridline color table style override for table object. |
| DataHorizontalTopLineWeight = 0x52 | Indicates data row horizontal top gridline lineweight table style override for table object. |
| DataHorizontalTopVisibility = 0x70 | Indicates data row horizontal top gridline visibility table style override for table object. |
| DataRowAlignment = 0x11 | Indicates data row alignment table style override for table object. |
| DataRowColor = 8 | Indicates data row color table style override for table object. |
| DataRowFillColor = 14 | Indicates data row fill color table style override for table object. |
| DataRowFillNone = 11 | Indicates data row no fill table style override for table object. |
| DataRowTextHeight = 0x17 | Indicates data row text height table style override for table object. |
| DataRowTextStyle = 20 | Indicates data row text style table style override for table object. |
| DataVerticalInsideColor = 0x38 | Indicates data row vertical inside gridline color table style override for table object. |
| DataVerticalInsideLineWeight = 0x56 | Indicates data row vertical inside gridline lineweight table style override for table object. |
| DataVerticalInsideVisibility = 0x74 | Indicates data row vertical inside gridline visibility table style override for table object. |
| DataVerticalLeftColor = 0x37 | Indicates data row vertical left gridline color table style override for table object. |
| DataVerticalLeftLineWeight = 0x55 | Indicates data row vertical left gridline lineweight table style override for table object. |
| DataVerticalLeftVisibility = 0x73 | Indicates data row vertical left gridline visibility table style override for table object. |
| DataVerticalRightColor = 0x39 | Indicates data row vertical right gridline color table style override for table object. |
| DataVerticalRightLineWeight = 0x57 | Indicates data row vertical right gridline lineweight table style override for table object. |
| DataVerticalRightVisibility = 0x75 | Indicates data row vertical right gridline visibility table style override for table object. |
| FlowDirection = 3 | Indicates flow direction table style override for table object. |
| HeaderHorizontalBottomColor = 0x30 | Indicates header row horizontal bottom gridline color table style override for table object. |
| HeaderHorizontalBottomLineWeight = 0x4e | Indicates header row horizontal bottom gridline lineweight table style override for table. |
| HeaderHorizontalBottomVisibility = 0x6c | Indicates header row horizontal bottom gridline visibility table style override for table object. |
| HeaderHorizontalInsideColor = 0x2f | Indicates header row horizontal inside gridline color table style override for table object. |
| HeaderHorizontalInsideLineWeight = 0x4d | Indicates header row horizontal inside gridline lineweight table style override for table object. |
| HeaderHorizontalInsideVisibility = 0x6b | Indicates header row horizontal inside gridline visibility table style override for table object. |
| HeaderHorizontalTopColor = 0x2e | Indicates header row horizontal top gridline color table style override for table object. |
| HeaderHorizontalTopLineWeight = 0x4c | Indicates header row horizontal top gridline lineweight table style override for table object. |
| HeaderHorizontalTopVisibility = 0x6a | Indicates header row horizontal top gridline visibility table style override for table object. |
| HeaderRowAlignment = 0x10 | Indicates header row alignment table style override for table object. |
| HeaderRowColor = 7 | Indicates header row color table style override for table object. |
| HeaderRowFillColor = 13 | Indicates header row fill color table style override for table object. |
| HeaderRowFillNone = 10 | Indicates header row no fill table style override for table object. |
| HeaderRowTextHeight = 0x16 | Indicates header row text height table style override for table object. |
| HeaderRowTextStyle = 0x13 | Indicates header row text style table style override for table object. |
| HeaderSuppressed = 2 | Indicates header suppressed table style override for table object. |
| HeaderVerticalInsideColor = 50 | Indicates header row vertical inside gridline color table style override for table object. |
| HeaderVerticalInsideLineWeight = 80 | Indicates header row vertical inside gridline lineweight table style override for table object. |
| HeaderVerticalInsideVisibility = 110 | Indicates header row vertical inside gridline visibility table style override for table object. |
| HeaderVerticalLeftColor = 0x31 | Indicates header row vertical left gridline color table style override for table object. |
| HeaderVerticalLeftLineWeight = 0x4f | Indicates header row vertical left gridline lineweight table style override for table object. |
| HeaderVerticalLeftVisibility = 0x6d | Indicates header row vertical left gridline visibility table style override for table object. |
| HeaderVerticalRightColor = 0x33 | Indicates header row vertical right gridline color table style override for table object. |
| HeaderVerticalRightLineWeight = 0x51 | Indicates header row vertical right gridline lineweight table style override for table object. |
| HeaderVerticalRightVisibility = 0x6f | Indicates header row vertical right gridline visibility table style override for table object. |
| HorizontalCellMargin = 4 | Indicates horizontal cell margin table style override for table object. |
| TitleHorizontalBottomColor = 0x2a | Indicates title row horizontal bottom gridline color table style override for table object. |
| TitleHorizontalBottomLineWeight = 0x48 | Indicates title row horizontal bottom gridline lineweight table style override for table object. |
| TitleHorizontalBottomVisibility = 0x66 | Indicates title row horizontal bottom gridline visibility table style override for table object. |
| TitleHorizontalInsideColor = 0x29 | Indicates title row horizontal inside gridline color table style override for table object. |
| TitleHorizontalInsideLineWeight = 0x47 | Indicates title row horizontal inside gridline lineweight table style override for table object. |
| TitleHorizontalInsideVisibility = 0x65 | Indicates title row horizontal inside gridline visibility table style override for table object. |
| TitleHorizontalTopColor = 40 | Indicates title row horizontal top gridline color table style override for table object. |
| TitleHorizontalTopLineWeight = 70 | Indicates title row horizontal top gridline lineweight table style override for table object. |
| TitleHorizontalTopVisibility = 100 | Indicates title row horizontal top gridline visibility table style override for table object. |
| TitleRowAlignment = 15 | Indicates title row alignment table style override for table object. |
| TitleRowColor = 6 | Indicates title row color table style override for table object. |
| TitleRowFillColor = 12 | Indicates title row fill color table style override for table object. |
| TitleRowFillNone = 9 | Indicates title row no fill table style override for table object. |
| TitleRowTextHeight = 0x15 | Indicates title row text height table style override for table object. |
| TitleRowTextStyle = 0x12 | Indicates title row text style table style override for table object. |
| TitleSuppressed = 1 | Indicates title suppressed table style override for table object. |
| TitleVerticalInsideColor = 0x2c | Indicates title row vertical inside gridline color table style override for table object. |
| TitleVerticalInsideLineWeight = 0x4a | Indicates title row vertical inside gridline lineweight table style override for table object. |
| TitleVerticalInsideVisibility = 0x68 | Indicates title row vertical inside gridline visibility table style override. |
| TitleVerticalLeftColor = 0x2b | Indicates title row vertical left gridline color table style override for table object. |
| TitleVerticalLeftLineWeight = 0x49 | Indicates title row vertical left gridline lineweight table style override for table object. |
| TitleVerticalLeftVisibility = 0x67 | Indicates title row vertical left gridline visibility table style override for table object. |
| TitleVerticalRightColor = 0x2d | Indicates title row vertical right gridline color table style override for table object. |
| TitleVerticalRightLineWeight = 0x4b | Indicates title row vertical right gridline lineweight table style override for table object. |
| TitleVerticalRightVisibility = 0x69 | Indicates title row vertical right gridline visibility table style override for table object. |
| VerticalCellMargin = 5 | Indicates vertical cell margin table style override for table object. |