# AssocSurfaceActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocEdgeFilletActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocOffsetSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
```

```text
public class AssocSurfaceActionBody : AssocParamBasedActionBody;
```

### Constructors

- AssocSurfaceActionBody

### Methods

- EvaluateOverride
- FindActionsThatAffectedTopologicalSubentity
- [ResultingSurfaceDep([MarshalAs(UnmanagedType.U1)] bool)](#resultingsurfacedep([marshalas(unmanagedtype.u1)]-bool))
- [ResultingSurfaceDep([MarshalAs(UnmanagedType.U1)] bool, [MarshalAs(UnmanagedType.U1)] bool)](#resultingsurfacedep([marshalas(unmanagedtype.u1)]-bool,-[marshalas(unmanagedtype.u1)]-bool))
- SetResultingSurface

### Properties

- IsSemiAssociative
- ResultingSurface

## Constructors Details

### AssocSurfaceActionBody

#### Description
This wraps the ObjectARX AcDbAssocSurfaceActionBody::AcDbAssocSurfaceActionBody() method.
```text
public AssocSurfaceActionBody();
```

### EvaluateOverride

#### Description
This wraps the ObjectARX AcDbAssocSurfaceActionBody::evaluateOverride() method.
```text
public override void EvaluateOverride();
```

### FindActionsThatAffectedTopologicalSubentity

#### Description
This wraps the ObjectARX AcDbAssocSurfaceActionBody::findActionsThatAffectedTopologicalSubentity(); method.
```text
public static ObjectIdCollection FindActionsThatAffectedTopologicalSubentity(
    Entity entity,
    SubentityId subEntityId
);
```

### ResultingSurfaceDep([MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbAssocSurfaceActionBody::resultingSurfaceDep() method.
```text
public ObjectId ResultingSurfaceDep(
    [MarshalAs(UnmanagedType.U1)] bool createIfDoesNotExist
);
```

### ResultingSurfaceDep([MarshalAs(UnmanagedType.U1)] bool, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbAssocSurfaceActionBody::resultingSurfaceDep() method.
```text
public ObjectId ResultingSurfaceDep(
    [MarshalAs(UnmanagedType.U1)] bool createIfDoesNotExist,
    [MarshalAs(UnmanagedType.U1)] bool isWriteOnlyDependency
);
```

### SetResultingSurface

#### Description
This wraps the ObjectARX AcDbAssocSurfaceActionBody::setResultingSurface() method.
```text
public void SetResultingSurface(
    ObjectId surfaceId,
    [MarshalAs(UnmanagedType.U1)] bool isWriteOnlyDependency
);
```

### IsSemiAssociative

#### Description
This wraps the ObjectARXAcDbAssocSurfaceActionBody::isSemiAssociative( ) method.
```text
public bool IsSemiAssociative;
```

### ResultingSurface

#### Description
This wraps the ObjectARX AcDbAssocSurfaceActionBody::resultingSurface() andAcDbAssocSurfaceActionBody::setResultingSurface ()methods.
```text
public ObjectId ResultingSurface;
```