# LoftOptions Class

## Overview

#### Description
This .NET class wraps the AcDbLoftOptions ObjectARX class.
Utility class for setting options used by LoftedSurface.CreateLoftedSurface() . These options can be used to control the shape of the resulting surface. The default constructor for this class assigns default values to these options.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.LoftOptions
```

```text
public sealed class LoftOptions : DisposableWrapper, ICloneable;
```

### Constructors

- LoftOptions()
- LoftOptions(LoftOptions)

### Methods

- CheckCrossSectionCurves
- CheckGuideCurves
- CheckLoftCurves
- CheckPathCurve
- Clone

### Properties

- AlignDirection
- ArcLengthParam
- Closed
- DraftEnd
- DraftEndMag
- DraftStart
- DraftStartMag
- NormalOption
- NoTwist
- Ruled
- Simplify
- VirtualGuide

## Constructors Details

### LoftOptions()

#### Description
Default constructor.
```text
public LoftOptions();
```

### LoftOptions(LoftOptions)

#### Description
Copy constructor.
```text
public LoftOptions(
    LoftOptions opts
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| LoftOptions opts | Input object to be copied into 'this' |

### CheckCrossSectionCurves

#### Description
Checks whether cross section curves are valid for the lofting operation. This function is called by CreateLoftedSurface() and CreateLoftedSolid(), so it is not necessary for an application to call this function.
```text
public LoftOptionsCheckCurvesOut CheckCrossSectionCurves(
    Entity\[\] crossSectionCurves,
    [MarshalAs(UnmanagedType.U1)] bool displayErrorMessages
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| Entity[] crossSectionCurves | Input list of cross-section curves |
| [MarshalAs(UnmanagedType.U1)] bool displayErrorMessages | Input Boolean whether or not to display error messages |

### CheckGuideCurves

#### Description
Checks whether guide curves are valid for lofting operation. This function is called by CreateLoftedSurface() and CreateLoftedSolid(), so it is not necessary for an application to call this function.
```text
public void CheckGuideCurves(
    Entity\[\] guideCurves,
    [MarshalAs(UnmanagedType.U1)] bool displayErrorMessages
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| Entity[] guideCurves | Input list of guide curves |
| [MarshalAs(UnmanagedType.U1)] bool displayErrorMessages | Input Boolean whether or not to display error messages |

### CheckLoftCurves

#### Description
Checks whether cross section curves and guide/path curves are valid for the lofting operation. This function is called by CreateLoftedSurface() and CreateLoftedSolid(), so it is not necessary for an application to call this function. This function combines calls to CheckCrossSectionCurves(), CheckGuideCurves(), and CheckPathCurve() into a single function.
```text
public LoftOptionsCheckCurvesOut CheckLoftCurves(
    Entity\[\] crossSectionCurves,
    Entity\[\] guideCurves,
    Entity pPathCurve,
    [MarshalAs(UnmanagedType.U1)] bool displayErrorMessages
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| Entity[] crossSectionCurves | Input list of cross-section curves |
| Entity[] guideCurves | Input list of guide curves |
| Entity pPathCurve | Input pointer to path curve or null |
| [MarshalAs(UnmanagedType.U1)] bool displayErrorMessages | Input Boolean whether or not to display error messages |

### CheckPathCurve

#### Description
This function checks for valid combinations of options.
```text
public void CheckPathCurve(
    Entity pathCurve,
    [MarshalAs(UnmanagedType.U1)] bool displayErrorMessages
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| Entity pathCurve | Input path curve |
| [MarshalAs(UnmanagedType.U1)] bool displayErrorMessages | Input Boolean whether or not to display error messages |

### Clone

#### Description
Returns a copy of this object.
```text
public object Clone();
```

### AlignDirection

#### Description
Accesses the value of the AlignDirection option. This option can be used to orient each of the cross sections so that the normal vector of each cross section points towards the next cross section. The default value of this option is true. If the cross sections are not all oriented in the same direction, then this option should be used to avoid creating a twisted or self-intersecting surface or solid.
```text
public bool AlignDirection;
```

#### Conditions
Read-only
### ArcLengthParam

#### Description
Accesses the arc length parametrization.
```text
public bool ArcLengthParam;
```

#### Conditions
Read-only
### Closed

```text
public bool Closed;
```

#### Conditions
Read-only
Accesses the value of the closed option. If this option is set, then the resulting surface/solid will start and end at the first cross section. If all of the cross sections are closed, then this will result in a torus-like shape. If this option is not set, then the surface or solid will be open or capped with a planar surface at the first and last cross sections. The default value of this option is false. If this option is set, then there must be at least three cross sections.
Read-only
### DraftEnd

#### Description
Accesses the end draft angle in radians. This is the surface take-off direction at the last cross section. The default value of this option is 0, which indicates that no draft angle is defined and the system will compute the optimum angle at the last cross section.
```text
public double DraftEnd;
```

#### Conditions
Read-only
### DraftEndMag

#### Description
Accesses the end draft magnitude. Controls the magnitude of the surface tangent vector at the last cross-section. The default value of this option is 0, which means that the system will compute the optimum magnitude.
```text
public double DraftEndMag;
```

#### Conditions
Read-only
### DraftStart

#### Description
Accesses the start draft angle in radians. This is the surface take-off direction at the first cross section. The default value of this option is 0, which indicates that no draft angle is defined and the system will compute the optimum angle at the first cross section.
```text
public double DraftStart;
```

#### Conditions
Read-only
### DraftStartMag

#### Description
Accesses the start draft magnitude. Controls the magnitude of the surface tangent vector at the first cross-section. The default value of this option is 0, which means that the system will compute the optimum magnitude.
```text
public double DraftStartMag;
```

#### Conditions
Read-only
### NormalOption

#### Description
Accesses the plane normal option. See LoftOptionsNormalOption for a description of possible values. The default value of this option is NoNormal.
```text
public LoftOptionsNormalOption NormalOption;
```

#### Conditions
Read-only
### NoTwist

#### Description
Accesses the value of the noTwist option. This option can be used to minimize the amount of twist in the resulting surface or solid when the cross-sections are all closed. The default value of this option is true. If this option is set then the start point of each closed cross-section is aligned with the other cross-sections to minimize twist.
```text
public bool NoTwist;
```

#### Conditions
Read-only
### Ruled

#### Description
Accesses the value of the ruled option. If this option is set then a ruled surface will be created between each pair of cross sections rather than a single smooth surface. This will result in a much coarser object. The default value of this option is false.
```text
public bool Ruled;
```

#### Conditions
Read-only
### Simplify

#### Description
Accesses the value of the simplify option. If this option is set, then simple surface types (plane, cylinder, cone, sphere, or torus) will be created whenever all of the cross sections lie on such a surface. Otherwise a general surface type will be created. The default value of this option is true.
```text
public bool Simplify;
```

#### Conditions
Read-only
### VirtualGuide

#### Description
Accesses the state of the virtual guide option.
```text
public bool VirtualGuide;
```

#### Conditions
Read-only