# Autodesk.AutoCAD.DatabaseServices.CollisionType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbEntity::collisionType ObjectARX enum.
```text
public enum CollisionType {
  None,
  Solid
}
```

#### Members

| Members | Description |
| --- | --- |
| None | This entity does not participate in collision detection. |
| Solid | This entity behaves as a solid object during collision detection. |