# Autodesk.AutoCAD.DatabaseServices.ContentType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbMLeaderStyle::ContentType ObjectARX enum. This enum describes the types of content type for MLeader.
```text
public enum ContentType {
  NoneContent,
  BlockContent,
  MTextContent,
  ToleranceContent
}
```

#### Members

| Members | Description |
| --- | --- |
| NoneContent | MLeader has no content |
| BlockContent | MLeader has block content |
| MTextContent | MLeader has MText content |
| ToleranceContent | MLeader has tolerance content |