# Autodesk.AutoCAD.EditorInput.PickPointKind Enumeration

## Overview

#### Description
This enumeration describes the possible shapes of a pick point.
```text
public enum PickPointKind {
  InfiniteLine,
  Ray,
  LineSegment
}
```

#### Members

| Members | Description |
| --- | --- |
| InfiniteLine | Infinite line type pick point. |
| Ray | Ray type pick point. |
| LineSegment | Segmented line type pick point. |