# TextEditorColumns Class

## Overview

#### Description
This wraps the ObjectARX AcDbTextEditorColumns class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.TextEditorColumns
```

```text
public class TextEditorColumns : DisposableWrapper;
```

### Properties

- AutoHeight
- Count
- Gutter
- IsFlowReversed
- MaxCount
- TotalWidth
- Type
- Width

## Properties Details

### AutoHeight

#### Description
Gets and sets the flag of auto height for all the column objects.
This wraps the ObjectARX AcDbTextEditorColumns::autoHeight() and AcDbTextEditorColumns::setAutoHeight() methods.
```text
public bool AutoHeight;
```

### Count

#### Description
Gets and sets the count of the column objects in text editor.
This wraps the ObjectARX AcDbTextEditorColumns::count() and AcDbTextEditorColumns::setCount() methods.
```text
public virtual int Count;
```

### Gutter

#### Description
Gets and sets the gutter value of the column object in editor. This wraps the ObjectARX AcDbTextEditorColumns::gutter() and AcDbTextEditorColumns::setGutter() methods.
```text
public double Gutter;
```

### IsFlowReversed

#### Description
Gets and sets if the flows of all the column objects in editor are reversed.
This wraps the ObjectARX AcDbTextEditorColumns::isFlowReversed() and AcDbTextEditorColumns::setIsFlowReversed() methods.
```text
public bool IsFlowReversed;
```

### MaxCount

#### Description
This wraps the ObjectARX AcDbTextEditorColumns::maxCount() method.
```text
public int MaxCount;
```

### TotalWidth

#### Description
Gets and sets the total width for all the column objects in editor.
This wraps the ObjectARX AcDbTextEditorColumns::totalWidth() and AcDbTextEditorColumns::setTotalWidth() methods.
```text
public double TotalWidth;
```

### Type

#### Description
Gets and sets the type for the column object.
This wraps the ObjectARX AcDbTextEditorColumns::columnType() and AcDbTextEditorColumns::setColumnType() methods.
```text
public Autodesk.AutoCAD.DatabaseServices.ColumnType Type;
```

### Width

#### Description
Gets and sets the width of the column object in editor.
This wraps the ObjectARX AcDbTextEditorColumns::width() and AcDbTextEditorColumns::setWidth() methods.
```text
public double Width;
```