# Autodesk.AutoCAD.DatabaseServices.LampColorType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbLight::LampColorType ObjectARX class.
```text
public enum LampColorType {
  Kelvin,
  Preset
}
```

#### Members

| Members | Description |
| --- | --- |
| Kelvin | Color specified as a Kelvin color temperature. |
| Preset | Color specified as a preset lamp color. |