# AssocRevolvedSurfaceActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocRevolvedSurfaceActionBody
```

```text
public class AssocRevolvedSurfaceActionBody : AssocPathBasedSurfaceActionBody;
```

### Constructors

- AssocRevolvedSurfaceActionBody

### Methods

- CreateInstance
- GetRevolveAngle
- SetRevolveAngle

### Properties

- RevolveAngle

## Constructors Details

### AssocRevolvedSurfaceActionBody

#### Description
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody::AcDbAssocRevolvedSurfaceActionBody() method.
```text
public AssocRevolvedSurfaceActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    ObjectId resultingSurfaceId,
    PathRef revolvePath,
    PathRef axisPath,
    double angle,
    double startAngle,
    RevolveOptions revolveOptions,
    [MarshalAs(UnmanagedType.U1)] bool flipAxisDirection,
    [MarshalAs(UnmanagedType.U1)] bool enable
);
```

### GetRevolveAngle

#### Description
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody::revolveAngle() method.
```text
public double GetRevolveAngle(
    out string expression,
    out string evaluatorId
);
```

### SetRevolveAngle

#### Description
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody::setRevolveAngle() method.
```text
public void SetRevolveAngle(
    double value,
    string expression,
    string evaluatorId
);
```

### RevolveAngle

#### Description
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody::revolveAngle() and AcDbAssocRevolvedSurfaceActionBody::setRevolveAngle() methods.
```text
public double RevolveAngle;
```