# EqualCurvatureConstraint Class

## Overview

#### Description
This class represents a EqualCurvature constraint node in the owning Assoc2dConstraintGroup.
It can be applied between a bounded spline and a bounded curve.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.EqualCurvatureConstraint
```

```text
public class EqualCurvatureConstraint : GeometricalConstraint;
```

## Members

### Constructors

- EqualCurvatureConstraint

## Constructors Details

### EqualCurvatureConstraint

#### Description
Default constructor.
```text
public EqualCurvatureConstraint();
```