# SubentityOverrule Class

## Overview

#### Description
This .NET class wraps the ObjectARX class AcDbSubentityOverrule.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.SubentityOverrule
```

```text
public abstract class SubentityOverrule : Overrule;
```

### Methods

- AddSubentPaths
- DeleteSubentPaths
- GetCompoundObjectTransform
- GetGripPointsAtSubentPath
- GetGsMarkersAtSubentPath
- GetSubentClassId
- GetSubentPathGeomExtents
- GetSubentPathsAtGsMarker
- MoveGripPointsAtSubentPaths
- OnSubentGripStatusChanged
- SetCustomFilter
- SetExtensionDictionaryEntryFilter
- SetIdFilter
- SetNoFilter
- SetXDataFilter
- SubentPtr
- TransformSubentPathsBy

## Methods Details

### AddSubentPaths

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::addSubentPaths().
```text
public virtual void AddSubentPaths(
    Entity entity,
    FullSubentityPath\[\] paths
);
```

### DeleteSubentPaths

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::deleteSubentPaths().
```text
public virtual void DeleteSubentPaths(
    Entity entity,
    FullSubentityPath\[\] paths
);
```

### GetCompoundObjectTransform

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getCompoundObjectTransform().
```text
public virtual Matrix3d GetCompoundObjectTransform(
    Entity entity
);
```

### GetGripPointsAtSubentPath

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getGripPointsAtSubentPath().
```text
public virtual void GetGripPointsAtSubentPath(
    Entity entity,
    FullSubentityPath subPath,
    GripDataCollection grips,
    double curViewUnitSize,
    int gripSize,
    Vector3d curViewDir,
    GetGripPointsFlags bitFlags
);
```

### GetGsMarkersAtSubentPath

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getGsMarkersAtSubentPath().
```text
public virtual IntPtr\[\] GetGsMarkersAtSubentPath(
    Entity entity,
    FullSubentityPath subPath
);
```

### GetSubentClassId

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getSubentClassId().
```text
public virtual Guid GetSubentClassId(
    Entity entity,
    FullSubentityPath path
);
```

### GetSubentPathGeomExtents

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getSubentPathGeomExtents().
```text
public virtual Extents3d GetSubentPathGeomExtents(
    Entity entity,
    FullSubentityPath path
);
```

### GetSubentPathsAtGsMarker

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::getSubentPathsAtGsMarker().
```text
public virtual FullSubentityPath\[\] GetSubentPathsAtGsMarker(
    Entity entity,
    SubentityType type,
    IntPtr gsMark,
    Point3d pickPoint,
    Matrix3d viewXform,
    ObjectId\[\] entAndInsertStack
);
```

### MoveGripPointsAtSubentPaths

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::moveGripPointsAtSubentPaths().
```text
public virtual void MoveGripPointsAtSubentPaths(
    Entity entity,
    FullSubentityPath\[\] path,
    GripDataCollection grips,
    Vector3d offset,
    MoveGripPointsFlags bitFlags
);
```

### OnSubentGripStatusChanged

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::subentGripStatus()
```text
public virtual void OnSubentGripStatusChanged(
    Entity entity,
    GripStatus status,
    FullSubentityPath subentity
);
```

### SetCustomFilter

#### Description
Enables the use of the IsApplicable method in determining whether an overrule applies.
```text
public sealed override void SetCustomFilter();
```

#### See Also
SubentityOverrule.SetNoFilter Method; Overrule.IsApplicable Method

### SetExtensionDictionaryEntryFilter

#### Description
Enables the use of extension dictionary lookups to determine whether overrules apply.
Use this method when you want AutoCAD to look for an extension dictionary entry with entryName on the overruled subject before calling any of your overrules. The overrules won't be called if entryName is not present in the extension dictionary.
```text
public sealed override void SetExtensionDictionaryEntryFilter(
    string entryName
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| string entryName | Input the name of the entry. |

#### See Also
SubentityOverrule.SetNoFilter Method

### SetIdFilter

#### Description
Enables the use of id lookups to determine whether overrules apply.
Use this method when you want AutoCAD to only call your overrule for objects with a matching id in ids.
```text
public sealed override void SetIdFilter(
    ObjectId\[\] ids
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| ObjectId[] ids | Input an array of ObjectId. |

#### See Also
SubentityOverrule.SetNoFilter Method

### SetNoFilter

#### Description
Disables all of the filter methods (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter) as well as the IsApplicable() method in determining whether an overrule applies.
```text
public sealed override void SetNoFilter();
```

#### See Also
SubentityOverrule.SetCustomFilter Method; SubentityOverrule.SetExtensionDictionaryEntryFilter Method; SubentityOverrule.SetIdFilter Method; SubentityOverrule.SetXDataFilter Method; Overrule.IsApplicable Method

### SetXDataFilter

#### Description
Enables the use of xdata in determining whether overrules apply. Use this method when you want AutoCAD to look for xdata with registeredApplicationName on the overruled subject before calling any of your overrules.
```text
public sealed override void SetXDataFilter(
    string registeredApplicationName
);
```

#### Parameters

| Parameters | Description |
| --- | --- |
| string registeredApplicationName | Input the name of the registered application. |

#### See Also
SubentityOverrule.SetNoFilter Method

### SubentPtr

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::subentPtr().
```text
public virtual Entity SubentPtr(
    Entity entity,
    FullSubentityPath id
);
```

### TransformSubentPathsBy

#### Description
This .NET method wraps the ObjectARX method AcDbSubentityOverrule::transformSubentPathsBy().
```text
public virtual void TransformSubentPathsBy(
    Entity entity,
    FullSubentityPath\[\] paths,
    Matrix3d xform
);
```