# BeginWblockEntireDatabaseEventArgs Class

## Overview

#### Description
This class provides data for the BeginWblockEntireDatabase event of the database.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.BeginWblockEntireDatabaseEventArgs
```

```text
public sealed class BeginWblockEntireDatabaseEventArgs : EventArgs;
```

### Properties

- From

## Properties Details

### From

#### Description
Gets the database being wblock'ed.
```text
public Database From;
```

#### Conditions
Read-only