# Autodesk.AutoCAD.DatabaseServices.TextAttachmentType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbMLeaderStyle::TextAttachmentType ObjectARX enum.
This enum describes the types of text attachment type.
```text
public enum TextAttachmentType {
  AttachmentTopOfTop,
  AttachmentMiddleOfTop,
  AttachmentMiddle,
  AttachmentMiddleOfBottom,
  AttachmentBottomOfBottom,
  AttachmentBottomLine,
  AttachmentBottomOfTopLine,
  AttachmentBottomOfTop,
  AttachmentAllLine,
  AttachmentCenter,
  AttachmentLinedCenter
}
```

#### Members

| Members | Description |
| --- | --- |
| AttachmentTopOfTop | Attach to top of top text line of MText content. |
| AttachmentMiddleOfTop | Attach to middle of top text line of MText content. |
| AttachmentMiddle | Attach to middle of MText content. |
| AttachmentMiddleOfBottom | Attach to middle of bottom text line of MText content. |
| AttachmentBottomOfBottom | Attach to bottom of bottom text line of MText content. |
| AttachmentBottomLine | Attach to bottom of bottom text line of MText content and draws an underline. |
| AttachmentBottomOfTopLine | Attach to bottom of top text line of MText content and draw an underline. |
| AttachmentBottomOfTop | Attach to bottom of top text line of MText content. |
| AttachmentAllLine | Attach to bottom of top text line of MText content, and draw underline to whole MText. |