# Autodesk.AutoCAD.DatabaseServices.CellContentTypes Enumeration

## Overview

#### Description
This .NET class wraps the CellContentType ObjectARX enum.
These values define the content cell types.
```text
public enum CellContentTypes {
  Block = 4,
  Field = 2,
  Unknown = 0,
  Value = 1
}
```

#### Members
| Members | Description |
| --- | --- |
| Block = 4 | Content is block |
| Field = 2 | Content is field |
| Unknown = 0 | Unknown or invalid content |
| Value = 1 | Content is value in any data type, including text |