# Autodesk.AutoCAD.DatabaseServices.DrawMLeaderOrderType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbMLeaderStyle::DrawMLeaderOrderType ObjectARX class.
This enum describes the types of the order of creating MLeader object.
```text
public enum DrawMLeaderOrderType {
  DrawContentFirst,
  DrawLeaderFirst
}
```

#### Members

| Members | Description |
| --- | --- |
| DrawContentFirst | Draw MLeader content first |
| DrawLeaderFirst | Draw MLeader leaderline first |