# PromptStringOptionsEventArgs Class

## Overview

#### Description
This class provides data for the PromptingForString event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptStringOptionsEventArgs
```

```text
public sealed class PromptStringOptionsEventArgs : EventArgs;
```

### Properties

- Options

## Properties Details

### Options

#### Description
Gets the input parameters of the prompt.
```text
public PromptStringOptions Options;
```

#### Conditions
Read-only