# PromptKeywordOptionsEventArgs Class

## Overview

#### Description
This class provides data for the PromptingForKeyword> event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptKeywordOptionsEventArgs
```

```text
public sealed class PromptKeywordOptionsEventArgs : EventArgs;
```

### Properties

- Options

## Properties Details

### Options

#### Description
Gets the input parameters of the prompt.
```text
public PromptKeywordOptions Options;
```

#### Conditions
Read-only