# HorizontalConstraint Class

## Overview

#### Description
This class represents a Horizontal constraint node in the owning Assoc2dConstraintGroup.
It can be applied on one constrained line.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.ParallelConstraint
            Autodesk.AutoCAD.DatabaseServices.HorizontalConstraint
```

```text
public class HorizontalConstraint : ParallelConstraint;
```

## Members

### Constructors

- HorizontalConstraint

## Constructors Details

### HorizontalConstraint

#### Description
Default constructor.
```text
public HorizontalConstraint();
```