# AssocTrimSurfaceActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocPathBasedSurfaceActionBody
                    Autodesk.AutoCAD.DatabaseServices.AssocTrimSurfaceActionBody
```

```text
public class AssocTrimSurfaceActionBody : AssocPathBasedSurfaceActionBody;
```

### Constructors

- AssocTrimSurfaceActionBody

### Methods

- CreateInstance
- MakeTrimPermanent
- SetTrimInfo
- Untrim

### Properties

- TrimmedArea

## Constructors Details

### AssocTrimSurfaceActionBody

#### Description
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::AcDbAssocTrimSurfaceActionBody() method.
```text
public AssocTrimSurfaceActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::createInstance() method.
```text
public static ObjectIdCollection CreateInstance(
    ObjectId resultingSurfaceId,
    SurfaceTrimInfo\[\] trimInfo,
    [MarshalAs(UnmanagedType.U1)] bool autoExtend,
    [MarshalAs(UnmanagedType.U1)] bool enable
);
```

### MakeTrimPermanent

#### Description
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::makeTrimPermanent() method.
```text
public void MakeTrimPermanent();
```

### SetTrimInfo

#### Description
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::setTrimInfo() method.
```text
public void SetTrimInfo(
    SurfaceTrimInfo\[\] trimInfoArray,
    [MarshalAs(UnmanagedType.U1)] bool autoExtend
);
```

### Untrim

#### Description
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::untrim() method.
```text
public void Untrim();
```

### TrimmedArea

#### Description
This wraps the ObjectARX AcDbAssocTrimSurfaceActionBody::getTrimmedArea() method.
```text
public double TrimmedArea;
```