# PromptStringResultEventArgs Class

## Overview

#### Description
This class provides data for the PromptedForString event of the Editor class.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.PromptStringResultEventArgs
```

```text
public sealed class PromptStringResultEventArgs : EventArgs;
```

### Properties

- Result

## Properties Details

### Result

#### Description
Gets the result of the selection.
```text
public PromptResult Result;
```

#### Conditions
Read-only