# Autodesk.AutoCAD.DatabaseServices.AnnotationType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbLeader::AnnoType ObjectARX enum.
This enum describes the type of the annotation.
```text
public enum AnnotationType {
  MText,
  FeatureControlFrame,
  BlockRef,
  NoAnnotation
}
```

#### Members
| Members | Description |
| --- | --- |
| MText | The annotation is an MText. |
| FeatureControlFrame | The annotation is a feature control frame. |
| BlockRef | The annotation is a block reference. |
| NoAnnotation | There is no annotation. |