# Autodesk.AutoCAD.DatabaseServices.DwgVersion Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::AcDbDwgVersion ObjectARX enum.
It contains values for the DWG versions.
Class
Autodesk.AutoCAD.DatabaseServices.Database
#### Members

| Members | Description |
| --- | --- |
| AC1001 = 8 |
| AC1002 = 9 | AutoCAD 2.5 |
| AC1003 = 10 | AutoCAD 2.6 |
| AC1004 = 11 | Release 9 |
| AC1005 = 12 |
| AC1006 = 13 | Release 10 |
| AC1007 = 14 |
| AC1008 = 15 |
| AC1009 = 0x10 | R11 and R12 |
| AC1010 = 0x11 |
| AC1011 = 0x12 |
| AC1012 = 0x13 | R13 |
| AC1013 = 20 |
| AC1014 = 0x15 | R14 |
| AC1015 = 0x17 |
| AC1021 = 0x1b | 2007 Final |
| AC1024 = 0x1d | 2010 Final |
| AC1027 = 0x1f | 2013 Final |
| AC1032 = 0x21 | 2018 Final |
| AC1500 = 0x16 |
| AC1800 = 0x19 | 2004 final |
| AC1800a = 0x18 | 2004 mid version |
| AC1To2 = 1 |
| AC1To40 = 2 |
| AC1To50 = 3 |
| AC2100a = 0x1a |
| AC2400a = 0x1c |
| AC2700a = 30 |
| AC2To10 = 5 |
| AC2To20 = 4 |
| AC2To21 = 6 |
| AC2To22 = 7 |
| AC3200a = 0x20 |
| Current = 0x21 |
| Max = 0xff |
| MC0To0 = 0 |
| Newest = 0x21 |
| Unknown = 0xfe |

Previous Declaration
```text
public enum DwgVersion {
AC1001 = 8,
AC1002 = 9,
AC1003 = 10,
AC1004 = 11,
AC1005 = 12,
AC1006 = 13,
AC1007 = 14,
AC1008 = 15,
AC1009 = 0x10,
AC1010 = 0x11,
AC1011 = 0x12,
AC1012 = 0x13,
AC1013 = 20,
AC1014 = 0x15,
AC1015 = 0x17,
AC1021 = 0x1b,
AC1024 = 0x1d,
AC1027 = 0x1f,
AC1500 = 0x16,
AC1800 = 0x19,
AC1800a = 0x18,
AC1To2 = 1,
AC1To40 = 2,
AC1To50 = 3,
AC2100a = 0x1a,
AC2400a = 0x1c,
AC2700a = 30,
AC2To10 = 5,
AC2To20 = 4,
AC2To21 = 6,
AC2To22 = 7,
Current = 0x1f,
Max = 0x7fff,
MC0To0 = 0,
Newest = 0x1f,
Unknown = 0x7ffe
}
```