# Autodesk.AutoCAD.DatabaseServices.HatchEdgeType Enumeration

## Overview

#### Description
This .NET class wraps the AcDbHatch::HatchEdgeType ObjectARX enum.
The HatchEdgeType enumeration lists the geometry types used in hatch boundary edges.
```text
public enum HatchEdgeType {
  CircularArc = 2,
  EllipticalArc = 3,
  Line = 1,
  Spline = 4
}
```

#### Members

| Members | Description |
| --- | --- |
| CircularArc = 2 | Circular edge |
| EllipticalArc = 3 | Elliptical edge |
| Line = 1 | Linear edge |
| Spline = 4 | Spline curve edge |