# Autodesk.AutoCAD.DatabaseServices.JoinStyle Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::JoinStyle ObjectARX class.
This enum describes the styles of join.
```text
public enum JoinStyle {
  StyleNone,
  StyleRound,
  StyleAngle,
  StyleFlat
}
```

#### Members

| Members | Description |
| --- | --- |
| StyleRound |
| StyleAngle |
| StyleFlat |