# EditorVisualStyle Class

## Overview

#### Description
Description to come.
Class Hierarchy
```text
Autodesk.AutoCAD.EditorInput.EditorVisualStyle
```

```text
public sealed class EditorVisualStyle;
```

### Methods

- setCvpVS2d

### Properties

- IsVS2dType
- IsVS3dType

## Methods Details

### setCvpVS2d

#### Description
Description to come.
```text
public static void setCvpVS2d();
```

### IsVS2dType

#### Description
Returns true if visual style is a 2D type.
```text
public static bool IsVS2dType;
```

#### Conditions
Read-only
### IsVS3dType

#### Description
Returns true if visual style is a 3D type.
```text
public static bool IsVS3dType;
```

#### Conditions
Read-only