# MatchProperties Class

## Overview

#### Description
This .NET class wraps the AcDbMatchProperties ObjectARX class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.MatchProperties
```

```text
public class MatchProperties : RXObject;
```

### Methods

- CopyProperties

## Methods Details

### CopyProperties

#### Description
This method is expected to copy any appropriate properties from sourceEntity to targetEntity. flag is a set of bit flags indicating which properties to copy over. The enumerated type provides some predefined bits for the flag argument. The flag argument is an int so that you can make use of the unused bits for your own purposes.
```text
public virtual void CopyProperties(
    Entity sourceEntity,
    Entity targetEntity,
    int flag
);
```

#### Parameters
| Parameters | Description |
| --- | --- |
| Entity sourceEntity | Input entity from which properties will be copied |
| Entity targetEntity | Input entity to which properties will be copied |
| int flag | Input bit flags indicating which properties to copy |

#### Conditions
Read-only