# Autodesk.AutoCAD.DatabaseServices.DetailViewModelEdge Enumeration

## Overview

#### Description
The type of the detail view model edge.
```text
public enum DetailViewModelEdge {
  Smooth,
  SmoothWithBorder,
  SmoothWithConnectionLine,
  Jagged
}
```

#### Members

| Members | Description |
| --- | --- |
| Smooth | AcDbDetailViewStyle::kSmoothenum |
| SmoothWithBorder | AcDbDetailViewStyle::kSmoothWithBorderenum |
| SmoothWithConnectionLine | AcDbDetailViewStyle::kSmoothWithConnectionLineenum |
| Jagged | AcDbDetailViewStyle::kJagged |