# Autodesk.AutoCAD.DatabaseServices.CellContentLayout Enumeration

## Overview

#### Description
This .NET class wraps the CellContentLayout ObjectARX enum.
These values define the content cell layout options.
```text
public enum CellContentLayout {
  Flow = 1,
  StackedHorizontal = 2,
  StackedVertical = 4
}
```

#### Members

| Members | Description |
| --- | --- |
| Flow = 1 | Contents flow from left to right and top to bottom. |
| StackedHorizontal = 2 | Contents are stacked side by side |
| StackedVertical = 4 | Contents are stacked one above other |