# FixedConstraint Class

## Overview

#### Description
This class represents a Fixed constraint node in the owning Assoc2dConstraintGroup.
It can be applied on any constrained geometry.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.ConstraintGroupNode
    Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint
        Autodesk.AutoCAD.DatabaseServices.FixedConstraint
```

```text
public class FixedConstraint : GeometricalConstraint;
```

## Members

### Constructors

- FixedConstraint

## Constructors Details

### FixedConstraint

#### Description
Default constructor.
```text
public FixedConstraint();
```