# Autodesk.AutoCAD.DatabaseServices.AttachmentPoint Enumeration

## Overview

#### Description
This .NET class wraps the AttachmentPoint ObjectARX enum. It represents the attachment point positions of an MText object.
```text
public enum AttachmentPoint {
  BaseAlign = 13,
  BaseCenter = 11,
  BaseFit = 0x11,
  BaseLeft = 10,
  BaseMid = 0x15,
  BaseRight = 12,
  BottomAlign = 14,
  BottomCenter = 8,
  BottomFit = 0x12,
  BottomLeft = 7,
  BottomMid = 0x16,
  BottomRight = 9,
  MiddleAlign = 15,
  MiddleCenter = 5,
  MiddleFit = 0x13,
  MiddleLeft = 4,
  MiddleMid = 0x17,
  MiddleRight = 6,
  TopAlign = 0x10,
  TopCenter = 2,
  TopFit = 20,
  TopLeft = 1,
  TopMid = 0x18,
  TopRight = 3
}
```

#### Members

| Members | Description |
| --- | --- |
| BaseAlign = 13 | The attachment is aligned with the base. |
| BaseCenter = 11 | The attachment is centered with the base. |
| BaseFit = 0x11 | The attachment is fit with the base. |
| BaseLeft = 10 | The attachment is left of the base. |
| BaseMid = 0x15 | The attachment is in the middle of the base. |
| BaseRight = 12 | The attachment is right of the base. |
| BottomAlign = 14 | The attachment is aligned with the bottom. |
| BottomCenter = 8 | The attachment is centered with the bottom. |
| BottomFit = 0x12 | The attachment is fit with the bottom. |
| BottomLeft = 7 | The attachment is left of the bottom. |
| BottomMid = 0x16 | The attachment is in the middle of the bottom. |
| BottomRight = 9 | The attachment is right of the bottom. |
| MiddleAlign = 15 | The attachment is aligned with the middle. |
| MiddleCenter = 5 | The attachment is centered with the middle. |
| MiddleFit = 0x13 | The attachment is fit with the middle. |
| MiddleLeft = 4 | The attachment is left of the middle. |
| MiddleMid = 0x17 | The attachment is in the middle with the middle. |
| MiddleRight = 6 | The attachment is right of the middle. |
| TopAlign = 0x10 | The attachment is aligned with the top. |
| TopCenter = 2 | The attachment is centered with the top. |
| TopFit = 20 | The attachment is fit with the top. |
| TopLeft = 1 | The attachment is left of the top. |
| TopMid = 0x18 | The attachment is middle of the top. |
| TopRight = 3 | The attachment is right of the top. |