# Autodesk.AutoCAD.DatabaseServices.CellMargins Enumeration

## Overview

#### Description
This .NET class wraps the CellMargins ObjectARX enum.
These values specify the margin types.
```text
public enum CellMargins {
  Bottom = 4,
  Left = 2,
  Right = 8,
  Top = 1
}
```

#### Members

| Members | Description |
| --- | --- |
| Bottom = 4 | Bottom margin |
| Left = 2 | Left margin |
| Right = 8 | Right margin |
| Top = 1 | Top margin |