# Surface Class

## Overview

#### Description
This .Net class wraps the ObjectARX class AcDbSurface.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.Entity
        Autodesk.AutoCAD.DatabaseServices.Surface
            Autodesk.AutoCAD.DatabaseServices.LoftedSurface
            Autodesk.AutoCAD.DatabaseServices.PlaneSurface
            Autodesk.AutoCAD.DatabaseServices.SweptSurface
```

```text
public class Surface : Entity;
```

### Methods

- [ChamferEdges(SubentityId[], SubentityId, double, double)](#chamferedges(subentityid[],-subentityid,-double,-double))
- [ChamferEdges(SubentityId[], SubentityId, double, double, [MarshalAs(UnmanagedType.U1)] bool)](#chamferedges(subentityid[],-subentityid,-double,-double,-[marshalas(unmanagedtype.u1)]-bool))
- ConvertToNurbSurface
- CreateBlendSurface(LoftProfile, LoftProfile, BlendOptions)
- [CreateBlendSurface(LoftProfile, LoftProfile, BlendOptions, [MarshalAs(UnmanagedType.U1)] bool)](#createblendsurface(loftprofile,-loftprofile,-blendoptions,-[marshalas(unmanagedtype.u1)]-bool))
- CreateExtendSurface
- CreateExtrudedSurface(Profile3d, Vector3d, SweepOptions)
- [CreateExtrudedSurface(Profile3d, Vector3d, SweepOptions, [MarshalAs(UnmanagedType.U1)] bool)](#createextrudedsurface(profile3d,-vector3d,-sweepoptions,-[marshalas(unmanagedtype.u1)]-bool))
- CreateFilletSurface(ObjectId, Point3d, ObjectId, Point3d, double, Autodesk.AutoCAD.DatabaseServices.FilletTrimMode, Vector3d)
- [CreateFilletSurface(ObjectId, Point3d, ObjectId, Point3d, double, Autodesk.AutoCAD.DatabaseServices.FilletTrimMode, Vector3d, [MarshalAs(UnmanagedType.U1)] bool)](#createfilletsurface(objectid,-point3d,-objectid,-point3d,-double,-autodesk.autocad.databaseservices.fillettrimmode,-vector3d,-[marshalas(unmanagedtype.u1)]-bool))
- CreateInterferenceObjects
- [CreateLoftedSurface(LoftProfile[], LoftProfile[], LoftProfile, LoftOptions)](#createloftedsurface(loftprofile[],-loftprofile[],-loftprofile,-loftoptions))
- [CreateLoftedSurface(LoftProfile[], LoftProfile[], LoftProfile, LoftOptions, [MarshalAs(UnmanagedType.U1)] bool)](#createloftedsurface(loftprofile[],-loftprofile[],-loftprofile,-loftoptions,-[marshalas(unmanagedtype.u1)]-bool))
- [CreateNetworkSurface(Profile3d[], Profile3d[])](#createnetworksurface(profile3d[],-profile3d[]))
- [CreateNetworkSurface(Profile3d[], Profile3d[], [MarshalAs(UnmanagedType.U1)] bool)](#createnetworksurface(profile3d[],-profile3d[],-[marshalas(unmanagedtype.u1)]-bool))
- CreateOffsetSurface(Entity, double)
- [CreateOffsetSurface(Entity, double, [MarshalAs(UnmanagedType.U1)] bool)](#createoffsetsurface(entity,-double,-[marshalas(unmanagedtype.u1)]-bool))
- CreatePatchSurface(PathRef, ObjectIdCollection, int, double)
- [CreatePatchSurface(PathRef, ObjectIdCollection, int, double, [MarshalAs(UnmanagedType.U1)] bool)](#createpatchsurface(pathref,-objectidcollection,-int,-double,-[marshalas(unmanagedtype.u1)]-bool))
- CreateRevolvedSurface(Profile3d, Point3d, Vector3d, double, double, RevolveOptions)
- [CreateRevolvedSurface(Profile3d, Point3d, Vector3d, double, double, RevolveOptions, [MarshalAs(UnmanagedType.U1)] bool)](#createrevolvedsurface(profile3d,-point3d,-vector3d,-double,-double,-revolveoptions,-[marshalas(unmanagedtype.u1)]-bool))
- [CreateRevolvedSurface(Profile3d, Profile3d, [MarshalAs(UnmanagedType.U1)] bool, double, double, RevolveOptions)](#createrevolvedsurface(profile3d,-profile3d,-[marshalas(unmanagedtype.u1)]-bool,-double,-double,-revolveoptions))
- [CreateRevolvedSurface(Profile3d, Profile3d, [MarshalAs(UnmanagedType.U1)] bool, double, double, RevolveOptions, [MarshalAs(UnmanagedType.U1)] bool)](#createrevolvedsurface(profile3d,-profile3d,-[marshalas(unmanagedtype.u1)]-bool,-double,-double,-revolveoptions,-[marshalas(unmanagedtype.u1)]-bool))
- CreateSectionObjects
- CreateSweptSurface(Profile3d, Profile3d, SweepOptions)
- [CreateSweptSurface(Profile3d, Profile3d, SweepOptions, [MarshalAs(UnmanagedType.U1)] bool)](#createsweptsurface(profile3d,-profile3d,-sweepoptions,-[marshalas(unmanagedtype.u1)]-bool))
- ExtendEdges
- [FilletEdges(SubentityId[], double, [MarshalAs(UnmanagedType.U1)] bool)](#filletedges(subentityid[],-double,-[marshalas(unmanagedtype.u1)]-bool))
- [FilletEdges(SubentityId[], DoubleCollection, DoubleCollection, DoubleCollection)](#filletedges(subentityid[],-doublecollection,-doublecollection,-doublecollection))
- GetSubentityColor
- GetSubentityMaterial
- GetSubentityMaterialMapper
- ImprintEntity
- ProjectOnToSurface
- RayTest
- SetSubentityColor
- SetSubentityMaterial
- SetSubentityMaterialMapper
- SliceByPlane
- SliceBySurface
- TrimSurface

### Other

- AutoCAD.DatabaseServices.Surface.WireframeTypeEnum Enumeration

### Properties

- CreationActionBodyId
- GeometricExtents
- ModificationActionBodyIds
- Perimeter
- UIsoLineDensity
- UsesGraphicsCache
- WireframeType

## Methods Details

### ChamferEdges(SubentityId[], SubentityId, double, double)

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::chamferEdges Method.
```text
public virtual void ChamferEdges(
    SubentityId\[\] edgeSubentIds,
    SubentityId baseFaceSubentId,
    double baseDist,
    double otherDist
);
```

### ChamferEdges(SubentityId[], SubentityId, double, double, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps AcDbSurface::chamferEdges() method
```text
public void ChamferEdges(
    SubentityId\[\] subentityIds,
    SubentityId baseSubentityId,
    double baseDist,
    double otherDist,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### ConvertToNurbSurface

#### Description
This wraps the ObjectARX AcDbSurface::convertToNurbSurface() method
```text
public Autodesk.AutoCAD.DatabaseServices.NurbSurface\[\] ConvertToNurbSurface();
```

### CreateBlendSurface(LoftProfile, LoftProfile, BlendOptions)

#### Description
This wraps the ObjectARX AcDbSurface::createBlendSurface () method.
```text
public static Autodesk.AutoCAD.DatabaseServices.Surface CreateBlendSurface(
    LoftProfile startProfile,
    LoftProfile endProfile,
    BlendOptions blendOptionsd
);
```

### CreateBlendSurface(LoftProfile, LoftProfile, BlendOptions, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbSurface::createBlendSurface() method.
```text
public static ObjectId CreateBlendSurface(
    LoftProfile startProfile,
    LoftProfile endProfile,
    BlendOptions blendOptions,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### CreateExtendSurface

#### Description
This wraps the ObjectARX AcDbSurface::createExtendSurface() method.
```text
public static ObjectId CreateExtendSurface(
    ObjectId sourceSurface,
    SubentityId\[\] edges,
    double extension,
    EdgeExtensionType extOption,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### CreateExtrudedSurface(Profile3d, Vector3d, SweepOptions)

#### Description
This wraps: AcDbSurface::createExtrudedSurface (edSurface) method.
```text
public static ExtrudedSurface CreateExtrudedSurface(
    Profile3d pSweep,
    Vector3d directionVec,
    SweepOptions sweepOptions
);
```

### CreateExtrudedSurface(Profile3d, Vector3d, SweepOptions, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbSurface::createExtrudedSurface() method.
```text
public static ObjectId CreateExtrudedSurface(
    Profile3d pSweep,
    Vector3d directionVec,
    SweepOptions sweepOptions,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### CreateFilletSurface(ObjectId, Point3d, ObjectId, Point3d, double, Autodesk.AutoCAD.DatabaseServices.FilletTrimMode, Vector3d)

#### Description
This wraps the ObjectARXAcDbSurface::createFilletSurface () method.
```text
public static Autodesk.AutoCAD.DatabaseServices.Surface CreateFilletSurface(
    ObjectId surfId1,
    Point3d pickPt1,
    ObjectId surfId2,
    Point3d pickPt2,
    double radius,
    Autodesk.AutoCAD.DatabaseServices.FilletTrimMode trimMode,
    Vector3d projDir
);
```

### CreateFilletSurface(ObjectId, Point3d, ObjectId, Point3d, double, Autodesk.AutoCAD.DatabaseServices.FilletTrimMode, Vector3d, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbSurface::createFilletSurface () method.
```text
public static ObjectId CreateFilletSurface(
    ObjectId surfId1,
    Point3d pickPt1,
    ObjectId surfId2,
    Point3d pickPt2,
    double radius,
    Autodesk.AutoCAD.DatabaseServices.FilletTrimMode trimMode,
    Vector3d projDir,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### CreateInterferenceObjects

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::createInterferenceObjects().
```text
public virtual Entity\[\] CreateInterferenceObjects(
    Entity ent,
    int flags
);
```

### CreateLoftedSurface(LoftProfile[], LoftProfile[], LoftProfile, LoftOptions)

#### Description
This wraps the ObjectARX AcDbLoftedSurface::createLoftedSurface ( ) method.
```text
public static Autodesk.AutoCAD.DatabaseServices.Surface CreateLoftedSurface(
    LoftProfile\[\] crossSections,
    LoftProfile\[\] guides,
    LoftProfile path,
    LoftOptions loftOptions
);
```

### CreateLoftedSurface(LoftProfile[], LoftProfile[], LoftProfile, LoftOptions, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbLoftedSurface::createLoftedSurface ( ) method.
```text
public static ObjectId CreateLoftedSurface(
    LoftProfile\[\] crossSections,
    LoftProfile\[\] guides,
    LoftProfile path,
    LoftOptions loftOptions,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### CreateNetworkSurface(Profile3d[], Profile3d[])

#### Description
This wraps the ObjectARX AcDbSurface:: createNetworkSurface () method.
```text
public static Autodesk.AutoCAD.DatabaseServices.Surface CreateNetworkSurface(
    Profile3d\[\] uProfiles,
    Profile3d\[\] vProfiles
);
```

### CreateNetworkSurface(Profile3d[], Profile3d[], [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbSurface::createNetworkSurface() method.
```text
public static ObjectId CreateNetworkSurface(
    Profile3d\[\] uProfiles,
    Profile3d\[\] vProfiles,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### CreateOffsetSurface(Entity, double)

#### Description
This wraps the ObjectARX AcDbSurface::createOffsetSurface () method.
```text
public static Entity CreateOffsetSurface(
    Entity entity,
    double offsetDistance
);
```

### CreateOffsetSurface(Entity, double, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbSurface::createOffsetSurface () method.
```text
public static ObjectId CreateOffsetSurface(
    Entity entity,
    double offsetDistance,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### CreatePatchSurface(PathRef, ObjectIdCollection, int, double)

#### Description
This wrap ObjectARX AcDbSurface::createPatchSurface () method.
```text
public static Autodesk.AutoCAD.DatabaseServices.Surface CreatePatchSurface(
    PathRef inputPathRef,
    ObjectIdCollection constraintIds,
    int continuity,
    double bulge
);
```

### CreatePatchSurface(PathRef, ObjectIdCollection, int, double, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbSurface::createPatchSurface () method.
```text
public static ObjectId CreatePatchSurface(
    PathRef inputPathRef,
    ObjectIdCollection constraintIds,
    int continuity,
    double bulge,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### CreateRevolvedSurface(Profile3d, Point3d, Vector3d, double, double, RevolveOptions)

#### Description
This wraps the ObjectARX AcDbSurface::createRevolvedSurface() method.
```text
public static RevolvedSurface CreateRevolvedSurface(
    Profile3d rev,
    Point3d axisPnt,
    Vector3d axisDir,
    double revAngle,
    double startAngle,
    RevolveOptions revolveOptions
);
```

### CreateRevolvedSurface(Profile3d, Point3d, Vector3d, double, double, RevolveOptions, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbSurface::createRevolvedSurface() method.
```text
public static ObjectId CreateRevolvedSurface(
    Profile3d rev,
    Point3d axisPnt,
    Vector3d axisDir,
    double revAngle,
    double startAngle,
    RevolveOptions revolveOptions,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### CreateRevolvedSurface(Profile3d, Profile3d, [MarshalAs(UnmanagedType.U1)] bool, double, double, RevolveOptions)

#### Description
This wraps the ObjectARX AcDbSurface::createRevolvedSurface() method.
```text
public static RevolvedSurface CreateRevolvedSurface(
    Profile3d rev,
    Profile3d axisEnt,
    [MarshalAs(UnmanagedType.U1)] bool flipAxisDirection,
    double revAngle,
    double startAngle,
    RevolveOptions revolveOptions
);
```

### CreateRevolvedSurface(Profile3d, Profile3d, [MarshalAs(UnmanagedType.U1)] bool, double, double, RevolveOptions, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbSurface::createRevolvedSurface( ) method.
```text
public static ObjectId CreateRevolvedSurface(
    Profile3d rev,
    Profile3d axisEnt,
    [MarshalAs(UnmanagedType.U1)] bool flipAxisDirection,
    double revAngle,
    double startAngle,
    RevolveOptions revolveOptions,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### CreateSectionObjects

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::createSectionObjects Method.
```text
public virtual Entity\[\] CreateSectionObjects(
    Plane sectionPlane
);
```

### CreateSweptSurface(Profile3d, Profile3d, SweepOptions)

#### Description
This wraps the ObjectARX AcDbSurface:: createSweptSurface() method.
```text
public static SweptSurface CreateSweptSurface(
    Profile3d sweep,
    Profile3d path,
    SweepOptions sweepOptions
);
```

### CreateSweptSurface(Profile3d, Profile3d, SweepOptions, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbSurface::createSweptSurface() method.
```text
public static ObjectId CreateSweptSurface(
    Profile3d sweep,
    Profile3d path,
    SweepOptions sweepOptions,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### ExtendEdges

#### Description
This wraps the ObjectARX AcDbSurface::extendEdges() method
```text
public void ExtendEdges(
    FullSubentityPath\[\] edges,
    double extension,
    EdgeExtensionType extOption,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### FilletEdges(SubentityId[], double, [MarshalAs(UnmanagedType.U1)] bool)

#### Description
This wraps the ObjectARX AcDbSurface::filletEdges() method
```text
public void FilletEdges(
    SubentityId\[\] subentityIds,
    double radius,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### FilletEdges(SubentityId[], DoubleCollection, DoubleCollection, DoubleCollection)

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::filletEdges Method.
```text
public virtual void FilletEdges(
    SubentityId\[\] subentityIds,
    DoubleCollection radius,
    DoubleCollection startSetback,
    DoubleCollection endSetback
);
```

### GetSubentityColor

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::getSubentColor Method.
```text
public virtual Autodesk.AutoCAD.Colors.Color GetSubentityColor(
    SubentityId subEntityId
);
```

### GetSubentityMaterial

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::getSubentMaterial Method.
```text
public virtual ObjectId GetSubentityMaterial(
    SubentityId subEntityId
);
```

### GetSubentityMaterialMapper

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::getSubentMaterialMapper.
```text
public virtual Mapper GetSubentityMaterialMapper(
    SubentityId subEntityId
);
```

### ImprintEntity

```text
public virtual void ImprintEntity(
    Entity entityToImprint
);
```

### ProjectOnToSurface

#### Description
This wraps the ObjectARX AcDbSurface::projectOnToSurface() method
```text
public Entity\[\] ProjectOnToSurface(
    Entity entityToProject,
    Vector3d projectionDirection
);
```

### RayTest

#### Description
This wraps the ObjectARX AcDbSurface::rayTest() method.
```text
public void RayTest(
    Point3d rayBasePoint,
    Vector3d rayDir,
    double rayRadius,
    out SubentityId\[\] subEntIds,
    out DoubleCollection parameters
);
```

### SetSubentityColor

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::setSubentColor Method.
```text
public virtual void SetSubentityColor(
    SubentityId subEntityId,
    Autodesk.AutoCAD.Colors.Color color
);
```

### SetSubentityMaterial

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::setSubentMaterial Method.
```text
public virtual void SetSubentityMaterial(
    SubentityId subEntityId,
    ObjectId materialId
);
```

### SetSubentityMaterialMapper

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::setSubentMaterialMapper Method.
```text
public virtual void SetSubentityMaterialMapper(
    SubentityId subEntityId,
    Mapper mapper
);
```

### SliceByPlane

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::sliceByPlane Method.
```text
public virtual SurfaceSliceResults SliceByPlane(
    Plane slicePlane
);
```

### SliceBySurface

#### Description
This .NET method wraps the ObjectARX method AcDbSurface::sliceBySurface Method.
```text
public virtual SurfaceSliceResults SliceBySurface(
    Autodesk.AutoCAD.DatabaseServices.Surface slicingSurface
);
```

### TrimSurface

#### Description
This wraps the ObjectARX AcDbSurface::trimSurface() method.
```text
public static void TrimSurface(
    ObjectId blankSurfaceId,
    ObjectIdCollection toolSurfaceIds,
    ObjectIdCollection toolCurveIds,
    Vector3dCollection projVectors,
    Point3d pickPoint,
    Vector3d viewVector,
    [MarshalAs(UnmanagedType.U1)] bool bAutoExtend,
    [MarshalAs(UnmanagedType.U1)] bool associativeEnabled
);
```

### AutoCAD.DatabaseServices.Surface.WireframeTypeEnum Enumeration

#### Description
This wraps AcDbLoftedSurface::WireframeType enumeration.
```text
public enum WireframeTypeEnum {
  Isolines,
  IsoParms
}
```

## Properties Details

### CreationActionBodyId

#### Description
This wraps the ObjectARX AcDbSurface::creationActionBodyId() method
```text
public ObjectId CreationActionBodyId;
```

### GeometricExtents

#### Description
Accesses the corner points (in WCS coordinates) of a box (with edges parallel to the WCS X, Y, and Z axes) that encloses the 3D extents of the entity, and return those points as an instance of class Extents in the "extents" parameter.
```text
public override Extents3d GeometricExtents;
```

#### Conditions
Read-only
### ModificationActionBodyIds

#### Description
This wraps the ObjectARX AcDbSurface::modificationActionBodyIds() method
```text
public ObjectIdCollection ModificationActionBodyIds;
```

### Perimeter

#### Description
This wraps the ObjectARX AcDbSurface::getPerimeter() method
```text
public double Perimeter;
```

### UIsoLineDensity

#### Description
This wraps the ObjectARXAcDbSurface::setUIsolineDensity() and AcDbSurface::uIsolineDensity() methods.
```text
public short UIsoLineDensity;
```

### UsesGraphicsCache

#### Description
This property is a wrapper for the AcDbSurface::usesGraphicsCache() method which is used by AutoCAD to determine whether or not to use cached graphics for the surface. If the method returns true, then cached graphics will be used. Only database resident entities can use graphics caching, so this method is not called for entities not in an AcDbDatabase.
```text
public bool UsesGraphicsCache;
```

### WireframeType

#### Description
This wraps the ObjectARX AcDbSurface::getWireframeType() and AcDbSurface::setWireframeType() methods.
```text
public WireframeTypeEnum WireframeType;
```