# Autodesk.AutoCAD.DatabaseServices.PhysicalIntensityMethod Enumeration

## Overview

#### Description
This .NET class wraps the AcDbLight::PhysicalIntensityMethod ObjectARX enum.
```text
public enum PhysicalIntensityMethod {
  PeakIntensity,
  Flux,
  Illuminance
}
```

#### Members

| Members | Description |
| --- | --- |
| PeakIntensity | Peak Intensity |
| Flux | Flux |
| Illuminance | Illuminance |