# Autodesk.AutoCAD.DatabaseServices.SelectType Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::SelectType ObjectARX class. It gives the selection type for a table cell.
```text
public enum SelectType {
  Crossing = 2,
  Window = 1
}
```

#### Members

| Members | Description |
| --- | --- |
| Crossing = 2 | Indicates a cross selection type. |
| Window = 1 | Indicates a window selection type. |