# Autodesk.AutoCAD.DatabaseServices.SweepOptionsAlignOption Enumeration

## Overview

#### Description
This .NET class wraps the AcDbSweepOptions::AlignOption ObjectARX enum.
Enumerates the alignment options for swept objects.
```text
public enum SweepOptionsAlignOption {
  NoAlignment,
  AlignSweepEntityToPath,
  TranslateSweepEntityToPath,
  TranslatePathToSweepEntity
}
```

#### Members
| Members | Description |
| --- | --- |
| NoAlignment |
| AlignSweepEntityToPath |
| TranslateSweepEntityToPath |
| TranslatePathToSweepEntity |