# AssocOffsetSurfaceActionBody Class

## Overview

#### Description
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody class.
Class Hierarchy
```text
Autodesk.AutoCAD.DatabaseServices.DBObject
    Autodesk.AutoCAD.DatabaseServices.AssocActionBody
        Autodesk.AutoCAD.DatabaseServices.AssocParamBasedActionBody
            Autodesk.AutoCAD.DatabaseServices.AssocSurfaceActionBody
                Autodesk.AutoCAD.DatabaseServices.AssocOffsetSurfaceActionBody
```

```text
public class AssocOffsetSurfaceActionBody : AssocSurfaceActionBody;
```

### Constructors

- AssocOffsetSurfaceActionBody

### Methods

- CreateInstance
- GetDistance
- SetDistance

### Properties

- Distance

## Constructors Details

### AssocOffsetSurfaceActionBody

#### Description
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody::AcDbAssocOffsetSurfaceActionBody() method.
```text
public AssocOffsetSurfaceActionBody();
```

### CreateInstance

#### Description
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody::createInstance() method.
```text
public static ObjectId CreateInstance(
    ObjectId resultingSurfaceId,
    ObjectId inputSurfaceId,
    double distance,
    [MarshalAs(UnmanagedType.U1)] bool bEnable
);
```

### GetDistance

#### Description
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody::distance() method.
```text
public double GetDistance(
    out string expression,
    out string evaluatorId
);
```

### SetDistance

#### Description
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody::setDistance() method.
```text
public void SetDistance(
    double distance,
    string expression,
    string evaluatorId
);
```

### Distance

#### Description
This wraps the ObjectARX AcDbAssocOffsetSurfaceActionBody::distance() and AcDbAssocOffsetSurfaceActionBody::setDistance ()methods.
```text
public double Distance;
```