# Autodesk.AutoCAD.DatabaseServices.FilerType Enumeration

## Overview

#### Description
This .NET class wraps the FilerType ObjectARX enum. This enum defines the types of filers.
```text
public enum FilerType {
  FileFiler,
  CopyFiler,
  UndoFiler,
  BagFiler,
  IdTranslateFiler,
  PageFiler,
  DeepCloneFiler,
  IdFiler,
  PurgeFiler,
  WblockCloneFiler
}
```

#### Members

| Members | Description |
| --- | --- |
| FileFiler |
| CopyFiler |
| UndoFiler |
| BagFiler |
| IdTranslateFiler |
| PageFiler |
| DeepCloneFiler |
| IdFiler |
| PurgeFiler |
| WblockCloneFiler |