# Autodesk.AutoCAD.DatabaseServices.Planarity Enumeration

## Overview

#### Description
This .NET class wraps the AcDb::Planarity ObjectARX enum.
```text
public enum Planarity {
  NonPlanar,
  Planar,
  Linear
}
```

#### Members

| Members | Description |
| --- | --- |
| NonPlanar |
| Planar |
| Linear |