# Autodesk.AutoCAD.DatabaseServices.CellClass Enumeration

## Overview

#### Description
This .NET class wraps the CellClass ObjectARX enum.
These values define the cell class types.
```text
public enum CellClass {
  None,
  Label,
  Data
}
```

#### Members

| Members | Description |
| --- | --- |
| None | None |
| Label | Label class |
| Data | Data class |